[
  {
    "keyword": "espresso",
    "text": "First time into this hobby. I drink coffee almost every day, espresso based drink. With milk too sometimes. But occasionally I like to make pour over too (preground right now). What I'm thinking right now is to get a good grinder first, and good enough espresso machine just to see whether I want to invest more in the future.\n\nGrinder: Timemore 078s.\n- Aesthetic is a big factor for me 😅\n- Good enough for both expresso and pour over. \n- I'm not a fan of grinder with bellow. So a lot of models are not included with this criteria alone. DF 64, Eureka Mignon. \n- Other alternatives I might be considering is Fellow Opus, or Niche Zero.\n- Not planning to go too much higher than current pricing bracket as it'll be my first purchase. And I'm not from US/EU. Even $100 translates to a considerable big amount of money in my country.\n- I'm aware that Timemore have it's own issues. But I did read great reviews too. It's a gamble in a way, I guess.\n\nEspresso machine: Delongi ECP 3420.\n- Overall seems cheap and good enough.\n\nMy question is whether this is a good plan? Or is there any other comparable alternatives that I might have missed? Thanks in advance!",
    "sentiment": 0.9816,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Is there an \"omni\" water profile.\n\n\nI looked at Third Wave Water, and it has a few different water profiles for different beans and brew methods. I have an espresso machine, but at the moment, I've been focusing on filter in an attempt to taste the notes the bags say. I mostly hang around light to medium roasts for both espresso and filter. Is there a good \"all-arounder\" for light and medium roasts for both espresso and filter?",
    "sentiment": 0.5927,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "This week, we have the New India Ratnagiri Estate Anaerobic Natural!\n\n\n\nThey say there's a first time for everything; in this case, it's not only the first Indian coffee I've featured, but it's a Limited Release, as well! Many people might be familiar with Monsooned Malabar, a completely different animal, which you can forget right now. This is not that.\n\nGrown on one of Indias premier Estates, Ratnagiri is Rainforest Alliance certified. There are three layers of shade cover, slowing coffee growth and boosting flavor, but also providing a habitat for 50 kinds of birds, as well as monkeys, boar, tigers, leopards, mongoose, and elephants. The area is a Unesco World Heritage site, as well as the birthplace of Indian coffee, and Ratnagiri Estate is serious about preserving the ecology, while producing excellent coffee.\n\nThis coffee is anaerobically processed: after an 84 hour extended fermentation in stainless tanks, the coffee is placed on raised beds and naturally slow-dried over 27 days. \n\nSo what do we get? For sure, notes of quality dark chocolate and roasted peanuts, but it's the berry compote, Pom juice, and ripe papaya fruit notes, with exotic spices like cardamom, nutmeg, maybe even patchouli, or mulled rum, that truly make this coffee unique. Great for drip methods and excellent for espresso!\n\n\n\n\n'reddit' is the code for 15% off sitewide! \n\n\n\n\nhttps://www.westcoastroasting.com/limited-edition/",
    "sentiment": 0.9906,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Yes, I would actually consider it the best way to get started brewing espresso.  The manual workflow and simplistic design teach you a lot about the espresso brewing process, and allow you to get features and results equivalent to automatic machines that cost orders of magnitude more.",
    "sentiment": 0.8316,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Coffee Noob: replicating Starbucks Canned Espresso Light.\n\nI'm 33 years old and somehow I've gotten through life so far without drinking coffee. Like the smell but was never big on the taste.\n\nI have night owl tendencies, so generally I don't feel productive at work until the PM hours. I thought I'd give coffee another try to help me wake up faster. I picked up some Starbucks canned espresso with light cream and actually enjoyed the taste. Hard to say if the caffeine had an effect. I don't think it helped me feel more awake, but I think it got rid of some of the morning grogginess.\n\nI could just keep buying these but I'd rather opt for a cheaper bulk option. I did some searching and came across 'cold brew'. Supposedly this method results in less acidity, less bitterness, and more caffeine. So I bought Starbucks cold brew concentrate. The instructions say mix 180mL with 180 mL water. I used 180 mL milk instead. It's not as good as the canned espresso. Aftertaste is still too bitter for my liking. Maybe I need to use whole milk instead of 1%? Then I added 5g of sugar, the same amount as in the espresso. Still didn't taste as good, which makes sense because the sugar is less diluted in the espresso.\n\nThen I looked into the brewing method for the espresso. Apparently it is brewed using the ristretto method. Maybe the better taste is because of this?\n\nAny suggestions on how to replicate this flavor at home? Or is there no other way than to add more sugar and cream? Do I need an espresso machine?",
    "sentiment": -0.3067,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Is the Flair neo flex worth it as an entry level manual espresso maker?",
    "sentiment": 0.2263,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Getting my first electric grinder. Want to invest in something good, that would serve me for a long time. I'm looking at the DF83v vs Varia VS6 vs Timemore Sculptor 078S. I mostly do Aeropress and lever espresso, (50/50). Any suggestions? Excluded Mazzer Philos because in my country it is $1400 delivered, while DF83V is $800, and VS6 is $950. Would appreciate any input.",
    "sentiment": 0.5423,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "complete newbie here.\n\ni drink the swill they have at work all day long.  we have a keurig at home.\n\ni'm ready to step up our coffee game. what are some options for a good coffee maker to make reasonable quality for <$500?\n\ni'm not into espresso, just normal coffee.\n\nthanks in advance!",
    "sentiment": 0.8221,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Ah, well espresso is a different thing altogether. The parent comment of this thread was talking about using an automated drip coffee maker after all, so it'd made sense that the expectation would be a discussion along the lines of that and/or pour overs. Plus, you said brew....that's not something you refer to when doing espresso's. Usually in coffee discussions, people would describe it as \"pulling a shot\" of espresso, not brewing an espresso.",
    "sentiment": 0.2732,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "[B&W Wilton Benitez - Pink Bourbon](https://www.blackwhiteroasters.com/products/r-wilton-benitez-pink-bourbon-jan-25)\n\n\nI'm late to the party on this, but I'm not in America. A local specialty shop did a B&W \"drop\" a couple of weeks ago and I had to get the internet coffee to see what everyone was on about. I didn't notice a roast date anywhere, but I gave it two weeks and I'm willing to bet it had taken two or three weeks to get to me too.\n\n\nFirst attempts were 15/16:1 with a bit of a range of grinds to try dial it in. I think I was looking for something that wasn't there, people were so excited about this coffee a while back and I had gotten the impression it was a bolder coffee than it is. I personally wouldn't call this funky, it's a bit hoppy for sure but very clean. Where this really shone for me was when I moved to espresso, particularly espresso tonics, the botanical and citrus hits taste great in that.\n\n\nIt's a nice coffee, not as vibrant as other Wilton Benitez beans I've had. I don't regret picking it up but it is a reminder that a lot of people raving about something on the internet just means it's something that's very accessable to a lot of people and has broad appeal. That's not a bad thing, but it's not FOMO worthy either.",
    "sentiment": 0.9792,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Yeah, for coffee that 10th of a gram doesn't really make a difference but when you're brewing espresso (like I just started to) every little bit matters apparently.",
    "sentiment": 0.0855,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Hey everyone! I'm looking for a grinder dedicated to aeropress/french press/V60, on which changing the grind size is easy. I would like for it do be single dose too, since my girlfriend and I don't enjoy the same kind of beans.\n\nI already have an espresso grinder (Mignon Turbo) and a hand grinder (1Zpresso Q2), but I would love another electric grinder on which changing the grind size is easy, to accomodate for all brewing methods.\n\nPrice shouldnt be an issue, as long as it's not in the thousands. I also wouldn't mind a hand grinder if there is a way to easily change the grind size to some presets.\n\nThanks!",
    "sentiment": 0.9808,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "usually cheap burr grinders like that are built crappily, are obnoxiously loud, don't grind well, and make a mess because they produce massive amounts of static.  The \"don't grind well\" part is amplified further when making espresso.\n\nI recommend them to literally nobody.  Save your money for an entry level Baratza or something similar.  Or go to your local coffee roaster and have them grind coffee for you and you can put it in an airtight container and use it within a week.  It'll taste better than what those cheap grinders will do.",
    "sentiment": 0.3964,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "I think you'd be hard pressed to find a cafe serving a gesha like that as an espresso.  Usually they're done as pourovers.  Not that they can't be made as an espresso.  Cafes usually have dedicated espresso grinders dialed in for specific coffees that they will be using a lot of, usually a house espresso blend and a decaf.  Some cafes do have a single-origin espresso offering, but that hopper isn't going to filled with a gesha that sells for $8-$10+ per cup.  They would be single-dosing it and likely grinding it on the same grinder they use for their batch brew coffees, and those grinders are not always set up and capable of consistently brewing good espresso.\n\nSo, it's entirely possible that a cafe could be serving a natural Panama gesha as espresso but it's not as simple as picking one of many coffees on the menu and requesting it as an espresso.",
    "sentiment": 0.9194,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Oh, there's no problem with those beans.  Some people will say that there's no difference between \"espresso blend\" or \"espresso roast\" and other styles of coffee beans.  But roasters do roast them differently (think of different ways to cook steak, like slow simmering versus searing) to make them a little easier to extract in the short time that it takes to make espresso.\n\nFor you, in a switch and french press?  Just treat them as normal. Maybe they're a bit darker than what you usually have (though I don't know what your usual beans are), so you can experiment with grind size and temperature if you'd like.",
    "sentiment": 0.8823,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "you're good, all coffee roasts can be brewed in a french press. play with steep time or grind size if it's not to your liking.\n\ndue to the intense brewing process of an actual espresso machine (couple seconds, high pressure), roasters sometimes do an adjusted blend of bean varieties or a specific roasting grade to work better on those\\*\n\n\\*according to their taste.  \n  \n (mokkapot does brew strong coffee, though not what would qualify as espresso)",
    "sentiment": 0.8605,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Whole beans?  Or is it already finely ground for espresso?",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "i’ve got espresso blend from my sister, she didnt know im using filter only. can i brew it with frenchpress? or should i buy mokapot?",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "I've spent a fair amount of time researching this topic. The biggest issue is that if you batch brew something as dense as Cometeer coffee e.g. 15 grams of coffee in, 25 grams of brew out, you'll lose 20-25 grams of brew into the coffee grounds expanding (even after pressing them with something like Aeropress). I believe espresso loses less by keeping the grounds under pressure but it's not a batch brew. \n\nBased on their patent, Cometeer deal with this by using a centrifuge to extract all the brew from the grounds. I occasionally make espressos in a batch and freeze them in silicone containers in the freezer for an americano later, the results are tasty. But it takes too much time. I mainly keep buying Cometeer. It's expensive but well-deserved imo given how hard it is to replicate at home.",
    "sentiment": -0.25,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Totally true about those \"ungodly great beans\" - I've found the best way to discover them is actually keeping a really basic log of what you liked and why. After blowing too much cash on fancy beans that didnt click with me, I started writing batch numbers and origins down with quick notes like \"fruity\" or \"chocolate bomb\" or just \"meh\". Now I kinda know what regions I prefer for espresso (Ethiopia and Colombia usually slap) and which roasters nail my preferred profile. Water quality matters almost as much tho - when i moved apartments my exact same bean setup suddenly tasted totally different until I started filtering.",
    "sentiment": 0.9273,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "I have a relative who owns 2 built-in all-in-one espresso machines that cost 10k usd total, one at each floor of her house. Super slick, sits flush with the wall and i’m sure it’s capable of pumping out great coffee with ease. Then she whipped out her special coffee beans - special as in bargain bin cheap beans special. I can tell you that the machines will never live up to their potential until they rust away.",
    "sentiment": 0.9729,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "> Baratza Encore ESP isn’t even that great for drinks other than espresso\n\nFair enough. I don't think this isn't 100% true based on Hoffmans comparision in: https://youtu.be/G7xGhGtvYIs?si=mb6Mc6iRzGc40eYE. I have a kin grinder p1 currently, I will see if I can make good coffee with it and then go from there!\n\n\n> It’s shipped in by domestic retailers from some factory in China\n\n\nYes I am aware of this after posting it. However, I have a coffee company that ships it from where I live and they said they can repair stuff. However, as you said it's not tried and tested.",
    "sentiment": 0.8738,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Baratza Encore for both.  Baratza is widely known for its amazing aftermarket service; technical support, replacement parts, equipment modifications, everything.  The Baratza Encore ESP isn’t even that great for drinks other than espresso, but there’s a lot of stuff you can do to it to make it good for everything.  Baratza even sells a decent amount of that stuff themselves.\n\nOn the other hand, no one even knows who makes the DF54.  It’s shipped in by domestic retailers from some factory in China, and all aftermarket service goes through them.  A lot of stuff in it is non-standard, and there’s no OEM support for any of it.  It’s great value for the money, but you kind of just get what you get.",
    "sentiment": 0.9707,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Nah mate, it accentuates the flavours of espresso with crisp and tart lemony/plum notes. Plus it cuts through the grease and oil of the coffee beans :)",
    "sentiment": 0.1027,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Hey,\n\nI am planning to buy a grinder. I will brew pourovers, aeropress, and a french press. Maybe an espresso somewhere in the future. The choice is between D54 and Bartaza encore ESP. I think both are solid grinders. However,\n\n1. Which has better customer service? Like buying broken parts, repairs etc.\n\n2. Which us more moddable of the two? i.e replacing burrs etc.",
    "sentiment": 0.504,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "I *definitely* haven't acquired about $1800 worth of coffee/espresso equipment over the past 4 years, with about $750 of that in the past month. I totally have this under control! 🤣",
    "sentiment": 0.2942,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "This. About 2 years ago someone on here or /r/coffee convinced me to buy the mineral packets from Third Wave Water. I thought \"Sure, why not?\" and wasn't impressed when I used it with my AeroPress. I lived in Manhattan at the time and they have pretty great water. \n\nI live in South Florida now, and the water definitely has a different taste down here. I've always filtered my water with a Brita filter, which tastes better than the tap water. I bought a Gaggia Classic Pro Evo a few weeks ago (first actual espresso machine I've had, I don't count the 9Barista lol) and wasn't getting anything but sour/highly acidic shots. I found the packets about 2 days ago and bought a jug of distilled water. I made a shot with that water... Wow 😳 Even though it was their filtered coffee mixture, it was still better than *my* filtered tap water. I'm going to buy their espresso mixture now because I'm sold.",
    "sentiment": 0.9483,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Better beans make a better brew for sure, but some brew methods are more forgiving for lesser quality beans. I’ve used fancy competition grade coffee beans and cheap supermarket beans in my aeropress and can get a good tasting cup of coffee out of either. Espresso is probably not as forgiving.",
    "sentiment": 0.9515,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "When I make milk drinks with filter coffee instead of espresso, I use a 1:10 brewing ratio.  I don’t use a drip coffee maker, though.  It’s either a moka pot, an aeropress, or cold brew.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "If you're thinking of something like latte or cappuccino, they're made using espresso, basically highly concentrated coffee. If you do the same with regular filter coffee, like you said it will too watery/diluted. Only a few dashes of milk is enough with filter coffee to balance it out. If it's still too watery, you need to put more ground coffee.",
    "sentiment": 0.6124,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "You can take great beans and grind them with the worst grinder and dump\nthem into the portafilter of the best espresso machine and you’ll have badly flavored hot water.",
    "sentiment": -0.128,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "I just came across this. I absolutely loved my Verismo. I got it when they first came out. Their espresso taste identical to shots pulled at a Starbucks location. I used that thing consistently. For a while, only Starbucks without a drive-through had the pods. Even then, it was difficult to get them. With Starbucks closing their online store and Bed Bath and Beyond going out of business,  it was impossible to find the pods. I finally just gave up and purchased my first \"big boy\" (over $1000) espresso machine and fell down that learning rabbit hole. I just came across my machine in the attic, and it prompted me to see if pods were still available somewhere. A friend of mine owns a bar, and espresso martinis are wildly popular. She wanted to get away from low quality mixes and make them from scratch. I thought this thing would be perfect. Sadly,  I think she's going to have to learn to be a barista with a real espresso machine. Starbucks seemed to make it so difficult to get pods from day 1. It was like they regretted even offering the thing.",
    "sentiment": 0.7089,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "I thought the same for a while. You’d be surprised what’s possible at home with a $500 grinder and $500 manual lever espresso “machine”.",
    "sentiment": 0.2263,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Could not agree more.  \n\nA blade grinder makes everything taste terrible, and it does not matter how fresh the beans are or how good they are if the grinds are uneven and not small enough, because on those latter two issues you will always get under extracted espresso.",
    "sentiment": -0.5181,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "lol yeah, beans are basically 75% of the thing. With good beans you can get top-notch coffee with a quality hand grinder and a manual espresso machine, everything for less than 200$ combined.",
    "sentiment": 0.8779,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "And even then it’s unlikely you’ll pull a shot as good as a pro with top line equipment. I leave espresso to the pros.",
    "sentiment": 0.5423,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "True. Sadly it requires nice equipment to do good beans justice brewing espresso. I can do damage with great beans and an aeropress though lol",
    "sentiment": 0.9153,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "After a lot of comparison shopping, I have invested in the Breville BDC650BSS Grind Control Coffee Maker.  I am a “basic” coffee drinker in that I want to brew a pot in the morning and enjoy it for the morning.  No espresso, no fancy drinks just good tasting coffee (we do buy high quaiity beans),  Anyone have any sage advice about how best to take advantage of its strong points and how to avoid trouble spots?",
    "sentiment": 0.8225,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Some people obsess over brewing equipment when they should be obsessing over beans. \n\nI'd much rather have *good* beans with a $20 blade grinder and a $30 Mr. Coffee dripper than *mediocre* beans with a $2,000 burr grinder and a $5,000 espresso machine.",
    "sentiment": -0.5267,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "I admit it: for an espresso I prefer a decent Italian (dark, very dark for modern standards) coffee, from a mid level big brand, than the little producer of modern standards).\n\nVery different if we talk about pour overs tho.",
    "sentiment": 0.2023,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "I bought a Delonghi Rivelia. And Segafredo Beats Crema and Espresso.\n\nThe Crema for coffee, the espresso for latte machiato and cappuccino.\n\nIt is not bad, quite good actually, but not extremely good.\n\nWhich beans can I buy in Europe?",
    "sentiment": -0.514,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Yeah most supermarket espresso is very low quality beans to begin with, even before being roasted into ash, pre-ground, and then allowed to sit for months before being sold. Every single one of those factors will give you a garbage shot at the end. Espresso is by far the least forgiving method so you absolutely must start with quality to end up with quality.",
    "sentiment": -0.3816,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "How much caffeine is in Peets espresso pods? The box doesn't seem to have estimates based on individual type of pod.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "How do you clean your French press? I enjoy espresso, drip, and pourover, but by far the most common way I make coffee is with a French press. The only problem is... well, cleaning it is kinda awkward. I just fill it up with water, pour the grounds-filled water through a mesh sieve, and then rinse it out a couple times. It works well enough, but then I have to empty the sieve into the compost, and rinse THAT... it feels like there must be a better way, but when I've looked up ways to clean it, it's just been \"use soap and warm water with a soft sponge\" or whatever, not the kind of cleaning I mean",
    "sentiment": 0.933,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "I picked up a Turin H40 V2 a few months ago and I have been really impressed with the grind quality and construction. It's built like a tank, has grind setting adjustment on the outside vs underside, and has a blind shaker for the catch cup. Easily handles espresso to French press range. \n\nI'm really surprised I'm not seeing it mentioned and reviewed hardly anywhere. For $99 it competently has handled everything I've thrown at it. Especially the espresso.",
    "sentiment": 0.7774,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Exactly, that's $$$$ going down the drain along with the espresso.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "For convenience, Nespresso can't be beaten, but coffee will be expensive and not great. \n\nAlso convenient, and cheaper on the long run, is a superautomatic machine (aka bean to cup machine), but it's not made to alternate beans during the day. Some models can have 2 types of beans, but they're not common. \n\nBut if the Breville was almost what you wanted, just slow, the Miicoffee/Turin Apex V2 might solve your problems, without going down the Heat Exchanger / Dual Boiler super premium and expensive route. It has 2 boilers, that you can't use simultaneously, but don't have to wait till it heats up/cools down. You'll still need a grinder, DF-54 / Niche Zero come to mind.\n\nOr maybe something like the [Rok SmartShot](https://youtu.be/Q7N1jEon-LU?si=7dI8xfNXuj1qJx8r) might seem interesting to you, along with a Nespresso milk frother, or even better, [a Nanofoamer Pro](https://youtu.be/P_UI1vr3FyM?si=9tIsCpsQMqEfnx0z).",
    "sentiment": 0.9049,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "The coffee price drove up quite a lot recently here in Brazil, but I’m managing to buy a champion prized, dark roast coffee that makes a good match with my espresso machine and my grinder. I don’t know if it’s available outside but it’s called Orfeu and it’s really, really good. They won many prizes and I can get them pretty fresh from the supermarket shelf. \nI was signing a coffee subscription from Um Coffee (from Boram Um, barista world champion last year and his brother, Garam Um). Although they have excellent coffees, they weren’t a match with my grinder/machine. And it was pretty expensive.",
    "sentiment": 0.9949,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Yeah but not a lot, simply because the texture of the milk is flat which balances the bitterness from the ristretto. It is actually a very balanced drink, not too strong, not too light and you can experience the taste of the espresso which might not be very distinct say for example, in a cappuccino.",
    "sentiment": -0.7582,
    "title": "",
    "url": ""
  },
  {
    "keyword": "espresso",
    "text": "Flat whites are actually made using ristrettos, not espresso. Think of ristrettos as a stronger shot of espresso in half the fluid. Traditional espresso has a 1:2 ratio however ristrettos have a 1:1 ratio, making it super strong. Milk texture is a difference between the two drinks but the main difference would be the use of ristrettos.",
    "sentiment": 0.6597,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "You mean the Normcore dosing funnel? Depends on the distributor that you are using if it fits on top. I sometimes use it with the Normcore Needle Style Distributor and even with the Normcore WDT. But you cant use it with the chisel style and gravity distributor style tools as their goal is to flatten and even out the coffee bed",
    "sentiment": 0.1154,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "I have had zero problems getting a half decaf latte in the last 20 years in 2 different states. It can't be \\*that\\* uncommon. The only issue I ever have is one time when I asked for the smallest size which they couldn't do, and I understood the rationale behind that.",
    "sentiment": -0.4019,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "I have 6 years of barista experience and have competed and won latte art competitions in my time but i recently moved to a new cafe where i can't seem to make the right microfoam on my milk. the wand always gives me a super micro bubbly and uneven consistency for all types of drinks. We use whole milk and I've used the exact same brand of milk for the past three years at my other cafe i worked at and have never had a problem with it! Could it be a problem with the pressure? and how should i adjust it?",
    "sentiment": 0.9067,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "If you're thinking of something like latte or cappuccino, they're made using espresso, basically highly concentrated coffee. If you do the same with regular filter coffee, like you said it will too watery/diluted. Only a few dashes of milk is enough with filter coffee to balance it out. If it's still too watery, you need to put more ground coffee.",
    "sentiment": 0.6124,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "You don’t know what you never had. I was never aware of coffee quality. Hell, I didn’t know what the difference between an iced coffee vs an iced latte. I thought people used those terms interchangeably I grew up very, very, low income so an off brand of Folgers or dollar tree instant coffee was all I knew. \n\nIn college, being introduced to Starbucks and Dunkin being on campus and our dining dollars could be used to purchase these things, I thought I hit the jackpot in terms of discovering “better-ish” coffee than what I grew up drinking.\n\nIt wasn’t until I started making my own adult money to where I could travel and try different kinds of coffee from other actual cafes, places, and regions where I discovered that there’s way more than what I thought I knew.\n\nSo again, some people just simply aren’t aware or know any better. When you know better, you do better. And at the end of the day, it really is just coffee and I’m having fun with this while learning along the way. 🙂",
    "sentiment": 0.5759,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Could not agree more.  \n\nA blade grinder makes everything taste terrible, and it does not matter how fresh the beans are or how good they are if the grinds are uneven and not small enough, because on those latter two issues you will always get under extracted espresso.",
    "sentiment": -0.5181,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Drink all your misdialed shots. No need to waste any. Even the most poorly dialed shot can be made drinkable as a Latte or Americano. For each shot, just make notes on how it tasted, and which parameter you will change for your next shot.",
    "sentiment": -0.6124,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "I bought a Delonghi Rivelia. And Segafredo Beats Crema and Espresso.\n\nThe Crema for coffee, the espresso for latte machiato and cappuccino.\n\nIt is not bad, quite good actually, but not extremely good.\n\nWhich beans can I buy in Europe?",
    "sentiment": -0.514,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "I was at the grocery store and saw Stok is selling a ready-to-drink Decaffeinated Black Coffee. I don't understand why anyone would buy this. Why has no one released a ready-to-drink Decaffeinated latte/ cappuccino? I would buy so many and be drinking them at all hours of the day. Maybe my tastes are rare but surely it's not more unique than someone wanting to buy a ready-to-drink 100% black decaffeinated coffee???",
    "sentiment": 0.6381,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Cappuccinos and flat whites should both have roughly the same ratio of milk to espresso. Lattes, typically being a larger drink, will typically have more milk relative to the espresso. In the event where a smaller latte is made, just find the middle ground between a cappuccino and a flat white and there ya go.\n\nTraditionally, a cappuccino is almost equal parts steamed milk, milk foam and espresso where a flat white should have little to no foam and a larger proportion of steamed milk. In a roundabout way the names of the drink actually tells you exactly what it is: “flat” because there are very few bubbles, and “white” because it’s a milk drink. The names of cappuccino and caffè latte also technically tell you what they are, assuming you speak Italian and are familiar with cultural references from the 18th century, though.",
    "sentiment": -0.2315,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "I agree with all of that! I love my 1Zpresso grinder! I have a Kalita Wave (the little one… I always forget what the number is) and a v60 dripper, and an AeroPress. My personal preference (I have learned through brewing tons of coffee over many years) is for the Kalita Wave. I have recently done some reading about the different flavor profiles that can be achieved depending on whether you use a flat bottomed (Kalita) or conical(v60) pour-over and I found that the science matched my experience? The flat bottomed tends to give more body and the conical more acidity and floral… so, that might be a thing to consider?\n\nI have had various subscriptions through the years. To name a few: Verve (superb), Elm Roasters (delish!!), Loveless (dynamite), and most-recently SEY! These are all fairly high end roasters that are all around the same price point… the former two are on the west coast and the latter two are on the east coast… I like not having to stay on top of ordering and find a subscription handy in that it keeps me full of beans and caffeines! But, you can always just buy a bag of freshly roasted (two week after the roasting date is a real treat) coffee, chop it up and soak it in hot water (not too hot)! I feel like coffee and pizza are even good when they are bad 🤣",
    "sentiment": 0.8485,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Hello! Wanted to ask for some of yall opinions. \nI don't have a setup at home yet but am thinking about investing in one since I do drink a decent amount of coffee.\n\nIs the profitec go worth the 1k investment over the regular bambino? I know this topic is very subjective but hopefully get some feed back from people who have either machines or upgraded from one to the other.\n\nI have some prior experience as a barista and I mainly enjoy making milk drinks/pour overs (don't have a pour over setup as well xD)\n\nI like steaming milk and practicing latte art so that has some type of play as well.\n\nSo I guess it's either\n1) Bambino + Grinder + new accessories/bottomless filter etc\n\n2) Profitec + Grinder\n\nThank You!",
    "sentiment": 0.9778,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "What is the difference between a flat white, a cappuccino , and a latte, in terms of coffee flavor/strength.\nI know a latte is the milkiest of the three but am confused between a flat white and a cappuccino since it seems like each cafe has their own definition",
    "sentiment": 0.0772,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "No worries, I'm always open to curmudgeony feedback haha.  A lot of times that can be the most helpful.  I've gotten A LOT of it with our coffee mug so I'm pretty good at any criticial feedback/opinions at this point.  Google Momnt Mug if you're curious and look at some of the comments on some of the more popular videos on YT or IG.  They get pretty wild with both good and bad comments...crazy how polarizing something like a coffee mug has been, but I suppose that's just the internet to some extent.\n\nAnd yea, 3d printing is awesome!  I made dozens and dozens of prototypes like that to hone in our design for Momnt Mug and it really helped, so I'm trying to do something similar for a latte cup with a similar handle.",
    "sentiment": 0.9616,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "As others have said here , my bet is old beans (even if they have just been purchased in a supermarket /grocery store, they are already old ). \n\nHave you tried to find a local speciality roaster ? Go on google maps and search coffee roaster or coffee roastery (the latter being the more used wordage in the States) and you’ll be surprised to find how many there are around these days. \n\nAlso , your grinder may be and probably will be , affecting Crema. What is the model of your grinder ? If you are using pre-ground coffee that will affect Crema as will pre-ground in a single walled basket (using a double walled basket with pre-ground or grinds ground in a false burr grinder etc artificially creates a sort of Crema ) \n\nWe are all primed to help once you give us some more details !",
    "sentiment": 0.747,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "\"Are you happy with your Latte?\"\n\nLooks like a great Baymax from Big Hero 6.",
    "sentiment": 0.9313,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "https://preview.redd.it/14mk0rwxh1se1.jpeg?width=1170&format=pjpg&auto=webp&s=7435887651312d54fd0f012e4133a5723f049db3\n\nI am using Kruve Imagine 300ml. I have tried starting the latte art when it is 40% full up to 70% full but the result is always the same",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "\"OooooOo\" - Latte ghost.  Nice!",
    "sentiment": 0.2003,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Are you sure your not getting Breve Lattes because thats half and half. Otherwise it may be coming down to the sweetners you are using. Sometimes Cafes use real caramel sauce over syrups and makes the latte taste more silky",
    "sentiment": 0.3182,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "It's hard to show online, but it's pretty good.  We call it a counterbalance handle, and there are a few other mugs and cups out there with something similar (like Corelle, the popular ceramicst Old Forge Creations, and we made one called Momnt Mugs).  They basically give you a different way of holding a handle so it's more based on leverage instead of pinching a small handle, and it makes it easier to hold without it slipping.  One of our customers thought a similar approach with latte cups could help since they usually have really small handles that can be awkward, so here I am!\n\nThat being said, this latte cup is harder to design to be comfortable compared to the mug since it's shorter and uses fewer fingers.  But the lighter weight and volume help a lot (originally tried this latte cup with a larger size and it was NOT good).",
    "sentiment": 0.9844,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "It's actually pretty good when you actually feel it, but it's really hard to show online.  The bottom part of the handle is wider to spread out the weight, and it's curved in a way that better fits your grip.  Similar concept as our coffee mug (Momnt Mug).  Trying to see if something similar could work for a latte cup.",
    "sentiment": 0.706,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "That looks great! How do you make the eyes and mouth? I have 0 experience making latte art, so I think I'd try to use a chopstick, but I really have no idea",
    "sentiment": -0.2405,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Thanks! Yes to get to that sort of latte art was a challenge it’s a bit of a love hate relationship. I’d be lying if I said I could achieve that quality every time though. Around 1.5 years. I have to concentrate to get that and don’t always have the time to take that much care! It’s addictive",
    "sentiment": 0.7772,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "One of the best latte art i'v seen!",
    "sentiment": 0.6696,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "He said it was for a latte, not an espresso",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Love the design!  \n\nIf the fragility of the handle is a problem when full of liquid, you could widen it where the handle connects ([like this](https://cdn.myshoptet.com/usr/www.coffee-culture.cz/user/shop/big/297_resize-notneutral-latte-2-350x263170924.jpg?6555ec46)) or use a different handle material such as stainless steel ([like this](https://kitchenandcompany.com/cdn/shop/products/bormioli-rocco-bormioli-rocco-oslo-espresso-cups-set-of-4-011381020884-29627862024352_240x.jpg?v=1627895119) but upside down)",
    "sentiment": 0.3404,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Congrats nice latte art tho for a first timer",
    "sentiment": 0.7351,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "The 400 looks like a heat exchanger so I’d say yes. My brother got a Belleza heat exchanger a while back and it was the first time I had a great microfoamed oat latte. It put out great steam pressure like my 600.\n\nI suck at pouring latte art but when I make milk lattes it’s the closest I’ve gotten to decent. Not because of my ability but because the steamed milk was great",
    "sentiment": 0.9396,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Ah ok! Well it’s more a flat white than a cappuccino, cappuccino is more frothy. Less espresso does help as someone suggested 1:1 ratio but ultimately better steaming capabilities should give you smooth silky milk even with a 2:1 ratio of espresso so I’m confident it’s down to the machine (bambino) which is great for the price. I’m sure with a large latte it would be fine but I don’t like a lot of milk",
    "sentiment": 0.9794,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Yeah this is probably the answer. We upgraded to a Profitec Pro 600 after our Breville dual boiler died. I couldn’t steam oat milk to save my life on the Breville. The Profitec makes a great oat latte. Steam pressure is so much better with a better machine",
    "sentiment": 0.8766,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "This is exactly it.\n\nI just don't get how lattes and cappuccinos are the same drink in different cups these days.\n\nHere's the foam on a macciato i made\n\nhttps://preview.redd.it/tzl9adv7rzre1.png?width=1080&format=png&auto=webp&s=5e55e0f0a3acea25d9917819d916b67161e7b044",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "https://preview.redd.it/gxykmzcgfyre1.jpeg?width=3072&format=pjpg&auto=webp&s=94710eefb0bdeede69f5b900f2ae020e97585a10\n\nFoam, Italian full fat UHT (in Malta) with a Conti CC100 compact! Nothing special, just get more air than for latte milk. Cappuccino should not have latte art. I'm old school trained nearly 30 years ago & make more traditional style coffee.",
    "sentiment": -0.3716,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Looks a little small for a latte. More like a cortado cup. It'd have to be steel for that handle to work IMO.",
    "sentiment": 0.4201,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "OP - in case you haven't solved this yet, I was having the exact same issue (noise, OK with tank, no luck with plumbed water) and have been trying to troubleshoot the last few days.  I came across this thread on Home Barista that gives the solution.  \n\n[https://www.home-barista.com/repairs/if-your-profitec-pro-700-is-noisy-and-plumbed-in-t88098.html](https://www.home-barista.com/repairs/if-your-profitec-pro-700-is-noisy-and-plumbed-in-t88098.html)\n\nFor the life of me, I couldn't figure out where to locate the mesh filter it is talking about it.  After taking the machine half-way apart, I finally found it tonight.  It is Item (Pos.) # 45 on on page 4 of this diagram.\n\n[https://wiki.wholelattelove.com/images/9/9c/Pro\\_700\\_Parts\\_Diagram\\_8-26-19.pdf](https://wiki.wholelattelove.com/images/9/9c/Pro_700_Parts_Diagram_8-26-19.pdf)\n\nDisconnect the water line.  Use a #4 allen wrench to remove Item #44 (the elbow with connected nipple where the braided hose connects to underside of the machine).  Use a 14MM wrench to remove Item #42 nipple from Item #44 elbow.  You'll find the mesh filter between the parts.  I pulled it out, scrubbed it, let it soak in some Cafiza, scrubbed it again, put it back together, and the machine works now!",
    "sentiment": 0.7439,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "He's just a shy old doggo who loves to not cooperate with filming, haha\n\nIt's about 4.5\" diameter (outside rim).  Is that a good size?  I know next to nothing about lattes and designed it based on some others I'd seen.  Trying to learn more about it.\n\nThe handle gives you a really good grip with good leverage instead of relying on pinching a tiny handle like you have with a lot of latte cups.  It's similar to our coffee mug (Momnt Mugs), and we had a customer who thought this type of handle could make it a lot easier to hold latte cups too, so that's why I'm here!",
    "sentiment": 0.9583,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "The handle gives a really good grip, especially compared to a lot of latte cups with really small circular handles.  It's a similar handle concept as the one we did with our coffee mug (Momnt Mugs).  Had a customer suggest making a latte cup with a similar handle, so here I am try to learn about what people are looking for with latte cups!",
    "sentiment": 0.54,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Why do people obsess over matcha latte? Am I a hater for thinking they're nasty?",
    "sentiment": -0.8299,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "lol, that's an 8oz latte. If you're not allowed to argue with customers, just make them espresso with equal milk. The pricing thing isn't really in your control, an espresso is probably at least $2 so I have no idea where someone would be buying a cortado for less than that.",
    "sentiment": 0.3308,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Do people make matcha lattes with culinary grade matcha? I’ve never seen that but i would be super disappointed if my drink was muddy and brown. \n\nWhat i read about the ceremonial label is that it’s not regulated so while it’s intended to be a label of quality and for ceremonies manufacturers can choose to put the ceremonial label on it at their discretion and it’s not what they would use for a tea ceremony anyways",
    "sentiment": 0.296,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "I agree with your comments about management and have worked at cafes where it's possible to start closing down early like that, but it's not feasible or possible in some places. Every time I close down half the machine early I get an order for 2 quad shot lattes 5 min before close 😅 and aside from cleaning the steam wand, it doesn't actually save any time to shut down half the machine early. Even when I'm caught up on customer dishes at close we still have at least 30 min of dishes to do that we can't do before close. Or that the owners don't want us to pull early so we can't do them before close.",
    "sentiment": -0.3127,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "yeah it seems the ceremonial title really is up to the distributor to decide there isn’t any regulation to it. \n\nThank you! you’re right. People are just so unnecessarily rude sometimes, i had another lady yesterday upset with the way i rung up her dirty chai: chai latte, +add shot she was like what it should be two shots in that size i told her we pull doubles for every size and she didn’t respond and then intently watched as i made her drink i still don’t know what she was upset about..",
    "sentiment": -0.6673,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "a cortado is equal parts espresso and steamed milk, 8oz is just a latte",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "This is encouraging to hear! I guess what I mean by order is like the step by step instructions. The baristas around me tells me to follow the coffee guide whenever I am not sure what ingredient should I do and pour next. But the manual guide or step by step instructions for most drinks does not line up with what other baristas tells me to do and pour first. I'm catching up with the \"ice, espresso, shot\" pattern for most latte and cappuccino drinks, but I'm still learning how to do the ones that are hot and non-coffee : >",
    "sentiment": 0.4139,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "150ml cup, double espresso and ultra flat foam more than a latte",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "2oz espresso in an 8oz cup is a latte. Mayyybe a capp. But certainly not a cortado.\n\nCafes like this suck. The owners change recipes for standard drinks and then get upset when clients complain or don't come back.",
    "sentiment": -0.8952,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "I’m not totally sure what you mean by ‘in order’ but making drinks really is just practice and everyone ends up with their own system. It’s definitely overwhelming to start with but it is doable! I had barely any training when I started my first barista job (I had to google what a chai latte was made of lol) but I got the hang of it through practice",
    "sentiment": 0.5028,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "In Seattle you get it simplified ordering a double short latte ceramic cup. They will always use fine foam because that's been the standard for years and do a little bit of design on top.",
    "sentiment": 0.3818,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Ristretto shot, milk like a latte, 6-8oz (ours are 6oz ceramic, 8oz to-go)",
    "sentiment": 0.3612,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "So an 8oz latte",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "latte",
    "text": "Okay. I was intrigued because I’ve honestly never considered combining oysters and coffee. I’ve been vegetarian for a while so it’s been a long time since I’ve had any oysters, but I seem to recall they’re very salty. I’ve obviously had salted caramel & vanilla lattes, but in those the salt is a much smaller part of the profile. It’s definitely interesting to think about what a much saltier flavor would perform in a latte.\n\nI think the texture might be hard to get by.",
    "sentiment": 0.8381,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "I’ve never had the drink you’re talking about, but you will probably get better results if you make the cold brew yourself.  Buy some preground coffee, mix it with water in a large container, then put it in the refrigerator.  (Don’t get starbucks coffee grounds, they’re roasted very darkly and get bitter very quickly.  Get something with a medium roast level.)  You can still add cream and sugar afterwards, to taste.\n\nI wouldn’t get too hung up on chasing the exact same taste as the drink you had.  It’s a lot more practical to find something you like in general.",
    "sentiment": 0.5267,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "Coffee Noob: replicating Starbucks Canned Espresso Light.\n\nI'm 33 years old and somehow I've gotten through life so far without drinking coffee. Like the smell but was never big on the taste.\n\nI have night owl tendencies, so generally I don't feel productive at work until the PM hours. I thought I'd give coffee another try to help me wake up faster. I picked up some Starbucks canned espresso with light cream and actually enjoyed the taste. Hard to say if the caffeine had an effect. I don't think it helped me feel more awake, but I think it got rid of some of the morning grogginess.\n\nI could just keep buying these but I'd rather opt for a cheaper bulk option. I did some searching and came across 'cold brew'. Supposedly this method results in less acidity, less bitterness, and more caffeine. So I bought Starbucks cold brew concentrate. The instructions say mix 180mL with 180 mL water. I used 180 mL milk instead. It's not as good as the canned espresso. Aftertaste is still too bitter for my liking. Maybe I need to use whole milk instead of 1%? Then I added 5g of sugar, the same amount as in the espresso. Still didn't taste as good, which makes sense because the sugar is less diluted in the espresso.\n\nThen I looked into the brewing method for the espresso. Apparently it is brewed using the ristretto method. Maybe the better taste is because of this?\n\nAny suggestions on how to replicate this flavor at home? Or is there no other way than to add more sugar and cream? Do I need an espresso machine?",
    "sentiment": -0.3067,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "I would also suggest cold brew.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "What is your brew ratio/recipe for the cold brew (including grinding process and what beans)?\n\nWhat is the dispenser you're using?",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "I currently moved from the U.S. to the UK and cannot find a good nitro cold brew anywhere.\n\nThis has resulted in my wife and I trying to make our own. We have purchased the dispenser, as well as nitrogen cartridges.\n\nFor some reason, we cannot successfully create a good batch. I am not sure where the issue is, if it is our initial concentrate ratio, the nitrogen canisters, etc.\n\nThe nitro cold brew comes out tasting very weak, there is a decent foam and has the look of a cold brew, but nothing similar to what we get in the U.S.\n\nAny guidance or tips on this is appreciated.",
    "sentiment": -0.0527,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "Realizing this is an old post, but thank you for sharing. I just picked up a Yama Tower and will run my first batch of cold brew this weekend. I'll give your 15 setting a try on my Baratza for the maiden voyage.",
    "sentiment": 0.7876,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "Good morning I'm trying to set up a van to sell coffee around where I live. I produce natural coffee in the mountains of Costa Rica. Do you have a any reccomendations of what would be the best way to do that on the go? I will have cold brew, but for the hot coffee I'm wondering what's the best forward!\n\n  \nThanks!",
    "sentiment": 0.948,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "this isn't what you asked necessarily, but I found that an Aeropress makes coffee with all the qualities I like about french press coffee but without that texture I could never quite get over. I think you might like it. \n\nbut to answer your actual question: I use a Timemore C3 (for pourover and cold brew as well as Aeropress) and I really like it. it's also my first burr grinder as a step up from preground beans and it's exactly as much grinder as I need, lol. you could even pick up a C3 and an Aeropress for around $100 total ;)",
    "sentiment": 0.9549,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "When I make milk drinks with filter coffee instead of espresso, I use a 1:10 brewing ratio.  I don’t use a drip coffee maker, though.  It’s either a moka pot, an aeropress, or cold brew.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "Getting a good grinder is definitely the first thing to do to up your coffee game.  If you don’t mind hand grinding, the KinGrinder K6 can grind for anything (even espresso) and will leave you with plenty of room in your budget for other brewers.  1zpresso grinders are nicer than KinGrinders, for sure, but the improvement they offer to the coffee itself is actually fairly marginal.  Any hand grinder that can be considered a noticeable step up in coffee quality is going to be at least double the price.  (Comandante C40, OE Lido, etc.)  Timemore grinders are not bad as well, but I don’t know of any hand grinders from them that can grind for espresso.  I would recommend going straight for the KinGrinder, unless you know exactly what you’re going for with the other brewing methods and you’re absolutely sure you won’t want anything more.\n\nIf you want an electric grinder, I would recommend a DF54 or Baratza Encore.  The DF54 can grind for anything, but won’t leave you any more room in your budget.  The Baratza Encore is not great for espresso, but is good for everything else and will leave some room in your budget for a brewer or two.  (Baratza also makes an Encore ESP; I would not recommend this for you, as it is really only designed for espresso and will not leave any room in your budget for brewers.)\n\nOnce you get your grinder, here are my recommendations for brewers.  Mix and match any of these to your liking.  I love experimenting, so I use all of these pretty regularly.\n\nMoka Pot: ~$40, makes a hot coffee concentrate\n\nAeropress: ~$40, very versatile \n\nFrench Press: ~$30, makes immersion-brewed or cold brewed coffee.  Can also be used to foam milk.\n\nHario Switch: ~$40, makes pourover or immersion-brewed coffee.\n\nFlair Neo Flex: ~$100, makes espresso\n\nIf I could only get one, I would get the Aeropress.\n\nI’m unfortunately not much help on beans, as I kind of just brew whatever I can find.",
    "sentiment": 0.9926,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "small cubes are elite. best for bar flow too. try dropping 4 whiskey cubes into a cold brew and sticking a straw in. you want smaller cubes.",
    "sentiment": 0.6705,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "Love this pov \n\nMy friends are coming over tomorrow and I’m ready: \n\n- Cold brew in the fridge \n- filter beans ready \n- new espresso beans ready \n- extra milk in the fridge",
    "sentiment": 0.93,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "We have this grizzled mid-30s dude who comes in most days for a cold brew with cream, no matter the season. He is always super kind, and a fantastic chat. Really breaks up the monotony of customer interactions.",
    "sentiment": 0.8689,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "At my old shop, my favorite was an older yoga teacher who stopped in nearly every day for a medium cold brew. She was so wise and she'd often speak to me about life or the state of the world. In my last few days there before I moved away for college, and I told her I was nervous and just hoped it would go by quick and all she said was \"dear please don't wish your life away\". I think about her often, especially when school and work get tough",
    "sentiment": 0.8286,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "So my replacement grinder has roughly the same behavior, and I'm experiencing 8-9 as the ideal range.\n\nDecided to accept this behavior, as I ultimately don't make cold brew that often (my only reason to go past 11).",
    "sentiment": 0.7184,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "I used a aero press for a couple of years I would make it extra strong and then dilute in a pyrex measuring cup to get 2 mugs of coffee. My problem is that when I woke up groggy, sometimes the base would slip and would spill out and make the biggest sloppy mess of hot water  and grounds all over the counter and floor. I geeked out with a Melitta cone, Chemex various single automatic single serve machines, ninja, the scoop, etc but never got a good tasting cup and returned them to Amazon. \nNow I make cold brew in the Mason Jar/ Metal cone filter. I do it in my sink and then filter it in my Chemex. Takes maybe 20 min once a week. 20 setting on my Barritza Encore, medium roast commercial beans ( Dunkin, Costco Peru, Aldi Peru) do it for around 12 hours. There is a window of 1 hour from sour to bitter so I taste  it  every 30 minutes. That is my story and I am sticking to it.",
    "sentiment": -0.7104,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": ">Will I finally get that crisp, bright cold brew I see others raving about?\n\nFrom what I hear, the best route to a crisp and bright cold brew is the Kyoto cold drip style, but it requires a bit more attention. I saw timemore and mhw-3bomber have some little compact cold drip contraptions, I think one of them supposedly had some system that ensures a consistent drip rate, which could make things a little easier. I was tempted to give one a try, might be nice over summer. Apparently this style of brewing plays much better with lighter roasts compared to the usual immersion method.",
    "sentiment": 0.9572,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "I always double filter cold brew-first with an Aeropress and then through a V60 although I just make mine by putting coarse-ground coffee and water into the fridge overnight. The Aeropress is required for the first step-filtering the raw mixture through a V60 is too slow. Then the extra filtration of the V60 gives it a very clean taste",
    "sentiment": 0.4576,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "I haven't made cold brew in a while, but I've done this.  It results in a much cleaner, smoother brew without all the sediment. I think you'll enjoy it!",
    "sentiment": 0.7678,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "Encore is a great entry machine. And has a great range for going course with cold brew and almost fine enough for great espresso. You can’t go wrong with these options but like others have said, make sure you really plan to use it and enjoy the workflow before dropping $200. But if you’re committed to the game, welcome!",
    "sentiment": 0.9729,
    "title": "",
    "url": ""
  },
  {
    "keyword": "cold brew",
    "text": "I have a vague memory of a live stream from Café Disco (?).I think at the time of me watching it, it was an overview of a cold brew or ice brewing device.\n\nMaybe live steams could make a comeback?\nHaving interviews and reviews of people, devices and techniques?",
    "sentiment": -0.2359,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Are you sure they were referring to a coffee drink?  Because the[ Americano cocktail ](https://en.wikipedia.org/wiki/Americano_(cocktail))was invented in the late 1800s.   Usage of the term \"americano\" to describe a coffee drink was first printed in a Jamaican newspaper in the 1960s.",
    "sentiment": 0.3182,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "I've spent a fair amount of time researching this topic. The biggest issue is that if you batch brew something as dense as Cometeer coffee e.g. 15 grams of coffee in, 25 grams of brew out, you'll lose 20-25 grams of brew into the coffee grounds expanding (even after pressing them with something like Aeropress). I believe espresso loses less by keeping the grounds under pressure but it's not a batch brew. \n\nBased on their patent, Cometeer deal with this by using a centrifuge to extract all the brew from the grounds. I occasionally make espressos in a batch and freeze them in silicone containers in the freezer for an americano later, the results are tasty. But it takes too much time. I mainly keep buying Cometeer. It's expensive but well-deserved imo given how hard it is to replicate at home.",
    "sentiment": -0.25,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Drink all your misdialed shots. No need to waste any. Even the most poorly dialed shot can be made drinkable as a Latte or Americano. For each shot, just make notes on how it tasted, and which parameter you will change for your next shot.",
    "sentiment": -0.6124,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "The Vertuo is suitable if you want bigger cups or something that is good for two persons. The Original is best just for espresso, americanos, and milk drinks.\n\nIf you are planning to get the Drink Morning steamer, why dont you just get both the capsule machine from them too? At least you have their entire ecosystem. The machine has more variables for control too.",
    "sentiment": 0.8658,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "I personally tend to like to extract lighter roasts as a quick shot to bolster the acidity and fruitier notes but really just depends on preference. I drink a lot of these lighter roasts as americanos so i don't mind that the shot will run faster and be a bit more watery since it'll just be mixed with water anyways.",
    "sentiment": 0.1901,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "To make your Americano more American, you can also use hotdog water.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "It also takes my coffee shop 2 hours.  We close at 5 and we are pretty high traffic, we have steady business up until we lock the doors and actively shoo people away.  And my boss is very big on offering every bit of service until the doors close, so no dumping out the drip pots and switching to americanos, no switching to to-go cups only, no turning down food orders, no shutting down the bathrooms or closing part of the seating area.  So it’s very hard to get much pre-closing done.",
    "sentiment": -0.8591,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "I own a coffee shop in a small town and specialize in Espresso based drinks. We don’t brew any drip decaf coffee because we get asked for it very rarely. However when we do get asked we offer to make a pour over or an Americano for them. Most times people are fine with the Americano. That being said it does feel shady to not be forthcoming about what people are paying for…",
    "sentiment": 0.2023,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Dude must have been so I insufferable if no one has corrected him on what an americano Is to this day",
    "sentiment": -0.3535,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "At my shop I’d say “we don’t have decaf drip but we have decaf espresso, so I can make a decaf americano or a decaf latte” we also have non caffeinated teas we’d offer",
    "sentiment": 0.1154,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "We recently stopped selling decaf drip and switched to decaf Americanos. We still charge them as the drip coffee price, and we let people know that it’s a decaf americano instead of drip. No complaints on my shift and it saves me from dumping entire pots of decaf coffee",
    "sentiment": -0.7964,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "I'm a consumer of decaf and americanos and honestly I would prefer it as long as it's not served watered down. Some places put way too much water in the cup.",
    "sentiment": 0.4588,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "At our smaller location, we don’t brew decaf and explain we have decaf espresso and can make Americanos. This week I had a customer say, “I don’t know nothing about no espresso and water,” and then left 😂",
    "sentiment": 0.2235,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Yeah a lot of coffeeshops take the same approach: sell customers decaf Americano instead of decaf drip. But none of the shops I've worked in have lied about it. That's shady as hell on your boss's part.",
    "sentiment": -0.8807,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "If you’re a franchise, complain to corporate. Something like how every time you order a decaf drip, you see them make you a decaf americano. Add in that you’re being charged the price of a decaf americano and the store claims it’s because they’re being made to order but that can’t be true because drip coffee takes longer to make compared to how fast it’s coming out \n\nYour boss is an idiot. When you buy a franchise, you’re contractually obligated to run their menu. If corporate found out, the franchisee would quickly be put in their place!",
    "sentiment": -0.3489,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "What a pointlessly unnecessary lie. Just tell the customer that you have decaf espresso and can make a decaf Americano. Never once in my 8 years has a customer gotten upset at that and I’ve only worked in high volume cafes.",
    "sentiment": -0.3818,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Exactly. I don’t sell enough decaf to run drips of it, but I will do it as an Americano. Idk why they want you to lie about it though, and makes me wonder what else is being fudged if they’re so ready to lie about something both inconsequential and obvious.",
    "sentiment": 0.6384,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "This feels like it's been a more common thing lately. It's totally fine but would def let customers know \n\nIt absolutely tastes different and in my area an Americano is at least 30% more expensive than a drip coffee of the same size so it's nice to know why \n\nAlso I feel like you're going out of your way to accommodate me and am probably more likely to tip fwiw",
    "sentiment": 0.8646,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Every shop I’ve worked at has not had a decaf drip and do decaf americanos instead. We let the customers know and ask if that’s okay with them 9 times out of 10 they’re fine with it",
    "sentiment": 0.4019,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "I definitely don't load things up with cream or sugar. I prefer the taste of espresso over drip, and maybe if this shop has a distinct taste to its drip- but I've never had a customer say no to a decaf americano or say the taste was notably different",
    "sentiment": -0.2382,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Also, in most parts of the world, the espresso machine is the only mechanical brewer in the shop. Make them an Americano, but leave some room. If it’s too strong for them, add a slash of hot water.",
    "sentiment": 0.3612,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "I managed a chain cafe that didn't brew decaf in the afternoon, but we would offer the customer the option of an Americano or waiting on a new pot. I'd never lie to a customer about what they're getting. Even if we brewed a 96 oz airpot (we also had the option to brew a half one) we wouldn't be losing money on product cost if we sold one coffee out of the pot, just making less profit. It's worth that hit to have a happy customer that returns. A regular is worth a lot more than what you save by nickel-and-diming somebody. \n\nCharging the customer more because the shop is out of a reasonable thing for them to order is just tacky. I wouldn't ever go back. I might walk out without buying anything. I'd definitely walk out if they lied to me. \n\n   \nAn Americano absolutely tastes different than a drip coffee. The strength is similar, but the taste is different. I've taken one in the past when it was close to closing and a shop was out of drip/batch—not decaf, which isn't something I'd order—but I didn't walk out happy (not that I'd blame the barista for what's probably the boss's fault or take it out on them in any way).",
    "sentiment": 0.9729,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "We will brew decaf drip on-demand throughout the day and closer to closing time will only offer decaf americanos. In my experience most decaf customers are much more understanding than others so it's never been a major issue for us. As long as you are up front about it I don't think it will be a problem",
    "sentiment": -0.4019,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "It doesn't taste that different, as a lifetime coffee-drinker myself. And anyone who is used to decaf has probably had a decaf americano at a coffeeshop",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Nearly every coffeeshop I've worked at has offered decaf Americanos instead of brewing up pots of decaf drip",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Yeah I wouldn’t lie to customers; I’d just tell them we carry decaf espresso but not decaf drip coffee (this is what we do at my shop), and offer to make them an americano if they ask for decaf drip and tell them it’ll taste similar.",
    "sentiment": 0.1531,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "I know!! I asked if he wanted a batch brew or an americano and he just crossed his arms over his chest",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Or literally just order \"coffee\" if you're not actually sophisticated enough to know the difference. Any barista worth their salt will understand that means drip; if they don't serve drip, they'll serve Americano and no one will complain.",
    "sentiment": -0.6931,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "This is crazy to me. In Australia, you pay the same price for whatever size you choose. It doesn’t matter if it’s a flat white, americano, latte or cap",
    "sentiment": -0.4019,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "I usually like to tell people when they are wrong lol. Like sir an americano has water in it. You should have gotten a latte next time 🙄",
    "sentiment": 0.5719,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "‘How am I supposed to drink this?’ Omg! I would die inside. \n\nI have no idea why people can’t just admit they made a mistake in what they ordered. How hard is it to say ‘Pardon me but I thought the Americano came with steamed milk in it, could I get some? Oh it doesn’t? Well good to let me know so I can be better prepared next time. And order it so. And thanks for giving me some now.’\n\nI usually give stinky people like this a second chance in case they had a bad day. But if it occurs often, hate their ass. I will stand up a little bit especially about price but whatever gets the stinky customer out of there quicker so I can chat with and make drinks for my favorite regulars.",
    "sentiment": 0.6646,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "In my experience, people like this either DON\"T know the owner, or are an acquaintance of the owner, and the owner has a similar opinion of the dude. As the owner of a coffee shop, if this dillweed came up to me in the supermarket and complained, I'd say, an Americano doesn't have any steamed milk. If the barista gave you a cup of steamed milk for free, SCORE!- you came out ahead.\n\nAnd then I'd never think about it or him again.",
    "sentiment": 0.5255,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "An Americano is an espresso submerged in hot water! lol",
    "sentiment": 0.4753,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Yes. Especially one who tries to weasel a latte our of you for the price of an americano. I'm sure even the manager or owner wouldnt appreciate such a dishonest customer.",
    "sentiment": 0.6946,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "I never heard of milk in an Americano and he told asked me “how I’m i supposed to drink this” literally with your mouth",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Based on March sales- #1. Latte/ Capp/ chai latte 55%, #2. Coffee/Americano 35% #3. Cortado 9.6% and a few hot teas, cocoas, and steamers. I run a short traditional menu inside of a professional building (lawyers and bankers mainly) so most drinks are pretty much zero frills.",
    "sentiment": 0.5809,
    "title": "",
    "url": ""
  },
  {
    "keyword": "americano",
    "text": "Most common:\n\nFlat white\n\nCappuccino\n\nLong Black (Americano)\n\n  \nLeast common:\n\nMacchiato, though it's becoming more popular. About one in every three gets returned because the customer thought they were ordering something else, I think the Starbucks Macchiato is some big icey creamy sugary syrupy thing? That's what most of the rejects are after. I suspect half of the remaining two thirds are too polite, and I hope I have converted them to the raw power of basically straight espresso.\n\nAffogato, can count the orders on one hand even though our house ice cream slaps incredibly hard\n\nCubano is on our drinks menu and I think one or two people have ordered it in the years I've been there. People who order espressos will put entire sugars in their though so that sort of counts.",
    "sentiment": 0.577,
    "title": "",
    "url": ""
  }
]