[
  {
    "keyword": "french press",
    "text": "# Can I use supermarket ground coffee in a French press? \n\nI'll be traveling soon, and the hotel has an electric kettle and French press in the room for coffee. I have never used a French press before. I don't actually enjoy coffee but find it beneficial to drink, so I have a cup daily. I have very limited luggage space, so there is no way that I'll be packing a grinder. Can I just use \"normal\" ground coffee that you buy at an average super market? Do most supermarkets carry coffee that is more coarsely ground for a French press?",
    "sentiment": 0.6048,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "One more thing, if you are in T-1 or T-2 city you will mostly have Ascess to these things over Blinkit . You can get Blue Tokai one if that’s available and a French press",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Thanks for the suggestion, can you suggest some reasonable moka pots & french press and the beans if u use",
    "sentiment": 0.4404,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "**Thoughts and Experiences with the Ceado E6C Chameleon**\n\nHello together, \n\nToday I was at a local coffee machine reseller and my plan was to get some insights and recommendations for machines and grinders. At some point the guy of the shop pointed me to the Ceado E6C as a premium single dose grinder. Honestly I have never heard of them and was curious. He was offering me it for 850€ which seems to be indeed a fair deal. But so far I was not able to find good comparable shops which are selling this grinder in Germany.\n\nDoes anyone have experience or thoughts about this company and especially their single dose E6C Modell. I was not able to find much info about it.\n\nMy main usage should be actually French press, filter and portafilter.\n\nMy current main questions are:\n\n- Are their self made 64 flat burs any good and worth?\n- what about the retention?\n- how is the support and maintenance, as I was not seeing anyone selling it online either the grinder or accessories nor the burs\n- what should be a normal reasonable good price?\n\nAlso maybe some thoughts that it looks quite similar to the DF64 models is there any relation?\n\nThank you in advance!",
    "sentiment": 0.9782,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Have a look at coffee socks, they're cotton, so a reusable natural material, but they're a better filter than ceramic, steel or wood. All of these options are a pain to clean, cotton has the additional issue of being a pain to dry, to the point you may be better off chilling or freezing it than drying it between uses.\n\n\nWith the limitations you're sharing around size and material, you might be better off looking at a french press, very easy to get hold of one that's all glass/metal and bigger than 750ml.",
    "sentiment": 0.9363,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Don’t drink instant coffee CA sahab\nGet yourself a moka pot or French press and brew your own coffee. \nInstant coffee is shit. If you are looking for quick fix then buy drip bags instead.",
    "sentiment": -0.5574,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "I would start with a clean and descale of the MoccaMaster and a thorough cleaning of the burrs on the Ode 2.  There could be some rancid oils lingering somewhere.\n\nThe water temp check on the MM is a good idea.\n\nAfter that, I would brew some of the same beans with a different method (French Press, Aeropress, pour over) to see if it is something inherent in these beans.",
    "sentiment": 0.2732,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Hey everyone! I'm looking for a grinder dedicated to aeropress/french press/V60, on which changing the grind size is easy. I would like for it do be single dose too, since my girlfriend and I don't enjoy the same kind of beans.\n\nI already have an espresso grinder (Mignon Turbo) and a hand grinder (1Zpresso Q2), but I would love another electric grinder on which changing the grind size is easy, to accomodate for all brewing methods.\n\nPrice shouldnt be an issue, as long as it's not in the thousands. I also wouldn't mind a hand grinder if there is a way to easily change the grind size to some presets.\n\nThanks!",
    "sentiment": 0.9808,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "James Hoffman's method breaks up the crust after a couple minutes.   \nYou definitly dont want to stir it constantly as it can extract the outside of your grounds faster than the inside ( ie. uneven).\n\nFreshly and/or light roasted beans can release more gas than others when exposed to boiled water so they will always form a big crust with foam. Definitly would want to break those up over the steep-time.\n\nso, stir once. never remove.  \n  \nGently push down french press sieve before pouring.  \nI even pour my french press through a paper filter for (subjectively) better filtering.",
    "sentiment": -0.0834,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "French Press question. Am I not supposed to stir the coffee at all? Just break up and remove the \"crust\"?\nIs this the \"correct'\" procedure?\nPour in the ground beans.\nAdd the water (boiling).\nLet sit - no stirring.\nBreak up and remove crust. (If any.)\nLet sit more.\nPour with the filter just touching the top.",
    "sentiment": -0.2359,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Oh, there's no problem with those beans.  Some people will say that there's no difference between \"espresso blend\" or \"espresso roast\" and other styles of coffee beans.  But roasters do roast them differently (think of different ways to cook steak, like slow simmering versus searing) to make them a little easier to extract in the short time that it takes to make espresso.\n\nFor you, in a switch and french press?  Just treat them as normal. Maybe they're a bit darker than what you usually have (though I don't know what your usual beans are), so you can experiment with grind size and temperature if you'd like.",
    "sentiment": 0.8823,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "you're good, all coffee roasts can be brewed in a french press. play with steep time or grind size if it's not to your liking.\n\ndue to the intense brewing process of an actual espresso machine (couple seconds, high pressure), roasters sometimes do an adjusted blend of bean varieties or a specific roasting grade to work better on those\\*\n\n\\*according to their taste.  \n  \n (mokkapot does brew strong coffee, though not what would qualify as espresso)",
    "sentiment": 0.8605,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "His method is pretty much cupping, but in a french press, so you probably could get away without using one.",
    "sentiment": 0.2732,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "If I’m following the Hoffman method for French press coffee, do I really need a French press? Couldn’t I do the same thing in a pot and just stain the brew into a cup?",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "I usually brew two different pots of coffee, the first is a community pot for my roommate, I can't give exact details, but it's a large automatic drip machine with a insulated pot. If I were to guess it's about 32 oz \nThe second is a French press that holds about 16 oz. It's intended for camping but I got it because my old one was glass and broke in my last move. My roommate has asked me a few times why I don't just use the big automatic machine.\nMaybe I'm just complaining. I just like French press. I like that I can take the pot to my room and I like the way the flavor comes out in French presses.",
    "sentiment": 0.5927,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Hey,\n\nI am planning to buy a grinder. I will brew pourovers, aeropress, and a french press. Maybe an espresso somewhere in the future. The choice is between D54 and Bartaza encore ESP. I think both are solid grinders. However,\n\n1. Which has better customer service? Like buying broken parts, repairs etc.\n\n2. Which us more moddable of the two? i.e replacing burrs etc.",
    "sentiment": 0.504,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "I'm just starting out on the better coffee path. I've done some research. I need a burr bean grinder, a weight scale, and a French press. My question is... based on the Hoffman method, do I really need a French press? Can't I just follow the same process with a standard steel pot and then strain the coffee into a cup?",
    "sentiment": 0.4696,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "this isn't what you asked necessarily, but I found that an Aeropress makes coffee with all the qualities I like about french press coffee but without that texture I could never quite get over. I think you might like it. \n\nbut to answer your actual question: I use a Timemore C3 (for pourover and cold brew as well as Aeropress) and I really like it. it's also my first burr grinder as a step up from preground beans and it's exactly as much grinder as I need, lol. you could even pick up a C3 and an Aeropress for around $100 total ;)",
    "sentiment": 0.9549,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "If I was to make cold coffee with my Clever dripper like people do with the French Press, what would be the method?",
    "sentiment": 0.6705,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "**Disclaimer: no health advice, ONLY bloodwork done by a professional can really assess your health.**\n\nWouldn't fuzz to much about it, coffee has been consumed in boiled form way before paperfilters were a thing.  \nif you feel fine you probably are.\n\nThat said, the suspected increase from thouroughly steeped coffee (crazy amount of variables here) in LDL cholesterol **does** look clinically relevant, yet **does not** single-handedly set you up for a stroke.\n\nif you consume it daily and plan on continuing, a paperfilter can be a good thing. It doesnt just filter out some of these compounds (Cafestol & Kahweol iirc) but also practically all sludge/fibre, while leaving the flavour intact and \\*subjectively\\* improving the texture.\n\npersonally i do immersion brew similar to french press and then pour through a fine mesh metal strainer with 2 paperfilters inside.",
    "sentiment": 0.7814,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "How do you clean your French press? I enjoy espresso, drip, and pourover, but by far the most common way I make coffee is with a French press. The only problem is... well, cleaning it is kinda awkward. I just fill it up with water, pour the grounds-filled water through a mesh sieve, and then rinse it out a couple times. It works well enough, but then I have to empty the sieve into the compost, and rinse THAT... it feels like there must be a better way, but when I've looked up ways to clean it, it's just been \"use soap and warm water with a soft sponge\" or whatever, not the kind of cleaning I mean",
    "sentiment": 0.933,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "I picked up a Turin H40 V2 a few months ago and I have been really impressed with the grind quality and construction. It's built like a tank, has grind setting adjustment on the outside vs underside, and has a blind shaker for the catch cup. Easily handles espresso to French press range. \n\nI'm really surprised I'm not seeing it mentioned and reviewed hardly anywhere. For $99 it competently has handled everything I've thrown at it. Especially the espresso.",
    "sentiment": 0.7774,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "i do immersion brew similar to french press on a daily, acidity yet light body is usually a sign of underextraction.\n\nwith dense, high-altitude, light-roast specialty coffee i grind a tiny bit finer than medium coarse and leave them in from 10 to 15 minutes. (i like using a paperfilter after that) try increasing steeptime if you havent already.",
    "sentiment": 0.3182,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "I am new to French press and trying to figure it out. I made coffee this morning using a 1:15 ratio. 40 grams of coffee and 600 ml of water. I used 200 degree water and after I poured the water I gave it a little stir. I let it sit for about 5 minutes and then plunged it. It tasted a little watery and not such a full bodied flavor. What am I doing wrong",
    "sentiment": -0.4767,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "I was using a Jura all in one machine too long. I switched to a stainless steel moka pot since it reminded me of my roots (2nd generation Italian). I purchased a FellowOpus Conical Burr Coffee Grinder and it was ok but HATED all the plastic. I looked and looked for something with less plastic but most of the alternatives were aluminum, which I'm not a fan of either. I tried about 4-5 in the $250 range and settled on this Chinese (as most of them are) made small footprint grinder. The \"STARSEEKER E55 Plasma Electric Coffee Grinder - Single Dose, 55mm Cone Burr, 60 Settings.\" I read good things. It's nice and my wife and I either use a moka, pour over or French press. WHAT'S your experience with this grinder? https://imgur.com/gallery/DQewRMv",
    "sentiment": -0.2943,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "(TL;DR: recs for first manual hand grinder)\n\nHi! I’m starting to develop interest in brewing specialty coffee at home, & want to start to investing in equipment as well! \n\nUntil now, I’ve been using a French press at home with preground beans. I don’t particularly enjoy the muddiness I get from the end of a French press brew however, so I’m considering switching to a mocha pot (recs on reducing this would also be amazing haha) - so my coffee grinder would be for either of those modalities.\n\nThings that are important for me in a grinder are cost ($50-$100), portability (nothing that takes up space on the counter) & ease of cleaning. \n\nNice to have but not absolute musts: if it’s repairable, and no plastic/ceramic builds. \n\nBecause of these requirements, I’ve been looking mainly into hand grinders (I usually will be making only 1 cup at a time anyway).\n\nI’ve been looking into the Timemore Chestnut C2 & the Kingrinder P2 (the K6 looks great but is a little out of my budget…) \n\nAny other recommendations would be greatly appreciated!",
    "sentiment": 0.9786,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Getting a good grinder is definitely the first thing to do to up your coffee game.  If you don’t mind hand grinding, the KinGrinder K6 can grind for anything (even espresso) and will leave you with plenty of room in your budget for other brewers.  1zpresso grinders are nicer than KinGrinders, for sure, but the improvement they offer to the coffee itself is actually fairly marginal.  Any hand grinder that can be considered a noticeable step up in coffee quality is going to be at least double the price.  (Comandante C40, OE Lido, etc.)  Timemore grinders are not bad as well, but I don’t know of any hand grinders from them that can grind for espresso.  I would recommend going straight for the KinGrinder, unless you know exactly what you’re going for with the other brewing methods and you’re absolutely sure you won’t want anything more.\n\nIf you want an electric grinder, I would recommend a DF54 or Baratza Encore.  The DF54 can grind for anything, but won’t leave you any more room in your budget.  The Baratza Encore is not great for espresso, but is good for everything else and will leave some room in your budget for a brewer or two.  (Baratza also makes an Encore ESP; I would not recommend this for you, as it is really only designed for espresso and will not leave any room in your budget for brewers.)\n\nOnce you get your grinder, here are my recommendations for brewers.  Mix and match any of these to your liking.  I love experimenting, so I use all of these pretty regularly.\n\nMoka Pot: ~$40, makes a hot coffee concentrate\n\nAeropress: ~$40, very versatile \n\nFrench Press: ~$30, makes immersion-brewed or cold brewed coffee.  Can also be used to foam milk.\n\nHario Switch: ~$40, makes pourover or immersion-brewed coffee.\n\nFlair Neo Flex: ~$100, makes espresso\n\nIf I could only get one, I would get the Aeropress.\n\nI’m unfortunately not much help on beans, as I kind of just brew whatever I can find.",
    "sentiment": 0.9926,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Hello everyone!\n\nI've discovered the joy of making coffee with a cheap kettle, and a bodum French press.\n\nMy life has changed since I've started buying Jimmy organic coffee that I grind at the store, but I feel like I need to upgrade my cheap \"setup\" if that even qualifies as one, to take this a step further and brew better cups of coffee. \n\nIt's been a bit hard to decide which equipment to get since there's so much choice out there.\n\nI've got a budget of about $250 (USD) to start.\nI was thinking I'd need a grinder, and and airtight container to store beans (I'm using a mason jar right now)  then idk if I'd need a gooseneck kettle, maybe a pour over, or just an aeropress? \n\nI've heard a lot about hand grinders like the kingrinder k6, the timemore and 1zpresso brands but I need help because I keep second guessing myself on what to buy lol\n\nI was wondering about getting better coffee beans. What would you recommend? (id probably stick with light! medium roasts. \n\nWhat do you think of Jimmy organic? I've also heard of Verve, La cabra but I have no idea if they're any good.\n\nAnyways any help is appreciated as I'm a newbie!!!  Thanks!",
    "sentiment": 0.9931,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Metro Detroit is full of - at least - Yemeni coffee houses. I've tried a few, but imo the ones around here go overboard. So they brew you coffee in an ibriq, but the drink is massive. You get like 8oz - served starbucks style. Coming from eastern europe, and being used to Turkish style coffee, which is very similar, you should get at most 4oz. That stuff is potent, not just caffeine-wise, but as far as cardamom, and in some cases sage. 8oz of that is...just too much.\n\nI'm personally not a fan of how the local Yemeni coffee houses brew. I make cardamom coffee at home sometimes, other times just plain black turkish - or sometimes with a little sugar, but this isn't like french press or pour-over. It's just too intense if you sip it like pourover.",
    "sentiment": 0.8297,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Believe me, I'm trying desperately to find a justification for this grinder's existence haha. It doesn't seem ideal for café service in many ways, the only thing I can come up with is it might be useful for roasteries selling pre ground bags. 1. They likely won't be grinding finer that moka size very often, reducing the retention issue. 2. Retention and exchange is arguably less of an issue if you're talking about grinding a 500g bag vs a single dose. And 3. You can store presets for your moka, V60, French press etc grinds.\n\nIs this vital? Is it really that much of a workflow improvement over an EK43 with markers on the grind range? Probably not. Like I said, I'm really stretching here.",
    "sentiment": 0.5063,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Invest in a burr grinder that can do espresso, like the df54 and a French press, aeropress, or moka pot. Then, when you have more budget, get an espresso machine knowing that you have the grinder taken care of.",
    "sentiment": 0.6908,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "If they say they can make anything but a super globby heart with a French press, they're lying to you and more likely than not trying to sell you something.",
    "sentiment": 0.1901,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "I have made French press blends previously, however this switch method I got the idea for recently. \n\nIn the case of lighter teas (green, white, yellow, roobios) for sure, however oolongs and black teas, along with herbals, steep at similar temps.",
    "sentiment": 0.4404,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "I'm not sure how quick it grinds-I don't own one personally (I would imagine a bit less than a minute for 20g at French Press setting) but the capacity might be an issue for you. 20 grams maximum so you'd have to do three to four sets of grinding.",
    "sentiment": -0.1232,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Appreciate the review! Was just looking at them today... Im obsessed with french press but wanted to step up my coffee game. Thought it would pair nicely with my yeti mug but will now check into the Mugen 👀",
    "sentiment": 0.685,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "Do you think we could try to do some French press with it? Maybe at a setting of 10 😀😂",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "french press",
    "text": "This is interesting. As someone who has a manual espresso maker, I could see myself getting into this. I’ve tried the little spinning wands, the French press technique, blenders. They all make huge amounts of foam. But that’s not really enjoyable.",
    "sentiment": -0.2345,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "Picked up some Tribo single cup pour-overs in Guatemalan Antigua.  They're tasty but it's definitely an 8oz cup per package.  12oz was starting to be weak.  Little over $2 a cup, going into my camping coffee for this summer as was the original plan.\n\nDebating if I want to try making Turkish coffee this year, have to look into making it with my camp stove.",
    "sentiment": 0.4767,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "## Amazon Price History:\n\n**MHW-3BOMBER Gooseneck Electric Kettle, ±1℉ Temperature Control Kettle with LED Display and 90°Vertical Flow, BPA-Free Pour Over Kettle, Pour-Over Coffe&Tea Gooseneck Kettle, Black BK6058B-OS**\n* Rating: ★★★★☆ 4.7 (29 ratings)\n\n* Current price: **$109.99** 👎\n* Lowest price: $87.99\n* Highest price: $129.90\n* Average price: $108.63\n\n| Month  | Low  | High | Chart             |\n|--------|------------|------------|------------------|\n| 03-2025 | $87.99      | $109.99     | ██████████▒▒    |\n| 01-2025 | $109.99     | $129.90     | ████████████▒▒▒ |\n| 09-2024 | $109.99     | $109.99     | ████████████    |\n| 10-2023 | $129.90     | $129.90     | ███████████████ |\n| 09-2023 | $99.90      | $99.90      | ███████████     |\n| 08-2023 | $129.90     | $129.90     | ███████████████ |\n\nSource: [GOSH Price Tracker](https://gosh.app/?utm_source=redditbot&utm_medium=Coffee&utm_campaign=2025-03-28)\n\n\n^(Bleep bleep boop. I am a bot here to serve by providing helpful price history data on products. I am not affiliated with Amazon. Upvote if this was helpful. PM to report issues or to opt-out.)",
    "sentiment": 0.5106,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "Is pour-over coffee worth the hype? I'm a bit of a coffee addict and don't want to give it up. One of my friends suggested switching my drip coffeemaker to a pour over coffee maker because 1. the coffee is supposed to be delicious 2. The mindful preparation method and wait might make be less likely to brew as much coffee because I'll have to boil the water first.  (I don't believe this will work lol). \n\nBefore I make the switch I was wondering how anyone finds the flavor of a pour over coffeemaker vs. other methods. thanks!",
    "sentiment": 0.8927,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "I agree with all of that! I love my 1Zpresso grinder! I have a Kalita Wave (the little one… I always forget what the number is) and a v60 dripper, and an AeroPress. My personal preference (I have learned through brewing tons of coffee over many years) is for the Kalita Wave. I have recently done some reading about the different flavor profiles that can be achieved depending on whether you use a flat bottomed (Kalita) or conical(v60) pour-over and I found that the science matched my experience? The flat bottomed tends to give more body and the conical more acidity and floral… so, that might be a thing to consider?\n\nI have had various subscriptions through the years. To name a few: Verve (superb), Elm Roasters (delish!!), Loveless (dynamite), and most-recently SEY! These are all fairly high end roasters that are all around the same price point… the former two are on the west coast and the latter two are on the east coast… I like not having to stay on top of ordering and find a subscription handy in that it keeps me full of beans and caffeines! But, you can always just buy a bag of freshly roasted (two week after the roasting date is a real treat) coffee, chop it up and soak it in hot water (not too hot)! I feel like coffee and pizza are even good when they are bad 🤣",
    "sentiment": 0.8485,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "Metro Detroit is full of - at least - Yemeni coffee houses. I've tried a few, but imo the ones around here go overboard. So they brew you coffee in an ibriq, but the drink is massive. You get like 8oz - served starbucks style. Coming from eastern europe, and being used to Turkish style coffee, which is very similar, you should get at most 4oz. That stuff is potent, not just caffeine-wise, but as far as cardamom, and in some cases sage. 8oz of that is...just too much.\n\nI'm personally not a fan of how the local Yemeni coffee houses brew. I make cardamom coffee at home sometimes, other times just plain black turkish - or sometimes with a little sugar, but this isn't like french press or pour-over. It's just too intense if you sip it like pourover.",
    "sentiment": 0.8297,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "Given that I was coming over from espresso, I still use my 1zPresso J-Max for Pour-over as well (I basically only do light to medium-light roasts). Will adding a K6, make a big difference in my overall taste profile?\n\nThe J-max being espresso focused produces a lot of fines creating pour-over cups that are more muddied in flavour. I can get more acidity and brightness when I use some of Lance’s techniques of tilting the grinder at an angle when in use but that’s about as much as I can get out of it.\n\nI’ve heard the K6 produces more fines as well compared to higher cost filter grinders so I was just wondering if springing for the K6 would be a considerable net benefit for me.",
    "sentiment": 0.8893,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "Anything’s a pour-over if you’re brave enough…",
    "sentiment": 0.5267,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "99% of what even top tier roasters sell is sweet milk drinks. A pour-over takes far more skill, basically completely takes away a barista from the espresso station, and still has the potential to be bad/midsdialed no matter how careful you are.\n\nImagine if you went to a michelin star restaurants and there's like a 25% chance the steak is overcooked",
    "sentiment": 0.7783,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "Haha I've heard that happens to everyone who goes there. Yes, would very much welcome an update!\n\nI've been into pour-over for years now but only this year started really recording details about my brews, and it's been very instructive (along with external research of course).\n\nVarying one detail at a time and seeing what results is a fun part of the hobby, especially when you finally get the cup you're chasing (before the beans run out).",
    "sentiment": 0.8668,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "It takes at least around 4 minutes of focus for them to do a pour over properly. If there were more demand, they would be able to staff for it. \n\nI explore all the local beans doing my own pours at home, and save the espresso for when I'm out.\n\nWhen traveling, I always try to pick up some new beans to try, and usually you can also order them there in the shop or online and shipped to home.\n\nI thought it would be fun to do a pour-over only shop, where you could serve a wide assortment, and make it a social thing. Like hang with me here for 5 minutes while I make you coffee. Got a request, I will get your bean.",
    "sentiment": 0.8024,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "Source: work in a coffee shop.\n\nWe get a delivery of coffee every week. When the new beans come in, we take the ones on the shelf to the back and put the new ones out. The ones we didn’t sell then become the beans we brew in house.\n\nThe reasons our pour-over selection doesn’t match the retail selection is because:\n\n1. A coffee went out of season so we have it for brewing, but a new one batch didn’t come in for retail.\n\n2. We haven’t had time/desire to dial in that coffee for pour over yet.\n\n3. We already have 3 coffees dialed in for pour over.\n\n4. We are saving it for batch brew.\n\n5. (Rare) we tried it last season and didn’t like it.",
    "sentiment": 0.5023,
    "title": "",
    "url": ""
  },
  {
    "keyword": "pour-over",
    "text": "In my country (Austria 🇦🇹) pretty much every specialty coffee shop will have a selection of coffees they sell in retail bags on offer for pour-over as well. Typically up to 3 different coffees you can choose from (at least in the coffee shops I've been to across the country).",
    "sentiment": 0.6486,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "Thanks for the suggestion, can you suggest some reasonable moka pots & french press and the beans if u use",
    "sentiment": 0.4404,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "Intelligentsia Black Cat Sapsucker, in Moka pot. Smooth and delicious with oat milk and a little sugar. Also, add a tablespoon of Trader Joes cacao powder for a tasty mocha!",
    "sentiment": 0.7574,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "**How many ml of coffee can a 9 cup Bialetti moka pot make? I need a precise answer, I looked everywhere on the internet and couldn't find it.**\n\nI'm talking about the amount of coffee extracted, not the amount of water that goes into the bottom pot (420ml). I want a coffee maker that could make two medium cups of coffee, one for me and one for a guest. Of course, I won't always have guests here, but I can make the coffee, drink my cup, and store the rest in a thermos. I usually drink two medium-sized cups a day, one in the morning and one in the afternoon.",
    "sentiment": 0.0387,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "I **just stated** my **journey** of brewing my own coffee, currently started with using a **Moka pot**(got this as a **gift**) and a **Hario Switch**(this I **bought**).\n\nI'm looking for manual grinders and on a **budget below $60**.\n\nHave gone through many post and reviews but most of them are years old and seeing how the pricing has increased  over the years. And they were a lot confusing.  \nWant to have some fresh recommendation.\n\nI was looking for the **KINGrinder P1** but it has been out of stock for a while. This fits so well within the budget. Does anyone know if or when it will be back in stock?\n\nother grinders that I found out but have to go over the budget are [TIMEMORE Chestnut C2S](https://www.amazon.com/dp/B0CGTYT12R) and [KINGrinder K1](https://www.amazon.com/dp/B0CY1ZFXSS) after some discounts they are at the similar price(difference of less then $4).\n\nhow should I tread forward?",
    "sentiment": 0.8258,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "Don’t drink instant coffee CA sahab\nGet yourself a moka pot or French press and brew your own coffee. \nInstant coffee is shit. If you are looking for quick fix then buy drip bags instead.",
    "sentiment": -0.5574,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "Bialetti are the quintessential moka pot, I wouldn't chose anything else. Plus, they're very good for supplying replacement parts.\n\n\nIf you're getting a coloured one just do your best to clean them quickly after use, the brown coffee can stain them in a way that doesn't matter with the metal finishes. I used to run mine under the cold tap after use so I didn't have to wait for it to cool.\n\n\nOn the off chance you have cash to burn and can spend 4 times more money on the same thing, but designer, here's a Dolce and Gabbana Bialetti in [blue](https://www.brownthomas.com/home/drinkware/tea-coffee-accessories/bialetti-x-dolce-gabbana-moka-express-6-cup-mediterranean-blue/178475329.html) I was looking for an excuse to show someone.",
    "sentiment": 0.7969,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "I’m new to moka pots and tbh the traditional silver colour gives me anxiety. Idk why, that’s a question for my therapist. I’m looking to purchase a blue one from Amazon and my options are Bialetti, Primula or Grosche. Any recommendations? Would the coloured pots get discoloured over time from my electric stove?",
    "sentiment": -0.1926,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "When we bought a new grinder for my sister for Christmas, I also sent her a sampler pack from a well-known speciality coffee roaster.  She opened the packaging and was wowed by the flavor descriptors -- \"oooh, blueberry in this one... and this other one says jasmine...\"\n\nI asked her a few weeks later what she thought, and she said it was all kinda meh.  She didn't notice much difference between them.\n\nThe new grinder, while a significant step up from the Cuisinart that she had, was an Oxo (the sub-$100 one), which is still entry-level in the grinder world.  Her brew methods were a drip machine (with which she told me later that she brews with a 1:25 ratio..!) and maybe her moka pot.\n\nSo in her case, it was a combination of high expectations, low amount of comparative tasting practice, wildly different recipe, and inferior equipment that caused her disappointment.",
    "sentiment": -0.4587,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "I desperately want help on this. Anyone have ideas? Right now I’m using a primula but clearly everyone here has said different brands and how they don’t work/do work for them.  \n\nI just now came to this sub, poured my coffee back in, and tried again. It didn’t spill. But…….. why does it spill with hot coffee? I’m going to make another batch. \n\nGosh. It kills me. \n\nDo I really have to be a chemist working in a lab with dangerous compounds to be good at pouring with my beloved Moka pot?!?!\n\nPS: it didn’t spill the second time. 🤔🤦‍♀️🤷‍♀️",
    "sentiment": 0.6902,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "When I make milk drinks with filter coffee instead of espresso, I use a 1:10 brewing ratio.  I don’t use a drip coffee maker, though.  It’s either a moka pot, an aeropress, or cold brew.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "Hey! If you're torn between the Timemore C2 and Kingrinder P2, I'd *lightly* nudge you toward the K6 if you can stretch your budget. I’ve been using mine for a year with a moka pot, and the grind consistency is shockingly good for the price—way less muddy than pre-ground. Pro-tip: toss an Aeropress filter under the grounds basket (thanks, Hoffmann fans!) for cleaner cups. The K6’s steel burrs feel sturdier than the C2’s, and it’s easier to dial in for future brew methods if you branch out. Only gripe? The handle’s a smidge slippery, but a rubber band fixes that.",
    "sentiment": 0.4468,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "I also started with a moka pot and a timemore chestnut grinder, it works great! I think the swap from pre-ground to fresh ground beans will make the most notable difference in your coffee.\n\nTo reduce the muddiness in my moka pot coffee, I added an aeropress filter in the bottom. James Hoffmann has some great videos on the moka pot. I'd recommend giving them a watch!",
    "sentiment": 0.9431,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "I was using a Jura all in one machine too long. I switched to a stainless steel moka pot since it reminded me of my roots (2nd generation Italian). I purchased a FellowOpus Conical Burr Coffee Grinder and it was ok but HATED all the plastic. I looked and looked for something with less plastic but most of the alternatives were aluminum, which I'm not a fan of either. I tried about 4-5 in the $250 range and settled on this Chinese (as most of them are) made small footprint grinder. The \"STARSEEKER E55 Plasma Electric Coffee Grinder - Single Dose, 55mm Cone Burr, 60 Settings.\" I read good things. It's nice and my wife and I either use a moka, pour over or French press. WHAT'S your experience with this grinder? https://imgur.com/gallery/DQewRMv",
    "sentiment": -0.2943,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "Getting a good grinder is definitely the first thing to do to up your coffee game.  If you don’t mind hand grinding, the KinGrinder K6 can grind for anything (even espresso) and will leave you with plenty of room in your budget for other brewers.  1zpresso grinders are nicer than KinGrinders, for sure, but the improvement they offer to the coffee itself is actually fairly marginal.  Any hand grinder that can be considered a noticeable step up in coffee quality is going to be at least double the price.  (Comandante C40, OE Lido, etc.)  Timemore grinders are not bad as well, but I don’t know of any hand grinders from them that can grind for espresso.  I would recommend going straight for the KinGrinder, unless you know exactly what you’re going for with the other brewing methods and you’re absolutely sure you won’t want anything more.\n\nIf you want an electric grinder, I would recommend a DF54 or Baratza Encore.  The DF54 can grind for anything, but won’t leave you any more room in your budget.  The Baratza Encore is not great for espresso, but is good for everything else and will leave some room in your budget for a brewer or two.  (Baratza also makes an Encore ESP; I would not recommend this for you, as it is really only designed for espresso and will not leave any room in your budget for brewers.)\n\nOnce you get your grinder, here are my recommendations for brewers.  Mix and match any of these to your liking.  I love experimenting, so I use all of these pretty regularly.\n\nMoka Pot: ~$40, makes a hot coffee concentrate\n\nAeropress: ~$40, very versatile \n\nFrench Press: ~$30, makes immersion-brewed or cold brewed coffee.  Can also be used to foam milk.\n\nHario Switch: ~$40, makes pourover or immersion-brewed coffee.\n\nFlair Neo Flex: ~$100, makes espresso\n\nIf I could only get one, I would get the Aeropress.\n\nI’m unfortunately not much help on beans, as I kind of just brew whatever I can find.",
    "sentiment": 0.9926,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "When I make coffee from my Moka pot I’m just drinking it straight with ice. No added water.\n\nIf I could pull 3 shots in one basket I think that would work for me. It’s more just wondering if I should just spend the money every morning at a coffee shop for convenience or buy my own machine to save money over time but take the time to have to make it every morning.",
    "sentiment": 0.2382,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "I think the James Hoffman video demonstrates this isn’t correct. Time also plays a role, which is why his testing indicated that a pour over extracted more caffeine from the same amount of coffee beans compared to espresso. He didn’t test a moka pot directly, but considering brew times are normally a couple of minutes, I’d assume you’d get slightly more caffeine from a moka pot using the same amount of coffee.",
    "sentiment": 0.128,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "You should stick with your Moka pot then. Without a good grinder, a great machine like a Gaggia Classic won't make significantly better coffee than a Moka.",
    "sentiment": -0.6814,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "https://preview.redd.it/ysadwjs4x0se1.png?width=2886&format=png&auto=webp&s=839e67843b2ba1fd5c582cd05059a43c8bb91d80\n\nThis is my diy cardboard cup dosing funnel for my 3-cups Bialetti moka pot. Works perfectly fine.  No more spilling. Just weigh the coffee before. My next project: make one for my 6-cups moka pot 😊",
    "sentiment": 0.5994,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "About time, dentists and lawyers get their moka pot.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "Invest in a burr grinder that can do espresso, like the df54 and a French press, aeropress, or moka pot. Then, when you have more budget, get an espresso machine knowing that you have the grinder taken care of.",
    "sentiment": 0.6908,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "I lived with moka pots for years before my first machine. Then when the bbe went on sale I got that.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "A little.\n\nBut a moka pot is heated while the hot steam created from heating goes through the coffee.\n\nThis one is already starting to cool when an external air compressor/ air pump creates pressure to push the warmish previously boiled water through the coffee.\n\nI’d guess this one would handle light roasts better. But moka is likely better for espresso roasted beans.\n\nNeither is espresso espresso. Though both should be able to make good coffee. The Uphott is probably closer to espresso pressures, even if a bit complicated and with lighter roast.",
    "sentiment": 0.9517,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "Holy shit 15-18?\n\nI thought that would choke your shot...\nI use P2 as well and my grind size for moka pot is 30 clicks.\n\nThey claim 30 is for espresso...\n\nI wonder why they are so inaccurate in their own grinder's click suggestions.",
    "sentiment": -0.7184,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "The Q air seems like a great option for you. It can do espresso to filter so will have no issues with moka pot.",
    "sentiment": 0.6293,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "Thank you, I don't know most of niity-gritty details.\n\nI'll be using the q air as a daily and solo driver. Just wanted to make sure the about the durability of it.\n\nAlso understood how excess finer grinds would result into more body and mouthful but couldn't understand how the flavor separation aspect would decrease completely.\n\nAnd lastly I'll be using the grinder for moka pot also. For that case I'll need something that would be good at getting medium-fine.",
    "sentiment": 0.7391,
    "title": "",
    "url": ""
  },
  {
    "keyword": "moka pot",
    "text": "No difference to worry  about - it's quibbling . A Piccolo is an Australian  coffee using a ristretto shot served in a 3 to 4 oz glass with steamed milk.\n\nA cortado is a double shot of espresso mixed with  an equal amount of steamed milk served in a 4 oz glass.\n\nBUT each drink can and will likely vary slightly depending on the region or shop you're visiting. \n\nMy smaller, 50/50 milk drinks are all Cortados and  sometimes the shots  are ristrettos. I sometimes use Moka Pot coffee . It's my house, so I'll call them what I want. My guests just drink them.\n\nYour art  is incredible, no matter what you call your drink.  Working in miniature of any art form takes a special talent.\n\nPax",
    "sentiment": 0.5423,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "How many clicks in Timemore C2 for Aeropress?",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Getting my first electric grinder. Want to invest in something good, that would serve me for a long time. I'm looking at the DF83v vs Varia VS6 vs Timemore Sculptor 078S. I mostly do Aeropress and lever espresso, (50/50). Any suggestions? Excluded Mazzer Philos because in my country it is $1400 delivered, while DF83V is $800, and VS6 is $950. Would appreciate any input.",
    "sentiment": 0.5423,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I would start with a clean and descale of the MoccaMaster and a thorough cleaning of the burrs on the Ode 2.  There could be some rancid oils lingering somewhere.\n\nThe water temp check on the MM is a good idea.\n\nAfter that, I would brew some of the same beans with a different method (French Press, Aeropress, pour over) to see if it is something inherent in these beans.",
    "sentiment": 0.2732,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Space Cowboy from Sightseer Roasters. Natural Ethiopian Yirgacheffe \nBrewed in AeroPress XL\nBright blueberry notes.",
    "sentiment": 0.6597,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Dapper & Wise - Fruit Snacks Blend\n\n(Washed & Natural Blend)\n\nBrewed in Aeropress using 2024 National Champion’s recipe\n\nLives up to the name, like fruit snacks in a cup. It’s one of those coffees that’s so good, you find yourself asking, “Am I really about to drink coffee at 6 PM?”",
    "sentiment": 0.8966,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Hey everyone! I'm looking for a grinder dedicated to aeropress/french press/V60, on which changing the grind size is easy. I would like for it do be single dose too, since my girlfriend and I don't enjoy the same kind of beans.\n\nI already have an espresso grinder (Mignon Turbo) and a hand grinder (1Zpresso Q2), but I would love another electric grinder on which changing the grind size is easy, to accomodate for all brewing methods.\n\nPrice shouldnt be an issue, as long as it's not in the thousands. I also wouldn't mind a hand grinder if there is a way to easily change the grind size to some presets.\n\nThanks!",
    "sentiment": 0.9808,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "DAK - Blueberry Boom. Brewing in an aeropress,\n4 weeks off roast, getting blueberry tea/blueberry fritter vibes. Delicious anaerobic natural from Ethiopia",
    "sentiment": 0.7351,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Hi coffee people, I'm travelling to Orlando from the UK next month, and i am taking my aeropress with me but crucially without a grinder, as I turned my old hand grinder into a pepper grinder. \n\nSo basically I am looking for somewhere I'd be able to source a bag of decent coffee which can be ground freshly for me, I am willing to take a hit on how freshly ground my beans are as its still going to be better than the Nescafe Gold that my wife's family insist on drinking.\n\nSo if anyone can help with this that would be brilliant, bonus points if anything can be delivered.",
    "sentiment": 0.974,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I've spent a fair amount of time researching this topic. The biggest issue is that if you batch brew something as dense as Cometeer coffee e.g. 15 grams of coffee in, 25 grams of brew out, you'll lose 20-25 grams of brew into the coffee grounds expanding (even after pressing them with something like Aeropress). I believe espresso loses less by keeping the grounds under pressure but it's not a batch brew. \n\nBased on their patent, Cometeer deal with this by using a centrifuge to extract all the brew from the grounds. I occasionally make espressos in a batch and freeze them in silicone containers in the freezer for an americano later, the results are tasty. But it takes too much time. I mainly keep buying Cometeer. It's expensive but well-deserved imo given how hard it is to replicate at home.",
    "sentiment": -0.25,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Hey,\n\nI am planning to buy a grinder. I will brew pourovers, aeropress, and a french press. Maybe an espresso somewhere in the future. The choice is between D54 and Bartaza encore ESP. I think both are solid grinders. However,\n\n1. Which has better customer service? Like buying broken parts, repairs etc.\n\n2. Which us more moddable of the two? i.e replacing burrs etc.",
    "sentiment": 0.504,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "This. About 2 years ago someone on here or /r/coffee convinced me to buy the mineral packets from Third Wave Water. I thought \"Sure, why not?\" and wasn't impressed when I used it with my AeroPress. I lived in Manhattan at the time and they have pretty great water. \n\nI live in South Florida now, and the water definitely has a different taste down here. I've always filtered my water with a Brita filter, which tastes better than the tap water. I bought a Gaggia Classic Pro Evo a few weeks ago (first actual espresso machine I've had, I don't count the 9Barista lol) and wasn't getting anything but sour/highly acidic shots. I found the packets about 2 days ago and bought a jug of distilled water. I made a shot with that water... Wow 😳 Even though it was their filtered coffee mixture, it was still better than *my* filtered tap water. I'm going to buy their espresso mixture now because I'm sold.",
    "sentiment": 0.9483,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "this isn't what you asked necessarily, but I found that an Aeropress makes coffee with all the qualities I like about french press coffee but without that texture I could never quite get over. I think you might like it. \n\nbut to answer your actual question: I use a Timemore C3 (for pourover and cold brew as well as Aeropress) and I really like it. it's also my first burr grinder as a step up from preground beans and it's exactly as much grinder as I need, lol. you could even pick up a C3 and an Aeropress for around $100 total ;)",
    "sentiment": 0.9549,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Better beans make a better brew for sure, but some brew methods are more forgiving for lesser quality beans. I’ve used fancy competition grade coffee beans and cheap supermarket beans in my aeropress and can get a good tasting cup of coffee out of either. Espresso is probably not as forgiving.",
    "sentiment": 0.9515,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "When I make milk drinks with filter coffee instead of espresso, I use a 1:10 brewing ratio.  I don’t use a drip coffee maker, though.  It’s either a moka pot, an aeropress, or cold brew.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I worked offshore in the Gulf of Mexico for YEARS and the coffee options are “Folgers” or “Community Coffee”.\n\nEventually I brought my own beans out with a grinder and an aeropress. If everything was going wrong, at least I had a good cup of coffee to look forward to.",
    "sentiment": -0.0516,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Aeropress? What’s that! *googles*",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "True. Sadly it requires nice equipment to do good beans justice brewing espresso. I can do damage with great beans and an aeropress though lol",
    "sentiment": 0.9153,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Hey! If you're torn between the Timemore C2 and Kingrinder P2, I'd *lightly* nudge you toward the K6 if you can stretch your budget. I’ve been using mine for a year with a moka pot, and the grind consistency is shockingly good for the price—way less muddy than pre-ground. Pro-tip: toss an Aeropress filter under the grounds basket (thanks, Hoffmann fans!) for cleaner cups. The K6’s steel burrs feel sturdier than the C2’s, and it’s easier to dial in for future brew methods if you branch out. Only gripe? The handle’s a smidge slippery, but a rubber band fixes that.",
    "sentiment": 0.4468,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I also started with a moka pot and a timemore chestnut grinder, it works great! I think the swap from pre-ground to fresh ground beans will make the most notable difference in your coffee.\n\nTo reduce the muddiness in my moka pot coffee, I added an aeropress filter in the bottom. James Hoffmann has some great videos on the moka pot. I'd recommend giving them a watch!",
    "sentiment": 0.9431,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I agree with all of that! I love my 1Zpresso grinder! I have a Kalita Wave (the little one… I always forget what the number is) and a v60 dripper, and an AeroPress. My personal preference (I have learned through brewing tons of coffee over many years) is for the Kalita Wave. I have recently done some reading about the different flavor profiles that can be achieved depending on whether you use a flat bottomed (Kalita) or conical(v60) pour-over and I found that the science matched my experience? The flat bottomed tends to give more body and the conical more acidity and floral… so, that might be a thing to consider?\n\nI have had various subscriptions through the years. To name a few: Verve (superb), Elm Roasters (delish!!), Loveless (dynamite), and most-recently SEY! These are all fairly high end roasters that are all around the same price point… the former two are on the west coast and the latter two are on the east coast… I like not having to stay on top of ordering and find a subscription handy in that it keeps me full of beans and caffeines! But, you can always just buy a bag of freshly roasted (two week after the roasting date is a real treat) coffee, chop it up and soak it in hot water (not too hot)! I feel like coffee and pizza are even good when they are bad 🤣",
    "sentiment": 0.8485,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Getting a good grinder is definitely the first thing to do to up your coffee game.  If you don’t mind hand grinding, the KinGrinder K6 can grind for anything (even espresso) and will leave you with plenty of room in your budget for other brewers.  1zpresso grinders are nicer than KinGrinders, for sure, but the improvement they offer to the coffee itself is actually fairly marginal.  Any hand grinder that can be considered a noticeable step up in coffee quality is going to be at least double the price.  (Comandante C40, OE Lido, etc.)  Timemore grinders are not bad as well, but I don’t know of any hand grinders from them that can grind for espresso.  I would recommend going straight for the KinGrinder, unless you know exactly what you’re going for with the other brewing methods and you’re absolutely sure you won’t want anything more.\n\nIf you want an electric grinder, I would recommend a DF54 or Baratza Encore.  The DF54 can grind for anything, but won’t leave you any more room in your budget.  The Baratza Encore is not great for espresso, but is good for everything else and will leave some room in your budget for a brewer or two.  (Baratza also makes an Encore ESP; I would not recommend this for you, as it is really only designed for espresso and will not leave any room in your budget for brewers.)\n\nOnce you get your grinder, here are my recommendations for brewers.  Mix and match any of these to your liking.  I love experimenting, so I use all of these pretty regularly.\n\nMoka Pot: ~$40, makes a hot coffee concentrate\n\nAeropress: ~$40, very versatile \n\nFrench Press: ~$30, makes immersion-brewed or cold brewed coffee.  Can also be used to foam milk.\n\nHario Switch: ~$40, makes pourover or immersion-brewed coffee.\n\nFlair Neo Flex: ~$100, makes espresso\n\nIf I could only get one, I would get the Aeropress.\n\nI’m unfortunately not much help on beans, as I kind of just brew whatever I can find.",
    "sentiment": 0.9926,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Hello everyone!\n\nI've discovered the joy of making coffee with a cheap kettle, and a bodum French press.\n\nMy life has changed since I've started buying Jimmy organic coffee that I grind at the store, but I feel like I need to upgrade my cheap \"setup\" if that even qualifies as one, to take this a step further and brew better cups of coffee. \n\nIt's been a bit hard to decide which equipment to get since there's so much choice out there.\n\nI've got a budget of about $250 (USD) to start.\nI was thinking I'd need a grinder, and and airtight container to store beans (I'm using a mason jar right now)  then idk if I'd need a gooseneck kettle, maybe a pour over, or just an aeropress? \n\nI've heard a lot about hand grinders like the kingrinder k6, the timemore and 1zpresso brands but I need help because I keep second guessing myself on what to buy lol\n\nI was wondering about getting better coffee beans. What would you recommend? (id probably stick with light! medium roasts. \n\nWhat do you think of Jimmy organic? I've also heard of Verve, La cabra but I have no idea if they're any good.\n\nAnyways any help is appreciated as I'm a newbie!!!  Thanks!",
    "sentiment": 0.9931,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Has anyone bought Gevalia recently? I picked up two bags, different roasts, different stores, two weeks apart and they both have a moldy / mildewy smell :-/\n\n  \nCurious if anyone could corroborate. I know they are overpriced but I have previously found it to make a good cup in my aeropress with their finer grind.",
    "sentiment": 0.5994,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Bout 5 years too late, but my 6-cup is driving me nuts. One day, without doing anything different, I managed the most delicious espresso out of it, and im still chasing that high. For the life of me I cannot replicate it - tomorrow ill try what you say, so no more than 140g in a 6 cup I assume. My current beans fit 24g to the top of the basket, im somewhere between a 500-600micron grind - how do you fit 28g in there- do you tamp it slightly? or do you grind very fine? If I try to go lower than 450microns-ish, the water somehow goes around the basket and i get super thin coffee (im using the aeropress filter, maybe that is also a problem?) As you offer, I would love your \"details\" in the hope of someday achieving that perfect espresso again!",
    "sentiment": 0.9808,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Invest in a burr grinder that can do espresso, like the df54 and a French press, aeropress, or moka pot. Then, when you have more budget, get an espresso machine knowing that you have the grinder taken care of.",
    "sentiment": 0.6908,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "1000%. I bought an aeropress so I could stop talking about V60.\n\nIf your method is so fragile that Mars being in retrograde gives you bad coffee, it's not a good method.",
    "sentiment": -0.8118,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I used to work lots of international corporate events, the teams of baristas we took out were always from all over Europe and the world. It became our ritual to always bring a bag of beans from somewhere we’d been recently. Making endless aeropresses in weird, back alley apartments all over the world, with amazing coffee and travel basic gear, made by some of the best baristas in the game are some of my happiest memories.",
    "sentiment": 0.91,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "You may not have the freedom to stock it but look into dandy blend as a coffee alternative. It's cheap and delicious! My solution for the decaf on demand would be aeropress or pour over.",
    "sentiment": 0.7475,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Hario switch! It’s the best of both worlds when it comes to a pourover. It has a little mechanism at the bottom to stop the flow. So if you’re starting out and don’t have a kettle, or for a myriad of reasons want an immersion brew instead of a pourover, it’s a great way to have a pourover and immersion brewer in one. \n\nI don’t have one, but that’s because I own a gooseneck, a V60, and an aeropress (with the Fellow Prismo) so I don’t really have the need to buy a 2 in 1 for items I already have :)",
    "sentiment": 0.8398,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I try to minimize my travel setup as much as possible so I can use as much of the existing coffee setup. It feels less “snobby” (not that it is, it’s not to say the coffee is terrible, it’s just that I’m particular how I enjoy my coffee) \n\nSo my travel setup is my aeropress (if I had a switch, I’d use that probably) because it’s an immersion brew, so I don’t need a gooseneck. Also helps for saving space",
    "sentiment": 0.4019,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Is it a big difference from the aeropress?",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "This. I had the same dilema years ago and I went to the Brewista because of the flowrate. It is great for pour over but also for tea o the Aeropress.",
    "sentiment": 0.3716,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I don't have a gooseneck kettle yet, with the price of them here i've been hesistant to buy one. A lot of people have said the ceado hoop would be a good option which makes me want to try it but i've also seen people say its not great for all coffee types -natural. Being in the far north of norway I wouldnt be able to get the upgraded filters so I think i'd be stuck to using aeropress filters.",
    "sentiment": -0.7042,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "A few other people said the Caedo hoop and I might buy one for my parents house (mostly for myself while im there) but for my main brewer I think i'm going to order the switch tomorrow.\n\nI'm not sure what type of coffee I enjoy yet (natural/washed/anaerobic) so I think thats what pushed me into something thats more difficult initially but I appreciate you making it easy for me to know what coffee the brewer is good with as that was one of my biggest fears with the super easy aeropress.",
    "sentiment": 0.951,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I always double filter cold brew-first with an Aeropress and then through a V60 although I just make mine by putting coarse-ground coffee and water into the fridge overnight. The Aeropress is required for the first step-filtering the raw mixture through a V60 is too slow. Then the extra filtration of the V60 gives it a very clean taste",
    "sentiment": 0.4576,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I've got the Q2 heptagonal, too, and I prefer it over Sculptor 078 with darker roasts and some naturals. The build quality seems great, too. And the fact that it fits inside an aeropress is very convenient.",
    "sentiment": 0.6249,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I usually start at 6.5 for aeropress and 7.0 for a pour over, I don’t adjust too much and usually focus on ratio more than anything. However, my recipe for a pour over is a little different. 3 pours (70g bloom, 2nd pour to 200g, and a final pour at 300g).",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I’m pretty casual about my Aeropress recipes, but generally 15g coffee + 250g water, back and forth stir, wait a few minutes, plunge.",
    "sentiment": 0.3612,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I'm new to light roast and just starting to dip a toe into locally available beans.  Just grabbed a bag from Futura for the first time.  I went with their Love Blend to see how their daily production coffee is.  I like it in the aeropress so far and will try it pourover soon.  \n\n15 grams beans, fine-ish grind, about 4 minute inverted with 209\\* water, 40 second +/- press.\n\n\"A complex blend, offering sweet red fruits and chocolate flavors. Composed of natural-processed traditional varieties from the Panama highlands and complemented with a bright and elegant Colombian from the Tolima region.\"",
    "sentiment": 0.9403,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "What aeropress recipe? 🙏🏼",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I picked this coffee up at the danish coffee festival last weekend. Had a testing and immediately bought a jar. Its very very good :)   \nI have mostly been brewing it with an aeropress + comandante combo",
    "sentiment": 0.881,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "my vote for lowest skill is the Ceado hoop.  But I would use thinner paper than the default filters.  Either aeropress filters or the ones Scott Rao sells.   It has built in drip assist and it is a single pour and then time it.   Shoot for 4 minutes brew time and then adjust for taste.   Does not get easier than that.\n\nUnfortunately its not the best brewer for all coffees imo.  It  works best with washed coffees that are kind of complex.   Naturals and anaerobic coffees not so much.   I find that is true for any non-bypass brewing.   Washed coffees from someone like Sey and Prodigal work best.   Something where you benefit from maximizing extraction.",
    "sentiment": -0.9288,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "The aeropress is surprisingly palatable, but I bought a Rancilio Silvia a few years back, and have my moka away soon afterwards. Nothing comes close to espresso.\n\nFiltered coffee tastes American.",
    "sentiment": 0.34,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Got a question about the Aeropress brewer? Alan Adler, the inventor of the AeroPress, will be answering your questions on CoffeeGeek.",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "Have you looked at an Aeropress? Or a Frenchpress? You would need a grinder for both of them but they make really tasty coffees for very cheap",
    "sentiment": 0.0,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "what recipe are you using? 60g to 1 liter of water is the standard for filter coffee. For two I usually do 30g for 500ml(2c). The dose of the Cafflano should be about 10g, so yeah a third less coffee but with the grind size difference I would think you are doing more work in the end. Yeah the Rhinowares one looks just like my knockoff Porlex. It was night and day when I made the transition. I switch coffees fairly regularly (coffee roaster), It was always a pain dialing it in because it was always left to chance. The Comandante is not perfect but it is fairly repeatable. I have a log book of different coffees and how many “clicks” it took to get the desired result, as well as what the dose was, how it was roasted, and water temp during brewing. When I come back around to the same, or similar, coffee I have a starting point. This helps a lot when switching between filter and espresso.\n\nAlso I never quite felt like I ever got the old grinder clean. I dislike ceramic grinders because they hold onto the oil. The Comandante is stainless so its easy to clean. \n\nI don’t say any of this to imply you need to upgrade. I had the Hario Skerton for years, back when I only had the Aeropress. This duo worked for 5 or so years, before I felt the need to upgrade. I work a couple of days a week as a Barista and I get tips. This is the money I use to support my Specialty coffee purchases as well as upgrades to my set up, which is another restriction I imposed. If I don’t have enough “sneak-pocket”, things don’t get bought.",
    "sentiment": 0.9721,
    "title": "",
    "url": ""
  },
  {
    "keyword": "aeropress",
    "text": "I’m honestly quite happy with this grinder. I just bought the longer crank handle with the bigger knob last week, It’s just enough of an improvement that the purchase feels justified. Are there other better grinders on the market, most likely. This gets the job done well, and it’s super portable. I had to set some self-imposed restrictions, becase I work as a coffee roaster and Barista. I think of myself as a “Manual Espresso Purist”. To me that means, no motor, no internal boiler, minimal electronics. My main setup includes a Flair 58, this grinder, and the Bellman Steamer. When I travel, I have this grinder, an Aeropress, and 1 cup Bialetti.",
    "sentiment": 0.9531,
    "title": "",
    "url": ""
  }
]