[
  {
    "keyword": "arabica",
    "text": "Yes and no. Price and quality correlate but it's not necessarily a causal relationship.\n\n\nFirst off most people here are not from coffee producing countries, for our coffee to be cheap it needs to be intensively farmed robusta where nobody involved in producing it was paid very much, this is as it costs a lot to get here, cheap coffees will then be blended when they get here for uniformity so there is no defining origin. I've tasted mexican supermarket coffee and while it's not the most subtle roast it's very fresh arabica from a specific region in the country and does have a flavour profile reflective of that, though it is masked by the roast quality. I would imagine if I went to Mexico with a €14 250g bag of speciality roast from the same region they would think I'm insane, the improvement wouldn't be worth that much of a jump in price. By the time that coffee gets here that's just what it costs though, and that's a very basic coffee of a productive varietal with no major processing.\n\n\nWith that in mind there are those additional factors of variety, processing, and roasting that add both cost and value. Those are carefully managed in speciality coffee. An internationally respected roaster in Colombia is [Amor Perfecto](https://cafeamorperfecto.com/) if you want to try something externally verified to see if it's for you. The fact is there are more people branding and pricing themselves as producing specialty coffee than are actually producing it, so sometimes you are just paying more for very little improvement. I try to taste things or get a recommendation before buying from somewhere new because of this.\n\n\nAssuming none of this is relevant and your coffee is well produced and roasted,  it is possible you're doing something to not get the best out of it. If it's very freshly roasted it might need to rest a week or two to taste of much for example. It's possible you've always brewed your coffee to a point of bitterness where it's no longer easy to differentiate tastes. Or maybe your grinder isn't up to the task. As you already have the coffee I'd suggest try cupping it to see if there's anything you might be missing in the preparation.",
    "sentiment": 0.5773,
    "title": "is expensive coffee just overrated?",
    "url": "https://www.reddit.com/r/Coffee/comments/1jigxmh/is_expensive_coffee_just_overrated/"
  },
  {
    "keyword": "arabica",
    "text": "Here is a Turkish coffee addict chiming in to clarify things. Turkish coffe is not the \"coffee bean itself\". It's the preparation of the coffee. In Turkish coffee you use dark roasted arabica or robusta type of coffe beans (arabica is always better.) and grind them super fine. No additional flavors in classical Turkish coffee. Then you put a cup of cold water into the coffe pot, put one desert spoon or tea spoon of this finely ground coffee into the pot with sugar if you want and put the pot onto the slow burning stove. You wait for the coffee to sink into the water before stirring it slowly and once everything is mixed you wait for the coffe to simmer. You \"never\" \"ever\" boil Turkish coffee or you'll lose its natural foam and taste. Once the coffee starts to simmer and rise you pour it to the cup. And voila! You have an espresso like coffee with a little more body. Do not worry about the coffee grounds. Since they are super fine they quickly sink to the bottom of the cup and never spoil your taste. Enjoy.",
    "sentiment": 0.9493,
    "title": "Beans used in Turkish/Arab coffee..?",
    "url": "https://www.reddit.com/r/Coffee/comments/fouw9g/beans_used_in_turkisharab_coffee/"
  },
  {
    "keyword": "arabica",
    "text": "I'm changing the beans every bag (1kg/500g) approx. varying among the different origins as I have been exploring the monorigins arabica only for few weeks so far...\n\nMy plan is to get some 250g bags once in a while so the flow will be a lil shorter but still not worth the single dose I guess...\n\nIn case I'll get a proper single dose machine in the future if I feel bold enough...🙈",
    "sentiment": 0.3402,
    "title": "Any reason to not purchase the Profitec MOVE? About to pull the trigger.",
    "url": "https://www.reddit.com/r/espresso/comments/1jn9do6/any_reason_to_not_purchase_the_profitec_move/"
  },
  {
    "keyword": "arabica",
    "text": "Espresso has two ingredients: water and coffee. It’s very important which coffee beans you're using, Robusta produces more cream than Arabica for example, even more important that the beans are freshly roasted. Grocery beans are often months old. If your extraction time is halfway o.k. - roughly between 18-30 seconds, it’s the coffee.",
    "sentiment": 0.4915,
    "title": "why my espresso don't have crema[breville bambino]",
    "url": "https://www.reddit.com/r/espresso/comments/1jo4plx/why_my_espresso_dont_have_cremabreville_bambino/"
  },
  {
    "keyword": "arabica",
    "text": "I came to this post , because even I had robusta and it shook me to the core for an entire day. Its the amount of caffeine for sure. Because my body does pretty good after arabica. \nFor a change this time I got myself lavazza gusto crema without knowing that it had robusta in it. \nThe moment i took third/ fourth sip of my espresso, it hit me so hard. Half of the day I kept wondering what could have gone wrong here , later it clicked me that i didnt checked wether gusto crema was 100% arabica or not. And then I gor to know that it had robusta mixed in it too. And now i know that I cant bear robusta and will only be sipping some of it on some special occasion and that to earliest in the morning possible . 😆😆😆",
    "sentiment": 0.694,
    "title": "Anyone else have a bad reaction to Robusta (but not to Arabica?)",
    "url": "https://www.reddit.com/r/barista/comments/1dwl475/anyone_else_have_a_bad_reaction_to_robusta_but/"
  },
  {
    "keyword": "arabica",
    "text": "Beans within arabica can vary between varietals... even in the Geisha category (and whether it's from Panama, Ethiopia, Colombia matters)\n\nI know that Panamaian Geishas are one the largest beans.\n\nEthiopia beans (non-geisha) like the JARC 74158 variety is one the smallest beans... and guess you had an Ethiopian Geisha which are also small.\n\nI've had an Oma/Gesha Village Ethiopian and indeed it's small but very aromatic/fruity",
    "sentiment": 0.1901,
    "title": "This is special",
    "url": "https://www.reddit.com/r/pourover/comments/1jnoo87/this_is_special/"
  },
  {
    "keyword": "arabica",
    "text": "That cafflano does look cool, as an all in one travel brewer. The pouring lid looks a little inconsistent(for my workflow) as a daily driver though . I think I would be upgrading to a Hario air kettle, as soon as I was able. Still… That may be making it’s way into a travel kit at some point.\n\nI dialed in the India robusta this morning, at the main cafe. It only took me 3 attempts to pull something drinkable. By the 6th pull it was something enjoyable, so maybe 6-7 min to dial in this morning.  To be fair Ive been drinking it at home since our conversation last week so I kind of had an idea of what I wanted, kicking around in my head. I’m decent enough at dialing in to be called “the fixer” at work. \n\nEspresso machines are crazy. Depending on the the machine and grinder setup, you have control over water volume, water temperature, water flow, grind setting, and espresso dose. This is all to achieve a an espresso shot that is roughly double the initial espresso weight you used, within the desired 20-30 second shot duration. Get any one of those things wrong and it can ruin the shot. Get them all right, your still not guaranteed something tasty. That just the initial things you have to factor in. The type of coffee, the origin, the roast level, the age of the green beans(before roasting), the age of the beans(after roasting) all have an effect on the end shot. Most people aren’t privy to all this information, and are anyways used to an espresso blend or 100% Arabica. This particular India Robusta is only peaberries, and has this syrupy consistency and a smoky/ sweet flavor, no acidity. Robusta in general has a bad reputation, but there are some really good farms/estates at the moment. Anyhow the hour long dial in estimate was based on my own experiences, and reports from customers. They were happy with the end result, but they all said it took time.",
    "sentiment": 0.8458,
    "title": "I don’t think I’ve ever waited so long for something to be delivered!",
    "url": "https://www.reddit.com/r/HomeBarista/comments/miusdl/i_dont_think_ive_ever_waited_so_long_for/"
  },
  {
    "keyword": "arabica",
    "text": "Nope, the hype around Arabica coffee being the best is purely based on marketing. Classic Italian espresso is usually made from a blend of both Arabica and Robusta coffee, with a ratio of around 60/40. Arabica coffee is not great at producing crema and can be a bit thin. In contrast, Robusta coffee is great at producing crema, but can be too bitter for some, though it has more caffeine than Arabica.\n\nVietnamese coffee is 100% Robusta. I got my hands on a Phin filter, after going to a Vietnamese restaurant. I fell in love with the full bodied Smokey flavor. In Vietnam the government invested in the research and development of the Robusta coffee sector. It's hearty, insect resistance, and faster maturation as apposed to Arabica was an easy win. Vietnam grows about 40% of the worlds Robusta coffee. The history of how Vietnam became a world coffee producer is super interesting. I'll link a video does a good idea of explaining the key points. \n\nI roast an India Parchment Peaberry Robusta at work. It's a beautiful coffee, and is a bestseller at the cafe's. We recommend it when someone says they want strong coffee, or they need a pick-me-up(more caffeine). Because Robusta is less expensive, we often sell out, so the demand is high. As espresso pulls beautifully 1cm of long standing crema easy. It looks a amazing when pulled into a glass espresso cup, it has these three distinct layers/bands. It just takes super long time to properly dial in so we only have it on the machine maybe once a season, and only if I'm working it.",
    "sentiment": 0.996,
    "title": "I don’t think I’ve ever waited so long for something to be delivered!",
    "url": "https://www.reddit.com/r/HomeBarista/comments/miusdl/i_dont_think_ive_ever_waited_so_long_for/"
  },
  {
    "keyword": "arabica",
    "text": "Cool, I didn't know that about crema, I guess it's more of a visual thing. Most important is the taste imo. For some maybe a mental thing - they see crema, they perceive a better taste.   \n\n\nI saw your setup, impressive! I'll try to get some pics of mine, still trying to source some good beans here in the meanwhile. Found a local guy that roasts his own beans, and they're really good, they use them at this cafe I started going to that makes really good coffee.   \n\n\nDo you find Robusta is commonly used at cafes? I thought every espresso shop uses 100% arabica.",
    "sentiment": 0.9558,
    "title": "I don’t think I’ve ever waited so long for something to be delivered!",
    "url": "https://www.reddit.com/r/HomeBarista/comments/miusdl/i_dont_think_ive_ever_waited_so_long_for/"
  },
  {
    "keyword": "arabica",
    "text": "Damn, I'm unfortunately located in Germany. I would definitely love to see more of you setup. I have my coffee station pic posted on here, you can see it my profile if you haven't already checked. \n\nCrema is kind of a misnomer as a scale for good espresso. Coffee has these foaming agents in it that trap the CO2 as its escaping from the solution after being under pressure. Along with fine coffee particles this collectively gets called \"Crema\". If you ever taste crema by itself its not very tasty. We have a $26,000 espresso machine at work and depending on the age, and type of coffee we are pulling we can get beautiful photo worthy shots(that taste terrible) or ugly as hell shots(that taste great) and everything in between. I was trained by this \"Old School\" Barista a few years ago. He really drilled into me the finer points of dialing in espresso. Coffee that is between 10 days and a month old pulls the best in my opinion. For best taste I find most coffees fall between 10 and 20 days (as espresso). If its an Arabica/Robusta blend or pure Robusta your guaranteed crema in most cases. 100% Arabica will have crema for a short while, but don't expect the mouthfeel be on par with a blend.",
    "sentiment": 0.7506,
    "title": "I don’t think I’ve ever waited so long for something to be delivered!",
    "url": "https://www.reddit.com/r/HomeBarista/comments/miusdl/i_dont_think_ive_ever_waited_so_long_for/"
  },
  {
    "keyword": "robusta",
    "text": "Yes and no. Price and quality correlate but it's not necessarily a causal relationship.\n\n\nFirst off most people here are not from coffee producing countries, for our coffee to be cheap it needs to be intensively farmed robusta where nobody involved in producing it was paid very much, this is as it costs a lot to get here, cheap coffees will then be blended when they get here for uniformity so there is no defining origin. I've tasted mexican supermarket coffee and while it's not the most subtle roast it's very fresh arabica from a specific region in the country and does have a flavour profile reflective of that, though it is masked by the roast quality. I would imagine if I went to Mexico with a €14 250g bag of speciality roast from the same region they would think I'm insane, the improvement wouldn't be worth that much of a jump in price. By the time that coffee gets here that's just what it costs though, and that's a very basic coffee of a productive varietal with no major processing.\n\n\nWith that in mind there are those additional factors of variety, processing, and roasting that add both cost and value. Those are carefully managed in speciality coffee. An internationally respected roaster in Colombia is [Amor Perfecto](https://cafeamorperfecto.com/) if you want to try something externally verified to see if it's for you. The fact is there are more people branding and pricing themselves as producing specialty coffee than are actually producing it, so sometimes you are just paying more for very little improvement. I try to taste things or get a recommendation before buying from somewhere new because of this.\n\n\nAssuming none of this is relevant and your coffee is well produced and roasted,  it is possible you're doing something to not get the best out of it. If it's very freshly roasted it might need to rest a week or two to taste of much for example. It's possible you've always brewed your coffee to a point of bitterness where it's no longer easy to differentiate tastes. Or maybe your grinder isn't up to the task. As you already have the coffee I'd suggest try cupping it to see if there's anything you might be missing in the preparation.",
    "sentiment": 0.5773,
    "title": "is expensive coffee just overrated?",
    "url": "https://www.reddit.com/r/Coffee/comments/1jigxmh/is_expensive_coffee_just_overrated/"
  },
  {
    "keyword": "robusta",
    "text": "Here is a Turkish coffee addict chiming in to clarify things. Turkish coffe is not the \"coffee bean itself\". It's the preparation of the coffee. In Turkish coffee you use dark roasted arabica or robusta type of coffe beans (arabica is always better.) and grind them super fine. No additional flavors in classical Turkish coffee. Then you put a cup of cold water into the coffe pot, put one desert spoon or tea spoon of this finely ground coffee into the pot with sugar if you want and put the pot onto the slow burning stove. You wait for the coffee to sink into the water before stirring it slowly and once everything is mixed you wait for the coffe to simmer. You \"never\" \"ever\" boil Turkish coffee or you'll lose its natural foam and taste. Once the coffee starts to simmer and rise you pour it to the cup. And voila! You have an espresso like coffee with a little more body. Do not worry about the coffee grounds. Since they are super fine they quickly sink to the bottom of the cup and never spoil your taste. Enjoy.",
    "sentiment": 0.9493,
    "title": "Beans used in Turkish/Arab coffee..?",
    "url": "https://www.reddit.com/r/Coffee/comments/fouw9g/beans_used_in_turkisharab_coffee/"
  },
  {
    "keyword": "robusta",
    "text": "Espresso has two ingredients: water and coffee. It’s very important which coffee beans you're using, Robusta produces more cream than Arabica for example, even more important that the beans are freshly roasted. Grocery beans are often months old. If your extraction time is halfway o.k. - roughly between 18-30 seconds, it’s the coffee.",
    "sentiment": 0.4915,
    "title": "why my espresso don't have crema[breville bambino]",
    "url": "https://www.reddit.com/r/espresso/comments/1jo4plx/why_my_espresso_dont_have_cremabreville_bambino/"
  },
  {
    "keyword": "robusta",
    "text": "I came to this post , because even I had robusta and it shook me to the core for an entire day. Its the amount of caffeine for sure. Because my body does pretty good after arabica. \nFor a change this time I got myself lavazza gusto crema without knowing that it had robusta in it. \nThe moment i took third/ fourth sip of my espresso, it hit me so hard. Half of the day I kept wondering what could have gone wrong here , later it clicked me that i didnt checked wether gusto crema was 100% arabica or not. And then I gor to know that it had robusta mixed in it too. And now i know that I cant bear robusta and will only be sipping some of it on some special occasion and that to earliest in the morning possible . 😆😆😆",
    "sentiment": 0.694,
    "title": "Anyone else have a bad reaction to Robusta (but not to Arabica?)",
    "url": "https://www.reddit.com/r/barista/comments/1dwl475/anyone_else_have_a_bad_reaction_to_robusta_but/"
  },
  {
    "keyword": "robusta",
    "text": "I'm no expert but the pouring lid does seem kinda iffy sometimes. Seems to get the job done though. \n\nIt's not super practical, but I still use it at home. For travel I can see it being a pretty cool option. I think it takes a certain person to use this machine though, I'm OK with manual grinding and using the whole contraption, but when I think about gifting the extra new one I have, I can't help but think that pretty much no one I know will use it lol. Too much of a hassle for most people I think.  \n\n\nFor dialing in coffee, you have to drink all those espresso's I'm assuming, to test them? I sometimes think about working as a barista, but I would be cracked out after drinking more than 2 espressos a day.   \n\n\nWow all that work for a good shot of espresso. I always wondered why baristas are paid so little, seems like a job that should merit a much higher salary.   \n\n\nI need to try some robusta beans sometimes. Never seen anyone selling them, might not be a thing yet on this side of the Atlantic.",
    "sentiment": 0.9822,
    "title": "I don’t think I’ve ever waited so long for something to be delivered!",
    "url": "https://www.reddit.com/r/HomeBarista/comments/miusdl/i_dont_think_ive_ever_waited_so_long_for/"
  },
  {
    "keyword": "robusta",
    "text": "That cafflano does look cool, as an all in one travel brewer. The pouring lid looks a little inconsistent(for my workflow) as a daily driver though . I think I would be upgrading to a Hario air kettle, as soon as I was able. Still… That may be making it’s way into a travel kit at some point.\n\nI dialed in the India robusta this morning, at the main cafe. It only took me 3 attempts to pull something drinkable. By the 6th pull it was something enjoyable, so maybe 6-7 min to dial in this morning.  To be fair Ive been drinking it at home since our conversation last week so I kind of had an idea of what I wanted, kicking around in my head. I’m decent enough at dialing in to be called “the fixer” at work. \n\nEspresso machines are crazy. Depending on the the machine and grinder setup, you have control over water volume, water temperature, water flow, grind setting, and espresso dose. This is all to achieve a an espresso shot that is roughly double the initial espresso weight you used, within the desired 20-30 second shot duration. Get any one of those things wrong and it can ruin the shot. Get them all right, your still not guaranteed something tasty. That just the initial things you have to factor in. The type of coffee, the origin, the roast level, the age of the green beans(before roasting), the age of the beans(after roasting) all have an effect on the end shot. Most people aren’t privy to all this information, and are anyways used to an espresso blend or 100% Arabica. This particular India Robusta is only peaberries, and has this syrupy consistency and a smoky/ sweet flavor, no acidity. Robusta in general has a bad reputation, but there are some really good farms/estates at the moment. Anyhow the hour long dial in estimate was based on my own experiences, and reports from customers. They were happy with the end result, but they all said it took time.",
    "sentiment": 0.8458,
    "title": "I don’t think I’ve ever waited so long for something to be delivered!",
    "url": "https://www.reddit.com/r/HomeBarista/comments/miusdl/i_dont_think_ive_ever_waited_so_long_for/"
  },
  {
    "keyword": "robusta",
    "text": "Thanks for that Zen, didn't know that about Vietnamese Coffee, nor Robusta. I'll give robusta a go again next time I see it. 1cm of crema is something I don't think I've seen before. \n\nHow come it's so hard to dial in? I've never learned how to use those espresso machines, so always wondered what the dialing-in process consisted of. \n\nI also love Vietnamese Coffee, through those Phin filters. Sometimes I would go to those Vietnamese Pho places just for that coffee with condensed milk. Viet coffee is definitely the strongest I think as well... whenever I order the tall iced glass of Viet coffee in boba or Viet places, I remember I wouldn't be able to sleep and would be quite cracked out. \n\nBtw, finally took some pics of the Cafflano Klassic, [here's](https://www.reddit.com/r/HomeBarista/comments/13b35fi/guerrero_natural_beans_with_cafflano_klassic/) a photo of a pour over I made with some Guerrero natural beans I recently bought.",
    "sentiment": 0.9236,
    "title": "I don’t think I’ve ever waited so long for something to be delivered!",
    "url": "https://www.reddit.com/r/HomeBarista/comments/miusdl/i_dont_think_ive_ever_waited_so_long_for/"
  },
  {
    "keyword": "robusta",
    "text": "Nope, the hype around Arabica coffee being the best is purely based on marketing. Classic Italian espresso is usually made from a blend of both Arabica and Robusta coffee, with a ratio of around 60/40. Arabica coffee is not great at producing crema and can be a bit thin. In contrast, Robusta coffee is great at producing crema, but can be too bitter for some, though it has more caffeine than Arabica.\n\nVietnamese coffee is 100% Robusta. I got my hands on a Phin filter, after going to a Vietnamese restaurant. I fell in love with the full bodied Smokey flavor. In Vietnam the government invested in the research and development of the Robusta coffee sector. It's hearty, insect resistance, and faster maturation as apposed to Arabica was an easy win. Vietnam grows about 40% of the worlds Robusta coffee. The history of how Vietnam became a world coffee producer is super interesting. I'll link a video does a good idea of explaining the key points. \n\nI roast an India Parchment Peaberry Robusta at work. It's a beautiful coffee, and is a bestseller at the cafe's. We recommend it when someone says they want strong coffee, or they need a pick-me-up(more caffeine). Because Robusta is less expensive, we often sell out, so the demand is high. As espresso pulls beautifully 1cm of long standing crema easy. It looks a amazing when pulled into a glass espresso cup, it has these three distinct layers/bands. It just takes super long time to properly dial in so we only have it on the machine maybe once a season, and only if I'm working it.",
    "sentiment": 0.996,
    "title": "I don’t think I’ve ever waited so long for something to be delivered!",
    "url": "https://www.reddit.com/r/HomeBarista/comments/miusdl/i_dont_think_ive_ever_waited_so_long_for/"
  },
  {
    "keyword": "robusta",
    "text": "Cool, I didn't know that about crema, I guess it's more of a visual thing. Most important is the taste imo. For some maybe a mental thing - they see crema, they perceive a better taste.   \n\n\nI saw your setup, impressive! I'll try to get some pics of mine, still trying to source some good beans here in the meanwhile. Found a local guy that roasts his own beans, and they're really good, they use them at this cafe I started going to that makes really good coffee.   \n\n\nDo you find Robusta is commonly used at cafes? I thought every espresso shop uses 100% arabica.",
    "sentiment": 0.9558,
    "title": "I don’t think I’ve ever waited so long for something to be delivered!",
    "url": "https://www.reddit.com/r/HomeBarista/comments/miusdl/i_dont_think_ive_ever_waited_so_long_for/"
  },
  {
    "keyword": "robusta",
    "text": "Damn, I'm unfortunately located in Germany. I would definitely love to see more of you setup. I have my coffee station pic posted on here, you can see it my profile if you haven't already checked. \n\nCrema is kind of a misnomer as a scale for good espresso. Coffee has these foaming agents in it that trap the CO2 as its escaping from the solution after being under pressure. Along with fine coffee particles this collectively gets called \"Crema\". If you ever taste crema by itself its not very tasty. We have a $26,000 espresso machine at work and depending on the age, and type of coffee we are pulling we can get beautiful photo worthy shots(that taste terrible) or ugly as hell shots(that taste great) and everything in between. I was trained by this \"Old School\" Barista a few years ago. He really drilled into me the finer points of dialing in espresso. Coffee that is between 10 days and a month old pulls the best in my opinion. For best taste I find most coffees fall between 10 and 20 days (as espresso). If its an Arabica/Robusta blend or pure Robusta your guaranteed crema in most cases. 100% Arabica will have crema for a short while, but don't expect the mouthfeel be on par with a blend.",
    "sentiment": 0.7506,
    "title": "I don’t think I’ve ever waited so long for something to be delivered!",
    "url": "https://www.reddit.com/r/HomeBarista/comments/miusdl/i_dont_think_ive_ever_waited_so_long_for/"
  },
  {
    "keyword": "ethiopia",
    "text": "Sumatra Mandheling from Smokin Beans med. roast, pour over. Still fiddling with the grind and amount of coffee , but I think I'm remembering why I'm not a big fan of Sumatra. lol. It's low acid, low sweetness, earthy. I usually get brighter, fruitier, usually African beans. Not a bad coffee, just not for me. I've got some Ethiopian Guji from them waiting to try next.",
    "sentiment": 0.8567,
    "title": "[MOD] What have you been brewing this week?/ Coffee bean recommendations",
    "url": "https://www.reddit.com/r/Coffee/comments/1jlz6xd/mod_what_have_you_been_brewing_this_week_coffee/"
  },
  {
    "keyword": "ethiopia",
    "text": "**Subtext Raquel Lasso Washed Gesha** \\- Unlike any washed gesha I have tried. First cup I was hit in the face with sweet tropical fruit but very little acidity. Second cup was more acid forward and I got more raspberry notes which I enjoyed more. It honestly tastes more like a natural process than a washed process bean. I really like the aftertaste it leaves a very pleasant mouthfeel. I think it will open up more I am still on the early side.\n\n**Subtext Daniel Caro Washed Chiroso** \\- Similar vibe to the last couple mejorados I have been trying. Dates and stone fruit is mostly what I get. I love this cup profile. If the rest of my daily cups could just taste like this bag I would be happy. It has been very easy to brew and lovely.\n\n**Subtext Sebastian Garces Washed Enepei** \\- Never heard of this varietal before, not sure it is even technically a true varietal yet. This may be the first time I have not gotten anything resembling the notes on the bag from Subtext. They note cola, red apple, and blue fruit. My cups have been pretty hollow and woody/green tasting. I am hoping if I let it rest longer I get something more enjoyable. My first real miss after trying 8+ bags of Subtext.\n\nI still think their reserve subscription is the best subscription I have tried for the price and I am bummed I am skipping next month after I saw what they are offering.\n\n**S&W Colombia Santa Monica Lychee Coferment** \\- I kinda knew going into it that I would not like this coffee. I let it rest for 2 months and I still don't enjoy it. The only way I found it somewhat enjoyable was blending it with other coffee. I get a pretty bitter aftertaste and of course notes of lychee.\n\n**S&W Rwanda Dukorere Kawa Bukure Natural** \\- This one was pretty decent, not quite up to the standard of kenyas and natural ethiopias I have gotten from S&W. Which was kinda to be expected but I like trying other countries in africa. I have had good cups from Burundi, Congo, and Uganda. I noted plum and black tea notes. Was hoping for more berry/stone fruit, but the acidity/tartness wasn't coming through for me.",
    "sentiment": 0.9985,
    "title": "[MOD] What have you been brewing this week?/ Coffee bean recommendations",
    "url": "https://www.reddit.com/r/Coffee/comments/1jlz6xd/mod_what_have_you_been_brewing_this_week_coffee/"
  },
  {
    "keyword": "ethiopia",
    "text": "Space Cowboy from Sightseer Roasters. Natural Ethiopian Yirgacheffe \nBrewed in AeroPress XL\nBright blueberry notes.",
    "sentiment": 0.6597,
    "title": "[MOD] What have you been brewing this week?/ Coffee bean recommendations",
    "url": "https://www.reddit.com/r/Coffee/comments/1jlz6xd/mod_what_have_you_been_brewing_this_week_coffee/"
  },
  {
    "keyword": "ethiopia",
    "text": "DAK - Blueberry Boom. Brewing in an aeropress,\n4 weeks off roast, getting blueberry tea/blueberry fritter vibes. Delicious anaerobic natural from Ethiopia",
    "sentiment": 0.7351,
    "title": "[MOD] What have you been brewing this week?/ Coffee bean recommendations",
    "url": "https://www.reddit.com/r/Coffee/comments/1jlz6xd/mod_what_have_you_been_brewing_this_week_coffee/"
  },
  {
    "keyword": "ethiopia",
    "text": "when i got into coffee, light-roast ethiopian beans blew me away (still do).",
    "sentiment": 0.0,
    "title": "[MOD] The Daily Question Thread",
    "url": "https://www.reddit.com/r/Coffee/comments/1jl0dwv/mod_the_daily_question_thread/"
  },
  {
    "keyword": "ethiopia",
    "text": "Totally true about those \"ungodly great beans\" - I've found the best way to discover them is actually keeping a really basic log of what you liked and why. After blowing too much cash on fancy beans that didnt click with me, I started writing batch numbers and origins down with quick notes like \"fruity\" or \"chocolate bomb\" or just \"meh\". Now I kinda know what regions I prefer for espresso (Ethiopia and Colombia usually slap) and which roasters nail my preferred profile. Water quality matters almost as much tho - when i moved apartments my exact same bean setup suddenly tasted totally different until I started filtering.",
    "sentiment": 0.9273,
    "title": "Unfortunately, the beans do matter.",
    "url": "https://www.reddit.com/r/Coffee/comments/1jj3ol9/unfortunately_the_beans_do_matter/"
  },
  {
    "keyword": "ethiopia",
    "text": "Okay so was it worth it? I am also on the hunt for the elusive Ethiopian natural blueberry notes beans.",
    "sentiment": 0.6771,
    "title": "Blueberry Ethiopian Coffee",
    "url": "https://www.reddit.com/r/Coffee/comments/g66tyx/blueberry_ethiopian_coffee/"
  },
  {
    "keyword": "ethiopia",
    "text": "Thanks for sharing. She’s definitely leaning towards Ethiopian since that seems to be the theme in her research to find a great sweet coffee bean. I hope you’re able to replicate it someday. Sounds deliciously genius.",
    "sentiment": 0.9652,
    "title": "Looking for opinions on the naturally most sweetest coffee in the world... Espresso enthusiasts welcome! [No budget]",
    "url": "https://www.reddit.com/r/espresso/comments/1jm3zk1/looking_for_opinions_on_the_naturally_most/"
  },
  {
    "keyword": "ethiopia",
    "text": "Liberica can be crazy sweet. Sweetest I've ever had was a Quang Tri Liberica from RAAW in Hanoi, Vietnam. Actual sucrose, sugary sweet taste, but with a weird liquorice taste that might be off putting. \n\nI had a ridiculously sweet espresso god-shot from a 74112 Ethiopian natural by Mullugeta Muntasha that I roasted earlier this year. The shot was a totally botched dial-in attempt - choked the machine and pulled a 1 minute 20 second blooming espresso to rescue it, but it was the best-tasting espresso I've ever made. Tasted like blueberry jam. I have never been able to replicate it again since, even with the same bean.",
    "sentiment": 0.8381,
    "title": "Looking for opinions on the naturally most sweetest coffee in the world... Espresso enthusiasts welcome! [No budget]",
    "url": "https://www.reddit.com/r/espresso/comments/1jm3zk1/looking_for_opinions_on_the_naturally_most/"
  },
  {
    "keyword": "ethiopia",
    "text": "Mine is an Ethiopian Abaya Gesha. Thanks for the reply.",
    "sentiment": 0.4404,
    "title": "This is special",
    "url": "https://www.reddit.com/r/pourover/comments/1jnoo87/this_is_special/"
  },
  {
    "keyword": "ethiopia",
    "text": "Beans within arabica can vary between varietals... even in the Geisha category (and whether it's from Panama, Ethiopia, Colombia matters)\n\nI know that Panamaian Geishas are one the largest beans.\n\nEthiopia beans (non-geisha) like the JARC 74158 variety is one the smallest beans... and guess you had an Ethiopian Geisha which are also small.\n\nI've had an Oma/Gesha Village Ethiopian and indeed it's small but very aromatic/fruity",
    "sentiment": 0.1901,
    "title": "This is special",
    "url": "https://www.reddit.com/r/pourover/comments/1jnoo87/this_is_special/"
  },
  {
    "keyword": "ethiopia",
    "text": "PERC just released this three part bundle - all from different dates \n\n[PERC Ethiopia ](https://perccoffee.com/products/time-taste-ethiopia-benti-nenka)",
    "sentiment": 0.0,
    "title": "Roasters who sell rested coffee?",
    "url": "https://www.reddit.com/r/pourover/comments/1jnjspn/roasters_who_sell_rested_coffee/"
  },
  {
    "keyword": "ethiopia",
    "text": "My general rule for Ethiopians…feet pours will lead to better coffee. Two max;)\n\nSomeone else mentioned it, but especially with Ethiopians, don’t push the dose. \n\nDon’t swirl. \n\nIf you are in a tough spot, bloom and single pour with massive stir to get your agitation in that one pour. This works well for Ethiopians. \n\nStalling and long draw down is almost always related to fines migrating and clogging up the filter. So, fewer pours will be better, avoiding swirls will be better and subsequent pours before the prior fully drawn down will generally be better.\n\nEdit: I pretty much use 6.0 on ode 2 for almost every brew.  Know that your Ethiopian bean will have fines, no matter the grind setting.   If you stay at 5 and do single pour, it will brew in under two minutes and will be quite well extracted for the time it took.  (I stir with chopstick when I single pour).",
    "sentiment": 0.9169,
    "title": "Help Wanted: 2nd pourover mistakes?",
    "url": "https://www.reddit.com/r/pourover/comments/1jnjkuh/help_wanted_2nd_pourover_mistakes/"
  },
  {
    "keyword": "ethiopia",
    "text": "This Ethiopian Sidamo is rested - roasted Feb 28.  Nice. Not too funky. I don’t know if they ship. Send me a PM?",
    "sentiment": 0.476,
    "title": "Roasters who sell rested coffee?",
    "url": "https://www.reddit.com/r/pourover/comments/1jnjspn/roasters_who_sell_rested_coffee/"
  },
  {
    "keyword": "ethiopia",
    "text": "Solution seems to stick to non Ethiopian even though I love African. Wife is more into South American.\n\nI started too fine I guess, agitation I can reduce. Another commenter suggested Kalita doesn’t need much.",
    "sentiment": 0.743,
    "title": "Help Wanted: 2nd pourover mistakes?",
    "url": "https://www.reddit.com/r/pourover/comments/1jnjkuh/help_wanted_2nd_pourover_mistakes/"
  },
  {
    "keyword": "ethiopia",
    "text": "One frustrating element in all this is that many beans will do well at that setting. \n\nIndeed, it is often said to go finer and finer until it starts tasting worse. \n\nBut Ethiopians can be tricky. Case in point, I often see people suggest brewing them at lower temperatures and reducing agitation (eg swirls), but the one I finally dialled in this morning was brewed at 99C with relatively heavy pours (though no swirling). \n\nIn any case, coarser does seem to be the way to go here to avoid the fines-related clogging. And if you aren’t 3 weeks off roast that could impact it too IMHO, if my own learning is correct",
    "sentiment": -0.9224,
    "title": "Help Wanted: 2nd pourover mistakes?",
    "url": "https://www.reddit.com/r/pourover/comments/1jnjkuh/help_wanted_2nd_pourover_mistakes/"
  },
  {
    "keyword": "ethiopia",
    "text": "Ethiopians can be particularly tricky to dial in regardless of brewer - funnily enough, I managed it just this morning on my own bag after 5 or 6 brews. FWIW, I also brew with Origami.\n\nI'd also add that *too bitter* and *overly acidic*(/astringent) both do seem to indicate over-extraction, which is what I would expect from coffee ground too fine.\n\nIf you don't want to take my word for it, Hoffmann says the same on page 91 of his book \"How to Make the Best Coffee at Home.\"",
    "sentiment": 0.7773,
    "title": "Help Wanted: 2nd pourover mistakes?",
    "url": "https://www.reddit.com/r/pourover/comments/1jnjkuh/help_wanted_2nd_pourover_mistakes/"
  },
  {
    "keyword": "ethiopia",
    "text": "I'm interested that you preferred yesterday with its even longer drain time.\n\nThe long drawdown suggests one of two things for me: either the grind is too fine (and for an Ethiopian - which tend to have a lot of fines that can clog your filter and extend your drain times - setting 5 on Ode 2 stock burrs may very well be too fine) or/and the beans are too fresh off the roast.\n\nThe latter possibility I've only learned more about recently. I'd be curious about the roast date of your beans.\n\nIn sum, I'd suggest grinding significantly coarser and (possibly) resting your beans longer to contend with the significantly overlong drawdowns.",
    "sentiment": 0.8858,
    "title": "Help Wanted: 2nd pourover mistakes?",
    "url": "https://www.reddit.com/r/pourover/comments/1jnjkuh/help_wanted_2nd_pourover_mistakes/"
  },
  {
    "keyword": "ethiopia",
    "text": "Are your burrs seasoned? It will take a few kilos before they settle. Some coffees are very slow anyway (Ethiopia na or washed Geshas). It could also be your pouring style",
    "sentiment": 0.0,
    "title": "Timemore 078: How to grind at lower settings with decent flow?",
    "url": "https://www.reddit.com/r/pourover/comments/1jngicw/timemore_078_how_to_grind_at_lower_settings_with/"
  },
  {
    "keyword": "ethiopia",
    "text": "The thing is I roasted it myself and I found it in the back of my cabinet in a small unmarked jar 😭 but I am quite sure it was Ethiopia Dry process Buno Dambi Uddo from Sweet Maria's. I ignored it for a bit because I thought the jar still smelled like the pesto it used to hold, but trying it again paid off. Unfortunately the beans are sold out by now or else I'd be buying several pounds",
    "sentiment": 0.6798,
    "title": "Can you really taste different coffee notes?",
    "url": "https://www.reddit.com/r/pourover/comments/1jlkcf4/can_you_really_taste_different_coffee_notes/"
  },
  {
    "keyword": "ethiopia",
    "text": "The have an Ecuadorean Alambi lot right now that is very good. If you can’t find this Ethiopian give that a try it is very bright and juicy and extremely clean. I think it had a 90+ tasting score.",
    "sentiment": 0.8548,
    "title": "This is a banger",
    "url": "https://www.reddit.com/r/pourover/comments/1jmkcvk/this_is_a_banger/"
  },
  {
    "keyword": "ethiopia",
    "text": "I’m guessing it’s a light roast, Ethiopian beans are not easy to work with, you need adjustments both with grind size and contact time. I would recommend grinding a little bit finer and using Hario switch if you have it.",
    "sentiment": 0.0243,
    "title": "Grind size or temperature",
    "url": "https://www.reddit.com/r/pourover/comments/1jn6lcx/grind_size_or_temperature/"
  },
  {
    "keyword": "ethiopia",
    "text": "I also have this bag, roasted late February, and it’s been delightful. \n\nCan you describe your grind setting in terms I may understand as someone with a K6 hand grinder? Did you go more coarse than usual? I usually find that to be the case with Ethiopian coffees\n\nI have about 40 grams left so I want to try to refine my recipe for my last couple cups\n\n\nAlso, maybe you could do the roaster a favor and put their name in the body of your post. This way it’ll show up better in Google and Reddit search results",
    "sentiment": 0.9287,
    "title": "This is a banger",
    "url": "https://www.reddit.com/r/pourover/comments/1jmkcvk/this_is_a_banger/"
  },
  {
    "keyword": "ethiopia",
    "text": "I just opened a bag of Ethiopian Abaya Gesha and my first thought was also how small the beans are. Is this the normal size for most Gesha? Coffee is super interesting, though.",
    "sentiment": 0.765,
    "title": "This is a banger",
    "url": "https://www.reddit.com/r/pourover/comments/1jmkcvk/this_is_a_banger/"
  },
  {
    "keyword": "colombia",
    "text": "I absolutely agree with this. Beans are everything. Although as someone who lives in Kenya, I have to admit I’m spoiled for choice when it comes to this. Ever since I started making adult money (😅) and invested in coffee, I’ve been thoroughly enjoying exploring East Africa beans. It’s been an amazing journey to say the least and now I’d like to start exploring coffee from other regions (definitely keeping my eye out for Colombia and Guatemala beans)",
    "sentiment": 0.9272,
    "title": "Unfortunately, the beans do matter.",
    "url": "https://www.reddit.com/r/Coffee/comments/1jj3ol9/unfortunately_the_beans_do_matter/"
  },
  {
    "keyword": "colombia",
    "text": "**Subtext Raquel Lasso Washed Gesha** \\- Unlike any washed gesha I have tried. First cup I was hit in the face with sweet tropical fruit but very little acidity. Second cup was more acid forward and I got more raspberry notes which I enjoyed more. It honestly tastes more like a natural process than a washed process bean. I really like the aftertaste it leaves a very pleasant mouthfeel. I think it will open up more I am still on the early side.\n\n**Subtext Daniel Caro Washed Chiroso** \\- Similar vibe to the last couple mejorados I have been trying. Dates and stone fruit is mostly what I get. I love this cup profile. If the rest of my daily cups could just taste like this bag I would be happy. It has been very easy to brew and lovely.\n\n**Subtext Sebastian Garces Washed Enepei** \\- Never heard of this varietal before, not sure it is even technically a true varietal yet. This may be the first time I have not gotten anything resembling the notes on the bag from Subtext. They note cola, red apple, and blue fruit. My cups have been pretty hollow and woody/green tasting. I am hoping if I let it rest longer I get something more enjoyable. My first real miss after trying 8+ bags of Subtext.\n\nI still think their reserve subscription is the best subscription I have tried for the price and I am bummed I am skipping next month after I saw what they are offering.\n\n**S&W Colombia Santa Monica Lychee Coferment** \\- I kinda knew going into it that I would not like this coffee. I let it rest for 2 months and I still don't enjoy it. The only way I found it somewhat enjoyable was blending it with other coffee. I get a pretty bitter aftertaste and of course notes of lychee.\n\n**S&W Rwanda Dukorere Kawa Bukure Natural** \\- This one was pretty decent, not quite up to the standard of kenyas and natural ethiopias I have gotten from S&W. Which was kinda to be expected but I like trying other countries in africa. I have had good cups from Burundi, Congo, and Uganda. I noted plum and black tea notes. Was hoping for more berry/stone fruit, but the acidity/tartness wasn't coming through for me.",
    "sentiment": 0.9985,
    "title": "[MOD] What have you been brewing this week?/ Coffee bean recommendations",
    "url": "https://www.reddit.com/r/Coffee/comments/1jlz6xd/mod_what_have_you_been_brewing_this_week_coffee/"
  },
  {
    "keyword": "colombia",
    "text": "Get a natural processed Gesha from Panama or Colombia origin. Check your local cafe if some of them serves it and request it as Cappuccino.",
    "sentiment": 0.3612,
    "title": "[MOD] The Daily Question Thread",
    "url": "https://www.reddit.com/r/Coffee/comments/1jlrjz9/mod_the_daily_question_thread/"
  },
  {
    "keyword": "colombia",
    "text": "Totally true about those \"ungodly great beans\" - I've found the best way to discover them is actually keeping a really basic log of what you liked and why. After blowing too much cash on fancy beans that didnt click with me, I started writing batch numbers and origins down with quick notes like \"fruity\" or \"chocolate bomb\" or just \"meh\". Now I kinda know what regions I prefer for espresso (Ethiopia and Colombia usually slap) and which roasters nail my preferred profile. Water quality matters almost as much tho - when i moved apartments my exact same bean setup suddenly tasted totally different until I started filtering.",
    "sentiment": 0.9273,
    "title": "Unfortunately, the beans do matter.",
    "url": "https://www.reddit.com/r/Coffee/comments/1jj3ol9/unfortunately_the_beans_do_matter/"
  },
  {
    "keyword": "colombia",
    "text": "I would look for a middle ground, the beans you bought were $40 USD/lb in Colombia, that's an incredibly expensive coffee. I would never pay that without being very familiar with the roaster and the origin and knowing that I'm gonna enjoy it. And even then, maybe once a decade?\n\n\nI pay around $13-18/lb in the US ($13 is direct from the roaster who I've been buying from for 15 years and have a friendship with) and I am more than satisfied with the quality.\n\n\nI think you'll be more likely satisfied if you start at more of the lower end of specialty so you can explore the options (origin, wash type, roast level, roaster) without feeling like you're splurging on a luxury good.",
    "sentiment": 0.8958,
    "title": "is expensive coffee just overrated?",
    "url": "https://www.reddit.com/r/Coffee/comments/1jigxmh/is_expensive_coffee_just_overrated/"
  },
  {
    "keyword": "colombia",
    "text": "Yes and no. Price and quality correlate but it's not necessarily a causal relationship.\n\n\nFirst off most people here are not from coffee producing countries, for our coffee to be cheap it needs to be intensively farmed robusta where nobody involved in producing it was paid very much, this is as it costs a lot to get here, cheap coffees will then be blended when they get here for uniformity so there is no defining origin. I've tasted mexican supermarket coffee and while it's not the most subtle roast it's very fresh arabica from a specific region in the country and does have a flavour profile reflective of that, though it is masked by the roast quality. I would imagine if I went to Mexico with a €14 250g bag of speciality roast from the same region they would think I'm insane, the improvement wouldn't be worth that much of a jump in price. By the time that coffee gets here that's just what it costs though, and that's a very basic coffee of a productive varietal with no major processing.\n\n\nWith that in mind there are those additional factors of variety, processing, and roasting that add both cost and value. Those are carefully managed in speciality coffee. An internationally respected roaster in Colombia is [Amor Perfecto](https://cafeamorperfecto.com/) if you want to try something externally verified to see if it's for you. The fact is there are more people branding and pricing themselves as producing specialty coffee than are actually producing it, so sometimes you are just paying more for very little improvement. I try to taste things or get a recommendation before buying from somewhere new because of this.\n\n\nAssuming none of this is relevant and your coffee is well produced and roasted,  it is possible you're doing something to not get the best out of it. If it's very freshly roasted it might need to rest a week or two to taste of much for example. It's possible you've always brewed your coffee to a point of bitterness where it's no longer easy to differentiate tastes. Or maybe your grinder isn't up to the task. As you already have the coffee I'd suggest try cupping it to see if there's anything you might be missing in the preparation.",
    "sentiment": 0.5773,
    "title": "is expensive coffee just overrated?",
    "url": "https://www.reddit.com/r/Coffee/comments/1jigxmh/is_expensive_coffee_just_overrated/"
  },
  {
    "keyword": "colombia",
    "text": "Currently working through several Subtext and H&S coffees!\n- [El Cerro (Peruvian Gesha)](https://hscoffeeroasters.com/collections/coffee/products/peru-el-cerro?variant=40773709103162): still waiting for the best from this coffee, but on Day 33 it's extremely delicate and airy, with light sweetness and jasmine florality predominantly. Acidity is still not quite there.\n- [Maria Delgado (Colombian Caturra)](https://www.subtext.coffee/collections/filter-coffee-beans/products/colombia-maria-delgado-washed-caturra): very juicy and \"nostalgic\" washed Colombian profile, which a classic malic warmth in finish. Unapologetically fruity.\n- [Alirio Ortega (Colombian Pacamara)](https://www.subtext.coffee/collections/filter-coffee-beans/products/alirio-munoz-ortega-washed-pacamara): also juicy, though a bit fresher and underdeveloped.\n- **Sebastian Garces (Ecuadorian Enepei)**: still dialing in this one — it exhibits some of those less desirable roasty/earthy qualities I've occasionally experienced from Ecuadorian coffees. Hopefully I'll get it right soon!\n\nI think I'm finally learning that 1) I'm not *generally* a huge fan of geshas (too delicate) and 2) I'm not the biggest fan of Ecuadorian coffees (with exceptions) and 3) \"boring\" washed Colombian coffees rarely disappoint me (because they're juicy and vibrant) :D",
    "sentiment": 0.9698,
    "title": "[MOD] What have you been brewing this week?/ Coffee bean recommendations",
    "url": "https://www.reddit.com/r/Coffee/comments/1jgm7sj/mod_what_have_you_been_brewing_this_week_coffee/"
  },
  {
    "keyword": "colombia",
    "text": "[bw jhoan vergara](https://www.blackwhiteroasters.com/products/r-jhoan-vergara-red-bourbon?variant=50425626919225) looks up your alley but slightly dark for my tastes\n\n[sw lychee coferment](https://www.swroasting.coffee/product/colombia-la-divisa-pink-bourbon-lychee-co-ferment/103?cp=true&sa=false&sbp=false&q=false&category_id=2) is a banger although different from what your looking for, presentation will definitely be more light/sparkly than rich and malty\n\n[counterculture rwanda](https://counterculturecoffee.com/pages/gem-series) this one possibly looks like a really good match",
    "sentiment": 0.9568,
    "title": "Dark Roast with red fruits/cherry, berry notes?",
    "url": "https://www.reddit.com/r/pourover/comments/1jo320p/dark_roast_with_red_fruitscherry_berry_notes/"
  },
  {
    "keyword": "colombia",
    "text": "Not a critique of the coffee, but what’s even going on with processing these days? Never heard of «tropical nectar» before. The description on their website is not that helpful either. They’re «extracting microorganisms»?\n[Link to coffee](https://goat-story.com/products/colombia-monteblanco-rodrigo-sanchez-nectar-tropical?_pos=1&_psq=monteblanxo&_ss=e&_v=1.0&variant=49984738689355)",
    "sentiment": -0.5481,
    "title": "Love this coffee",
    "url": "https://www.reddit.com/r/pourover/comments/1jnz3d3/love_this_coffee/"
  },
  {
    "keyword": "colombia",
    "text": "Just coming back from a 2 week trip around Taiwan and echo the statement. I was surprised and impressed by the quality of coffee there. Also just the abundance of great coffee shops and the pour over selection. Coming from the UK coffee shops are still very much espresso dominated and my local places (not based in London) have maybe 3 different beans on offer for pour over if I'm lucky. I think my favourite was Rufous in Taipei but I also just enjoyed the atmosphere and decor there. Had a super floral Colombian coffee there. Also the abundance of Geisha on offer, went to a random breakfast place in Kaohsiung and they served a great Geisha as pour over with some nice savoury kimchi pancakes. \nThe coffee beans from Taiwan I was able to try as pour over were also very good but found them quite expensive so didn't end up buying any (got some Oolong tea from Taiwan instead). Haven't been to Japan recently so can't compare it to the coffee culture there but compared to the UK it's so much better",
    "sentiment": 0.9888,
    "title": "Taiwan coffee bean pickups 🇹🇼 + brief thoughts on Taiwan pourover culture ",
    "url": "https://www.reddit.com/r/pourover/comments/1i0xgra/taiwan_coffee_bean_pickups_brief_thoughts_on/"
  },
  {
    "keyword": "colombia",
    "text": "Beans within arabica can vary between varietals... even in the Geisha category (and whether it's from Panama, Ethiopia, Colombia matters)\n\nI know that Panamaian Geishas are one the largest beans.\n\nEthiopia beans (non-geisha) like the JARC 74158 variety is one the smallest beans... and guess you had an Ethiopian Geisha which are also small.\n\nI've had an Oma/Gesha Village Ethiopian and indeed it's small but very aromatic/fruity",
    "sentiment": 0.1901,
    "title": "This is special",
    "url": "https://www.reddit.com/r/pourover/comments/1jnoo87/this_is_special/"
  },
  {
    "keyword": "colombia",
    "text": "Mine is 04.03.25. Tastes like a decent Colombian, no spices.",
    "sentiment": 0.0772,
    "title": "Looking for recipe suggestions!",
    "url": "https://www.reddit.com/r/pourover/comments/1jng7jy/looking_for_recipe_suggestions/"
  },
  {
    "keyword": "colombia",
    "text": "I’ve been trying to dial in the Colombia, how do you make it?",
    "sentiment": 0.0,
    "title": "This is a banger",
    "url": "https://www.reddit.com/r/pourover/comments/1jmkcvk/this_is_a_banger/"
  },
  {
    "keyword": "colombia",
    "text": "I'm new to light roast and just starting to dip a toe into locally available beans.  Just grabbed a bag from Futura for the first time.  I went with their Love Blend to see how their daily production coffee is.  I like it in the aeropress so far and will try it pourover soon.  \n\n15 grams beans, fine-ish grind, about 4 minute inverted with 209\\* water, 40 second +/- press.\n\n\"A complex blend, offering sweet red fruits and chocolate flavors. Composed of natural-processed traditional varieties from the Panama highlands and complemented with a bright and elegant Colombian from the Tolima region.\"",
    "sentiment": 0.9403,
    "title": "Weekly Bean Review Thread: What have you been brewing this week? -- Week of March 27, 2025",
    "url": "https://www.reddit.com/r/pourover/comments/1jl19hq/weekly_bean_review_thread_what_have_you_been/"
  },
  {
    "keyword": "colombia",
    "text": "In most cases, it’s helpful to think of them as if they are — if the flavors present in a cup are the “what” of the coffee, body can be thought of as the “how” that “what” is distributed across the palate. That said, I’d suggest it’s relative to the expectations of what clarity means for that specific coffee. With a thermal shock wine yeast anaerobic pink bourbon from wilton benitez, one might have a very clear sense that it tastes like strawberry yogurt and rhubarb and thereby conclude it to be a high clarity presentation of those flavors, but with a washed colombian coffee from Prodigal, clarity would present in a way that’s less based on the intensity of flavor distinction than the fleeting complexity that its lighter body allows for and makes possible",
    "sentiment": 0.8473,
    "title": "is body and clarity mutually exclusive?",
    "url": "https://www.reddit.com/r/pourover/comments/1jn45hs/is_body_and_clarity_mutually_exclusive/"
  }
]