[
  {
    "keyword": "bitter",
    "category": "flavor",
    "examples": [
      "Coffee is bitter. You can't literally remove the natural bitterness of coffee. When we say bitterness in coffee, we are talking about an additional layer of astringency and very unpleasant bitterness that can be caused by brewing errors or problems with the green coffee or how it was roasted. Some will be less bitter than others, or some will have a lot more natural sweetness or acidity that covers the bitterness, and of course the roast level will affect the bitterness (the darker it is, the more bitter it will be) but overall, it's pretty much undeniable that coffee is a bitter liquid.\n\nWhen you learn to taste coffee, eventually you get used to the natural bitterness and start focusing on the other flavors present. This is especially true when you begin to [comparatively taste coffees](https://youtu.be/cSEgP4VNynQ).\n\nThe best thing you can do right now is probably get better, fresh coffees from a reputable third-wave roaster near you and try brewing with that and start building your palette. After that, it'd be upgrading the grinder.\n\nLastly, The one thing I tell all beginners to the specialty coffee world to get them hooked is to try finding a naturally processed Ethiopian coffee, one where the tasting notes say something like \"fruit bomb, blueberries\" or something to that effect. Coffees like that are the best introduction into the world of \"coffee that doesn't take like 'coffee'\" IMO.",
      "Some bitterness is intrinsic to any roasted coffee bean. Roasting temperatures [convert](https://pubs.acs.org/doi/abs/10.1021/jf9044606) caffeoyl quinic acids to bitter tasting [caffeoyl quinides](https://link.springer.com/article/10.1007/s00217-005-0143-6) and vinylcatechol oligomers. Lighter roasts will have more of the caffeoyl quinic precursors, and these either mask or [decrease the perceived bitterness](https://www.sciencedirect.com/science/article/abs/pii/S0308814621002296).\n\nThe bitter compounds typically have slower dissolution rates than those responsible for sour, sweet, and aromatic qualities, so one can reduce their relative proportion with shorter extraction times or a lower water:grinds ratio. Lower extraction temperatures also reduce the dissolution rates of some bittering compounds *relative to* other flavor compounds, which is why darker roasts with more of them, and less of their precursors, are commonly brewed at lower temperatures (80 °C / 176 °F to 90 °C / 194 °F).",
      "An old established technique:  a few grains of salt in your cup (should not be enough to taste) will trick your taste buds into not tasting any bitterness.  OR you can try grinding coarser to the point of sourness.  This also works.",
      "Try a cold brew.  I find it much less bitter, almost sweet.",
      "Bitterness is a major flavor component of coffee. It is essential to balance, and should *be* balanced itself, but never removed entirely. Some methods that result in less bitterness are cold brew and short extraction espresso.",
      "Sprinkle in a SMALL dose of kosher salt flakes. Like, just wet the tip of your finger and dip it in some salt. This removes the bitterness.",
      "Unable to completely remove. But there is no need to. There is a point where innate sweetness & complexity becomes so prevalent that bitterness is a only reduced to small part of the drink, making it very enjoyable to drink.",
      "Aeropress will make a less better coffee. Personally I don't mind the bitterness, it's too much acidity that I don't want.",
      "definitely can brew coffee / pull espresso where bitterness is virtually not part of the taste profile at all",
      "I barely notice any bitterness in my coffee anymore, particularly when I make it at home where I'm using good technique and high quality light roasted beans.",
      "I pretty much only drink black coffee and I prefer dark roasts. My tolerance for bitterness has definitely gone up over time, but having said that, strong coffee still shouldn’t be super bitter if it was brewed correctly and with good quality beans.",
      "I like sweet coffee because I have the need to be the bitter one in this relationship.",
      "My dad always drank his coffee black (Folgers from a cheap pot) and when I was little I would try a sip now and then.  I always loved the smell, but everytime I tried it it was awful…thin and bitter is how I remember it.  I turned me off from coffee and I was always a Coke/Diet Coke drinker throughout my childhood and early/mid 20s.  I had no desire to drink coffee due to how I remembered it tasting as a kid.\n\nWhen I was about 26 or 27 I was working one winter night.  It was about 3 in the morning and snowing.  I stopped at a gas station to get gas and something to drink.  I was freezing as I pumped gas and I remember thinking “I’m not going to go in here and get a cold Coke, I’m going to start drinking coffee.”  So I went in, got a small black coffee, and tried to sip on it and choke down as much as I could.  I probably took three drinks and ended up throwing it out.  It was that same watery, bitterness I remembered as a kid.  But I did it again the next night.  And the next.  And the next.  After about a week I actually started looking forward to my nightly cup of coffee and I was able to drink most of it.  I kept doing and after a couple of weeks I grew to like the taste.  I stopped perceiving any bitterness whatsoever.  \n\nThen I bought my own coffee maker.  Then a grinder.  Then started buying better beans.  Then I got a French press.  Then pour over equipment.  Then a better grinder.  And on and on and on.  I’m in my late 30s now and I’ve been a black coffee drinker ever since.",
      "I think most people go through this. Similar to alcohol. The cream and sugar are like training wheels to get you accustomed to the taste. You ween off it as you develop more of a taste for the coffee. I think also as we get older, out taste changes and we can handle or even prefer bitter more. This is a generalization, of course.\n\nEdit - there's also \"good bitter\" and \"bad bitter\". Coffee will always have a bitter element, but sometimes bitter is enjoyable. Bad bitter comes from crappy, cheap coffee and no matter how well it's brewed, it still tastes like bong water filtered through butt hole. Using quality coffee and brewing it properly is almost a complete new drink. And there's so much variety in coffee that if all you've had is big brand stuff you'd never have known existed. These nuanced and complex flavors can't really be detected if your coffee is loaded with cream and sugar (a little is okay).",
      "Bitter? We only drink sour coffee here.",
      "About 8 yrs ago I totally gave up sodas (diet cokes, cokes, etc).  I started drinking coffee...occasionally first with a little sugar/cream but quickly transitioned to black only.  I love black coffee now and enjoy the bitterness of dark roasts (personal preference).  Once I gave up the sweet and artificial sweetened sodas I craved the strong black coffee.",
      "No, I simply stopped buying bitter coffees. Light roasts ftw.",
      "I mean coffee is always going to be on the spectrum of astringent/bitter and acidic by its nature and the compounds it contains.\n\nA balanced extraction to your tastes just keeps all the different flavours from overpowering each other. Really bitter or really acidic is usually a coffee/extraction issue. But coffee is...coffee. Just like cocoa products are cocoas, etc.\n\nThere is also the issue of palate/genetics. Not everyone tastes the same or finds the same flavours pleasant. You may or may not be someone who likes coffee, no matter how good the beans and the extraction are. But bad coffee is also just very bad.",
      "Specialty coffee is a world apart from retail coffee and Starbucks!\n\nI think you'll find that it's a lot less offensive than cheap black coffee, and can be very sweet or smooth. Bitterness and offputting acidity is really characteristic of either lower end coffee or a bad brew.\n\nWould totally recommend going to a local specialty coffee shop (if you have one nearby) and trying a pourover there and see if it is something you could see yourself enjoying.\n\nIf so, then the hobby itself is super rewarding and would highly reccomend!",
      "Yes and no, since our personal experience with taste varies from person to person, but also from bean to bean, and roast to roast. \n\nAddressing the \"no\" first: at some point, regular drinkers will be acclimated to the slight bitterness that nearly all coffee has and it becomes sort of an unnoticed note. If the coffee is darkly roasted however, there is pretty much always at least a hint of bitterness that is a result of the roasting process, but properly brewed (and roasted within reason), there is a complexity to it that can be noticed. Typically speaking, these come in the form of nutty, dark chocolatey, toffee notes, and somtimes described as smooth or full-bodied. So, \"no\", there is always that bitterness, but we 1) get used to it, and 2) can acquire a taste for it, to notice more nuances.\n\nAnd the more exciting aspect to me: \"yes\", coffee can be far from bitter. This is typically the style of modern specialty coffee, where lightly roasted coffee reigns supreme. These coffees are light roasted, up to a medium-light roast (usually), to highlight the character of the bean itself: its origins, variety, and fermentation/washing processes. You'll often see specialty coffee contain much more information than any coffee that you see at a large supermarket. Anyways, this all allows the characteristics of the bean to shine, where we can really play with the compounds that aren't broken down by the roasting process. This preserves many interesting tastes and aromas that roasting would otherwise destroy, which can create the experience of fruity, acidic, sweet, and/or floral notes. So while there is no actual sugar in the resulting brew, the compounds present and the acidity of the drink will present a very different experience than the coffee that you get from a global chain like Starbucks or Mcdonalds. \n\nIn terms of getting started with accessing these neat flavour profiles, I'd suggest using google maps and just look up \"specialty coffee\" near you. It's still somewhat of a hipster culture, although quickly becoming less niche, so anywhere known for that will likely have a decent shop or two. Look for a light roast coffee with intriguing tasting notes, perhaps fruity by your description, and have it black as an americano, pourover, or long black. If you really want to avoid bitterness, you can try it as a milk drink, like a latte or flat white, but you will also be heavily suppressing the fruity notes available. Do not have something sweet with it, as that may not contrast well with tasting the coffee for what it is; you're free to do so in general, but it won't taste like what it should be. Something nearly neutral but savoury like a butter croissant would do well if you wanted a backup chaser."
    ],
    "size": 20
  },
  {
    "keyword": "sweet",
    "category": "flavor",
    "examples": [
      "This might not be a huge improvement over sweets nutritionally, but warm, crusty bread with coffee is my favorite. Even moreso than sweets. \n\nThere are also these Lebanese sesame seed bread sticks called *kaak* you can find in Arabic markets that are excellent dipped in coffee.",
      "Dark chocolate (70% - 85%) isn't terribly sweet and a small amount is very satisfying. Cheese is also a good match for coffee.\n\n(Mostly drink coffee with a bit of cream and no sugar.)",
      "I would sacrifice a sweet during another part of the day so I could enjoy one with coffee. Even just a single square of dark chocolate is nice and isn't THAT much sugar.",
      "Black coffee does not go well with super sweet things, eggs, spicy.\n\nBut a mildly sweet buttery pastry is heaven with medium/dark roast.\n\nWith a light roast bright coffee I definitely prefer no food.",
      "On a related note, I can’t eat dessert without coffee. Sweets are too cloying for me, and I think the way coffee clings to the palate cuts the sweetness.",
      "You could try going to a Starbucks or proper coffeehouse and try unsweetened cold brew or nitrobrew (or iced coffee).  If it's too much at first,.slowly add cream/sugar as needed, then wean yourself back to black to save calories.",
      "Are you set on ordering and not making? I loved iced coffee but agree it can be hard to get the milk/sweetness ratio you want. My wife got me a very inexpensive cold brew maker for Father's day and I love it! So easy to make and ready to go in the morning. Another great option.",
      "I love ordering an iced coffee with soy milk and no classic syrup “no sugar” from Starbucks. It’s creamy and smooth but unsweetened.",
      "\"Milky with a little sugar but not 200 calories\" is going to be any coffee _not at McDonald's_. Though keep in mind, you can order McDonald's iced coffee unsweetened. It's not bad. \n\nBut I'll echo what others said, get an iced coffee from elsewhere. Get a medium iced coffee from Starbucks and ask for one pump of any flavor. I like caramel or hazelnut. \"Medium iced coffee, 2% milk, one pump of hazelnut\". It's the PERFECT *just a little bit sweet* and it'll be ~80 calories.",
      "As tenchi4u said, try Starbucks's cold brew. It's great, and it comes unsweetened by default. It's got a nice natural sweetness to it. Zero calories. Their regular iced coffee is OK, but it isn't as good as the cold brew.\n\nIf you decide you like it, you could get into cold brewing at home. It isn't too hard and if you use preground coffee, it can be pretty cheap.",
      "I agree totally agree with the other suggestions here, but I’d also add that if you liked the flavored drink, you can always ask for 1 or 2 pumps of syrup. That will be about half as sweet or less than the regular drink. I usually do unsweetened cold brew, but sometimes I feel like having a little flavor. Like you, I can’t drink the it the standard way they make it either, way too sugary.",
      "I also got a chance to go to glitch and it was amazing. I was on a work trip so I was able to use my company card as my lunch that day. \n\nDid a sampling of three and they were life changingly (coffee life) good. My favorite had this really subtle sweetness and tasted like melon. I’ve been chasing that ever since! I think it was a Colombia Monteblanco. \n\nI asked for their recipe and they brew at 86 degrees C and a 17.3 ratio.",
      "In my experience Ethiopian coffee doesn’t really taste sweet even though it has that blueberry flavor.",
      "\"Sweet\" in coffee doesn't really refer to apparent sweetness like you'd get in other foods like fresh fruit; it's more subtle. Flavors in coffee that make me think \"sweet\" include fresh fruit flavors (like blueberry), florality, jam, etc., but I don't go in expecting something like white sugar or simple syrup.\n\nIf you're a beer person, hazy IPAs often present as sweet because of their heavy body and fruit flavors, but actual sugar concentration in the beverage is low unless it's sweetened with a non-fermentable (like lactose).",
      "In my experience, natural Ethiopian is easier to brew using full immersion method. I can get sweetness from it. With filter brew, the acidity tends to come out more than the sweetness.",
      "It can be sweet. But it depends on the bean and the brewing process. I hesitate to say it *should* be sweet.\n\nBut for me, getting the right balance of acidity and sweetness is the mark of a perfect cup. It’s hard to achieve, and even harder to repeat.  It also depends on how saturated your palate is. I can make 2 cups exactly the same way and only get the sweetness on the first cup.\n\nI often only get 1 or 2 *sweet* cups from a particular bag, and it’s usually the first one, or perhaps the first one dialed in.\n\nYour palate is relative and constantly changing. If it were easy to get that perfect cup, it wouldn’t be a hobby for so many people :)",
      "I currently have a single origin Ethiopia Sidamo Chuchu, and it is a very strong blueberry flavor , but it also tastes like peanut butter and jelly. In fact it’s almost crazy how much it smells like pb&j even tho that is a jammy sweet fruit flavor it isn’t sweet. Like you’re saying it’s not sweet but it’s also not bitter, sour, but it all tastes great",
      "Most light roasts were more tart and very fragrant. If you're looking for sweetness, personally I've had more luck with coffees in the medium roast. That's where sugars start to develop and caramelize. The coffee will lose its fruitiness but you get the caramel and chocolate noes coming through.",
      "I find Ethiopian coffees pretty 'jammy'. like indistinct berry flavors with a mouthfeel like a jammy wine. Aeropress can really help bring out the sweetness in them.",
      "I've found that, unless something specifically has fresh blueberries in it, blueberry flavors are actually not very sweet at all. You'll get the faint natural sweetness of the coffee from some varietals, but even tea I've had with dried blueberries in it didn't run particularly sweet--it was dry, brightly acidic, and tasted strongly of blueberries, but it wasn't very sweet.\n\nI'm sure some brewing processes will bring out more natural sweetness, but otherwise blueberry aroma and flavor without the sweetness seems par for the course."
    ],
    "size": 20
  },
  {
    "keyword": "acidity",
    "category": "flavor",
    "examples": [
      "Higher temperature water is supposed to reduce acidity and/or highlight bitter taste to cancel acidity.  Do it near 205 or higher.",
      "Cold Brew will create the least amount of acidity out of any other methods. Also you may be interested in attempting to brew with various waters. Idk if you brew with tap but try brewing with water that is more alkaline in nature.",
      "Kenyan coffees are famous for bright acidity and fruity flavors. If the coffee is upsetting your stomach you may want to try using filtered water opposed to tap water, if not using that already.\n\nAlkaline water can sometimes help with the uncomfortable effects of coffee, but note that this coffee is meant to taste more acidic. \n\nSince it’s finely ground you may want to stick to the Aeropress. Consider using cold water and the inverted method (turning it upside down, plunger in the appropriate side, and stick the plastic end in a mug to keep it standing). Use 16g coffee to 238g water. Add water to coffee in the Aeropress. Stir and let sit for one minute. Add the cap and filter. Turn over and use a cup to catch the coffee, slowly press the plunger. \n\nHeat and short contact can make it bitter. Heat and extended contact time can over extract and cause too many fines in the brew. The cold water and relatively low contact time with the inverted method should give you a nice balance.",
      "This thread is giving me life. I grew up drinking espresso in Italy which is rarely acidic, especially in the form or a cappuccino. I can’t stand all of these American roasters pushing fruity/acidic coffee. I now live in an American city that prides itself of its coffee but everything I try is garbage because it’s super acidic even when made as a cappuccino. I find myself preferring Starbucks’ espresso to all of the bougie coffee shops around me because I can’t stand the acidity. Glad to hear I’m not alone!",
      "The fruity/acidic flavours usually come from the drying process. Specifically, beans dried with the 'natural' process will tend to be more fruity/acidic because the beans ferment in the cherry during the drying process and absorb some of the acid from the cherry.\n\nAlthough different regions do have an impact on acidity, the drying process is much more influential - look for beans that are 'washed', 'wet' or do NOT have 'natural' or 'dry' in their name.",
      "2 min constant stirring and 10 min steep at very fine grind - not sure how this can come out underextracted. Moreover, when the extractions is this high cup becomes sweeter, presonally i dont find high acidity when agitating a lot / steeping for long. Maybe you are just not used to acidity, yeah. It can be shoking at first. Also you might wanna read about sourness vs acidity in coffee.",
      "Short answer: no. Like what you like. But also what sort of fruit do you like? A lot of fruits have a varied amount of acidity, apples, oranges, strawberries all have acidity and different types. Do you enjoy these types of fruits?",
      "Just pick the beans that are less sour such as Brazil or Sumatran beans. Medium or dark roast and aim for ratios above 2. This should eliminate any acidity. \nIf espresso still tastes too strong , then adding frothed milk will add more sweetness.",
      "Acidic is different than sour.\n\nMost people love vinaigrette dressing and hate licking a lemon. A good espresso is the former, an under-extracted coffee is the latter.\n\nBut at the same time, some people just don't like vinegrettes. That's fine too. Preferences are different, and some people are more sensitive to certain flavors.\n\nSo, experiment to make sure you're not underextracting. And if you still don't like it, then you just don't like acidity.",
      "Good post, but I want to elaborate on a few other details I see needing discussion and clarification in these threads.  \n\n**Caffeine is the primary cause for \"acid\" problems related to coffee consumption.**  Pretty much directly resulting from that, though: there's no good way to use coffee as your primary caffeine delivery vehicle that cuts out the \"acid\" part.  \n\n**Switching to decaf is the most impactful change you can make.**  Otherwise, follow the advice above about \"reducing\" impacts and symptoms - then start getting used to the consequences of drinking what you love.  We won't judge, whatever you pick.  \n\n**\"Acidity\" in coffee is a red herring** - simply enough, all coffee is effectively the same pH - *less* acidic than a typical tomato sauce.  There's no \"low\" or \"high\" acid coffees, and how sour or sharp the coffee tastes does not play any role in that unchanging pH. \n\nWhich explains the cause to your comment that\n\n>Unfortunately most information about coffee with decreased acid is only based on stories, anecdotes, and personal experience. Not much data going around.\n\n...It's not that there's \"not much data\" - it's that the data provides no hard answers and people really want more concrete things to believe in.  All the \"real\" data says \"it's all the same\" and then it fails to go around[^*](https://www.reddit.com/r/Coffee/comments/8mmbwa/coffee_and_stomach_acid_a_comprehensive_guide/dzotuwr/ \"The difficulty of publishing a null result is independently well-documented, being a positive result itself.\") because folks would prefer the myths that offer Answers That Will Help Them.  \n\n**The \"Acidity\" coffee nerds talk about is not the same as chemical acidity.**  In that sense, they are talking about the impact of tastes that derive from chemical \"acids\", but many of those cause human-perceptible taste impacts at incredibly small doses, so a coffee having more or less \"acidic notes\" does not necessarily have more of those acids - just that they play a larger role in the sum taste.  \n\n>Light roast is generally more acidic than dark roast. \n\nSo the above paragraph is the nugget of truth that the above line draws from - light roasts do have a \"more acidic\" taste profile.  They are not however any different in pH than any other brewed coffee. \n\n>Decaf coffee still had enough trace of coffee to cause relaxation of the sphincter\n\nIt depends which decaf you're buying, TBH.  00.1% of the beans' original caffeine content is treated as below human response thresholds barring specific medication interactions and some very extreme medical sensitivities.  I don't know if digestive sphincters are simply more sensitive than every other aspect of typical bodies' interactions with caffeine, but if they are not - something like a SWP that assures 99.9% removal will bypass this aspect.",
      "Medium and dark roasts lessen the perception of acidity, which may or may not reduce the actual acidity. IMHO Brazilian coffees would be an easy bet for the profile you’re looking for. Also look for most roasters’ “house blend.” These coffees tend to be crowd pleasers, medium to medium+, easy drinking, not super complex and lean toward caramel, cocoa and nutty notes. These are\nMajor generalizations.",
      "There is a whole boatload of misinformation here. \n\nLook for lower elevation coffees which won't accentuate brighter notes as much.  You're going to be sticking to a lot more central and south american coffees than African as a VERY general rule, but even some Colombia's can be super high elevation and also high acidity coffees.  There' no exact rule for it.",
      "I end up with canker sores when I drink high acid coffee.  Ethiopian yirgochaffe is the worst.  I roast my own coffee so roast them darker to help.  Also so far I’ve found Brazil, Sumatra and Nicaraguan to be the best for me but before I buy beans I always make sure they are grown at lower elevations... less than 4000 feet.\nI know higher acidity and light roast is the preference for many right now but they don’t even taste good to me because I can feel the tingle from their acid and I know that will turn into canker sores.",
      "you can try Monsooned Malabar from India. Although it has some divisive opinions, it is known for very low acidity. Might just be your thing",
      "Another thing some people have missed is that a lot of acidity can come from overdosing your coffee and under extracting it.  If you are using a lot of coffee for the amount of water, or if you arent extracting it well (think: too course grind size, low temp water, not long enough brew times etc) you can end up with acidity regardless of the coffee and roast profile. Typically the acids in a coffee are extracted first, so if you want the sweetness and even some bitterness to balance that out you want to make sure you are properly extracting your coffee.",
      "Anything in cold brew.\n\nAcidity isn't necessarily inherent to specific coffee, I mean, it can be, but brewing method matters a lot.",
      "I think the thought is that a larger pour creates more water pressure and a higher flow-rate through the beans, which emphasizes acidity.",
      "It is documented that larger blooms tend to cause more acidity and a lower overall extraction. I think that this concept has been extrapolated into the pseudoscience of the 4:6 method.",
      "Does this coffee have the acidity your looking for? You won't be able to pull out things that aren't there unless you want to underextract and get sour or overextract and get bitter.\n\nNot all Ethiopian coffee is bright or roasted to accentuate brightness.",
      "I’ve got a feeling it’s your grinder but I would actually decrease the magnesium in the water. The less minerals in the water, the more acidity can get through. Try diluting your water with RO/distilled water and go from there"
    ],
    "size": 20
  },
  {
    "keyword": "fruity",
    "category": "flavor",
    "examples": [
      "I'm a big fan of medium roasts which aren't overly acidic but have some fruity flavours. Basically, the light roasts let people appreciate the actual origin characteristics of the coffee more, so they're basically sought after. People have developed a taste for it and like it, and that's what specialty coffee chains then continue to cater to the demands. \nPersonally, I don't mind the occasional light roast, but my everyday go to is medium, with browner tasting notes.",
      "Opposite for me. I wish I'd get fruity coffe outside my home.",
      "As someone that owns coffee shops, I can comment on this. We originally had what I would call an Italian style coffee, which was my personal preference, was convinced by a supplier to try a lighter roast, something that I would have called fruity. Instantly customers noticed and all the comments were positive.\n\nI personally didn't really like the lighter roast when we first got it but after a couple of days I did a complete 180 and could never ever go back",
      "Oh my God thank you. Almost the entirety of Manchester prides itself on selling watery fruity shite, I hate it! There are about three coffee shops that sell nice coffee.",
      "Most single origin coffees will list their tasting notes, with Ethiopian coffees being renowned for their fruity flavors.  You also want to look for bright acidity or citrusy tasting notes, as those are the characteristics that lead to \"fruity\" coffees.",
      "I think a good rule of thumb would be to look for something that's:  \n\n\n1. Light roasted\n2. Naturally processed (and nowadays, some fancier 'new' processes like anaerobic fermentation can also yield quite fruity results)\n3. Look for descriptors like 'orange, berries, apple,' or other berry and citrus fruits, which probably indicate that the beans have good acidity. Conversely, descriptors like chocolate, nutty, floral, etc., suggest that the beans are likely not very acidic.",
      "I love fruity naturals! Tropical Weather by onyx is my current favorite. It’s a blend of washed and natural Ethiopians.\n\nhttps://onyxcoffeelab.com/products/tropical-weather?variant=31862710173794",
      "Black & White coffee roasters have amazing fruity coffee,  it's seasonal so i am not sure if they have it in stock but last year i tried their \"Hazy Juicy IPA\" and it had such an intense smell and taste of pineapple , i loved it. \n\nThey have loads of other great selections there too, i'd start there.\n\n\nProud Mary coffee is also another good one to check out, they have a lot of good coffee also. \n\n\nEthiopian light roasts also tend to have a lot of fruity notes.\n\n\n\nhope this helps",
      "Everyone else has given great recommendations; I'm not going to give a specific recommendation, but rather assure you of something:\n\n>It doesn’t have that like signature “burnt” flavor coffee has.\n\nThat flavour is, as you're discovering, absolutely not inherent to coffee. Harsh, ashy, burnt notes are associated with very darkly roasted coffee. Coffee roasted lightly is rarely if ever going to taste that way, because those flavours typically come from the roast rather than coming from the coffee itself. The only reason those flavours feel so omnipresent is because commercial coffee tends to be pretty darkly roasted (fairly medium roasts are often sold as \"light\", and the roast only gets darker from there).\n\nBut coffee doesn't have to taste like that! And, in fact, most specialty coffee doesn't, because coffee nerds tend to agree with you - fruity coffee tastes good, and ashy coffee tastes bad. As such, basically any good third wave roaster will have fruity-tasting coffee in stock (and even specialty coffee that doesn't taste specifically fruity is rarely going to taste harsh or burnt).\n\nMy point being: Please don't worry about running out of fruity coffee. You haven't stumbled onto a rare and unreplaceable exception. The flavour profile you've discovered is what high-quality coffee very often tastes like. There's a ton of it out there. You're not going to lose access to it anytime soon.",
      "Ooh. When it comes to fruit flavors in your coffee, you want to focus on two things: processing, and roast. \n\nYou'll always want to go for a light roasted coffee, as this will allow the natural flavors of the coffee bean to shine through, with less of the smoky burnt flavors from the roaster. \n\nAs for processing, I'm going to just hit the basic points. But the biggest reason this coffee you got in particular is so fruity is the fact it's a natural process. Meaning, the beans were dried inside their fruit, and then the fruit was removed later. There is a certain amount of natural fermentation present, and some of the acid of the coffee fruit is able to soak more solidly in the coffee bean, and survive through the roasting process and eventually into your cup. \n\nBelow are the usual coffee processing methods from least to most fruity. The only real difference between them is how long and how the coffee bean stays in contact with the coffee fruit between the field and the roaster. Of course there are always exceptions, but this is generally speaking, the lineup:\n\nWashed, white/yellow/red/black honey, natural, anaerobic. \n\nIf you're looking for a fruity, funky cup, go natural or anaerobic. If you get in the mood for something with more directness and clean clarity, go for a lighter honey process or a washed coffee.",
      "I've been keeping an onyx coffee journal and here's what I've had so far. These are my notes completely blind, so I didnt actually look at the flavor notes\n__________________\nPanama Creativa Giovanna Boutet Anaerobic |\n-pourover - 6.5/10\nAcidity: 7/10 | Bitterness: 1/10 | Body: juicy\nChocolate, fermented, very fruity, almost juicy. \n\nGeometry |\nPourover - 8/10\nAcidity: 1/10 | Bitterness: 3/10 | tea-like body\nCherry, tart, raspberry\n\nColombia Aponte Village |\nTurkish coffee - 8/10\nAcidity: 4/10 | Bitterness: 1/10 | super balanced body\nStrawberry jam, moscato grape, cherry, honey\nPourover - 9/10. **My favorite**\n\nTropical Weather |\nTurkish coffee - 7/10\nAcidity: 6/10 | Bitterness: 5/10 | full body\nNectarine, honey, concord grape\n\nMonarch |\nPourover - 5.5/10\nAcidity: 2/10 | Bitterness: 7/10 | Medium body\n\nEl Salvador Santa Rosa Honey |\nPourover: 7/10\nAcidity: 4/10 | Bitterness: 2/10 | full body\nChocolate, soybean paste, dandelion, honey\n\nIf any of them sound interesting to you, definitely check them out. Let us know!!",
      "You’d probably like some of the more experimental low oxygen/anaerobic processed coffees, the extra fermentation brings out a lot of fruity notes.",
      "I've had a Costa Rican honey process that was as fruity as some of the fruitiest Ethiopian naturals. \n\nI roasted Tanzania Peaberry last summer that yielded an incredible raspberry profile.\n\nHigh elevation Colombia with the most cherry forward profile I've found yet. \n\nThey're out there, but Ethiopia beans definitely claim the throne for fruity overall imo.",
      "Anything from Africa is going to be fruity, with Ethiopia and Kenya usually being the brightest, but I've had some terrific fruity, acidic coffees from Colombia and Costa Rica in the past year.",
      "Look for natural processed beans in general. Ethiopian tends to have the fruity flavors because most of them are natural processed rather than washed.",
      "Bali Kintamani can be fruity. It's a natural processed Indonesian. Though it's been a long time since I've had it. It just has a special place in my heart because it was the first time I had coffee that didn't taste like coffee.",
      "I had a Rwanda bean recently that was unsurprisingly comparable to Etheopian beans.  I had a Nicaraguan bean a few months ago that was really fruity too.",
      "I have different experiences than you, it’s actually harder to get a coffee’s that have some fruity notes. Almost every beans that you find on big box stores don’t have this “grapefruit” taste you mentioned. Maybe its your taste bud? Do you hate grapefruit by any chance?",
      "Varietal and process both play a great factor into how the bean looks after roasting. I.e a honey processed bean light roasted will appear darker than a light roasted washed coffee.\n\nAlso, something being roasted lightly doesn't translate to fruity coffee. It *can* mean greater acidity though. I've recently had a fantastic Colombian White Honey Gesha from a roastery in Poland - Super savoury, it was like tomato and basil soup. Point being a super light roasted coffee that wasn't acidic or fruity. Tasted very herby. (in a good way!)\n\nResting time can also depend greatly again depending on the type, process, varietal. I'd say as a rule of thumb at least a week after roast date, especially for lighter stuff. That being said, some can come to life 45 days after roasting. It's always good to speak with the roastery for their recommendations if possible!\n\nIf you're looking for super apparent and interesting notes, I'd recommend looking at some \"co-ferments\" These are coffees that are processed with something such as a fruit to impart those flavours.\n\nHere's one of our coffees as an example. This coffee was processed with strawberry juice, pulp and wine yeast. It makes for a lovely and tangy pour over with some sweet sweet strawberry notes. Or as a flat white it tastes like strawberry milkshake!  \n[https://funkt.coffee/products/finca-la-pradera-strawberry-wine-yeast](https://funkt.coffee/products/finca-la-pradera-strawberry-wine-yeast)\n\nI'd recommend you to grab a few different coffees of varying origins and processes and cup them all side by side! Tasting notes are a lot more apparent when comparatively tasted!\n\n**TL;DR** \\- Roast level is only 1 of many factors that affects the coffees tasting notes. I'd recommend cupping a few different origin/process coffees side by side and exploring coffees such as co-ferments!\n\n\\*Edit to add the below:\n\nQ: Do any roasteries actually nail their tasting notes > 90% of the time? I sure haven't found that to be the case.\n\nWell, yes, but in a completely different environment to you. They're cupping the coffees with their chosen grinder, burrs, grind size, water recipe and brewing/cupping method to you. I can make the same coffee taste wildly different depending on which brewer and grinder I use. i.e You'll struggle to find distinct delicate florals with hard tap water and a rhino hand grinder!",
      "Having roasted lots of beans over the years, I'm inclined to think it's the particular beans. Do you get to see the flavor profile of the available beans? Some are just more fruity."
    ],
    "size": 20
  },
  {
    "keyword": "nutty",
    "category": "flavor",
    "examples": [
      "Generally, roasting darker (toward nutty, caramel, chocolate notes) starts to erase the nuances of a coffee, and these nuances are sort of the whole point for a roaster making the effort to source high quality single origin coffees from various locations around the world. So you typically see them roasted in a way that “brings out the origin,” if you will.\n\nBit of an oversimplification, of course, as different coffees roasted into the chocolatey (not burnt!) spectrum will still taste different from each other — just not nearly to the same extent as with lighter coffees. Also, certain coffees lend themselves more to that spectrum than others — lots of variables go into how a bean is best roasted.\n\nBut typically I (US-based though) find that even coffee shops that mostly do funky/interesting coffees will carry a dark roast and/or espresso blend (which also tends to lean more into that chocolate spectrum)",
      "I think it's because you can find the nutty, caramel, and chocolate notes in lower end coffee shops and there's a lot more of those. If you want other flavors, you go to a higher end shop.",
      "There’s plenty of great quality coffee that is chocolatey and nutty and the good news is that it’s probably a lot cheaper than the really fruity and wild and experimental stuff.\n\nOne route you could go is Red Roosters “The Fix” subscription. I had huge success on their beans from the fruity side but they also will send you chocolate / traditional beans instead of that’s your thing. Two different subscription options.",
      "Guatemalan coffees will fulfill the chocolately portion of your needs but I think you may need something from Mexico to grab both nutty and chocolately from your coffee.",
      "I've found Bourbon varietal coffee is generally chocolatey and Columbia makes some nutty coffee.\n\nYes, most people will answer with an origin, but plant species has an impact.",
      "Sounds like you are looking for a good Brazilian. Possibly Sumatran as well, but I'd look for a Brazilian if I were you. I think Happy Mug has one right now, I'd check there. I'm roasting one of their Brazilians (they ell unroasted and roasted) and it is creamy, nutty and sweet with a nice body. Its the Brazil Daterra.",
      "Actually if you want nutty and toasty, with minimal acidity and fruit, espresso blends can have this. \n\nSomething like [Big Trouble](https://counterculturecoffee.com/store/coffee/big-trouble)\n from counter culture, or really any nutty/toasty espresso blend. Counter Culture actually stopped labeling blends like this espresso because they felt that any coffee can be brewed any way, while most still use this for espresso, some brew it for drip, press, or other ways. I've had it before as drip, and it delivered the nutty toasty, slight chocolate notes, with minimal fruits and fairly low acidity. Not what I personally love, but seems right up your alley.\n\nIf it's moderate acidity in espresso, it's likely low in normal coffee. Hoperfully that will help your search opening a bunch of posiblities.",
      "Have you tried Red Bird's espresso blend, or their Sweet Blue? Both very nutty and amazing!",
      "Nutty/toasting, low acid. Stick to central or south america and buy dark roasts. should be easy to find those.",
      "Try Papua New Guinea coffees. Very nutty yet known for low acidity. Oceania coffees in general are earthy, nutty and tend to have lower acidity than African single origins.\n\nIt also makes sense that slightly darker roasts have less acidity",
      "Philz Tesora blend. It’s incredibly good and very nutty. The chain is local to San Francisco/Bay Area and has an almost cult following. I think they can ship it out.",
      "I just search local coffee roasters around my area where I can buy beans from. I'm lucky enough that I have a few around me that I can try and found some bags that I really like. \n\nI also can't stand fruity coffees, I usually stick towards  nutty or chocolate flavours.",
      "I have a Peru that’s pretty nutty.",
      "BeanBox is a decent subscription for coffees in that flavor range. (mostly seattle based roasters). It's a way to get a smaller sample and higher variety. Then you can buy full bags of stuff you like.\n\nI tend to like medium roast/nutty coffees too. My current favorite coffee though is out of Portland Maine: Speckled Ax's \"Mokha Java\"",
      "South American, especially Brazil, tend to have nutty tones. Medium to medium-dark seem to bring out the most to me in regular coffee. Some Indonesian coffees add a nice nutty finish when put in a blend. My favorite espresso shot I've had was a Indonesian-Brazilian blend with a Vienna roast that tasted a bit like peanut butter.",
      "I’m a small time coffee roaster and my experience is, your South American coffees have nutty flavor over others coffees I’ve bought.",
      "I’m in Honduras (Santa Barbara specifically) and I’m drinking the most nutty black coffee I’ve ever tasted. The beans were cut from the tree about 2-3 weeks ago and was dried then roasted the day before yesterday. This right here is the best coffee I’ve ever had. I was given 2 pounds of this coffee for free.",
      "A lot of espressos (the beans used to make espresso, not an actual shot) have a very nutty flavor you'll notice more when you brew it using other brew methods.",
      "Colombia has that nutty flavor",
      "I recommend Latin American coffees that list things like \"balanced\" \"caramel\" \"cocoa\" or \"almonds\" in the flavor notes, and not ones that list things like \"lemon\" \"bright\" or anything citrus sounding. Darker Latin Americans can tend towards chocolate, while medium latin americans tend toward nutty, just as a general experience I've had -- but everyone tastes things a little different."
    ],
    "size": 20
  },
  {
    "keyword": "creamy",
    "category": "flavor",
    "examples": [
      "Personally, I would rate the Chobani much higher, I have found it to be one of the better \"foaming\" oat milks, but I always buy the Extra Creamy version.",
      "You should try the chobani extra creamy in a white carton. Game changer!",
      "Disappointed with the Planet Oat review, then realized you didn't review the Extra Creamy version! \n\nPlanet Oat extra creamy is my favorite behind Oatly Barista.",
      "I mostly agree with your list but which Chobani did you try? I sort of like the Extra Creamy one as an alternative to Oatly Full Fat when it's out of stock. I think of Pacific I've only tried the non-Barista variant so I'll have to try that one.",
      "If you don't mind the addition of the thickeners to make it creamy, try out Pacific Foods' Barista Series Almond Milk - it seems to be the industry standard.\n\nIf you like the sweetness, I'd try oat milk which seems to be the alt milk closest to the taste and texture of cow's milk.",
      "It depends on the brewing method. A cup of coffee can range from quite creamy (espresso), to very light and almost tea-like (Chemex). The difference is the oils of the beans that get filtered, and, in the case of espresso, the very high pressure at which the water is sent through the grounds.",
      "I'm going to buck the trends in here and guess a combo of particulate solids and [soluble fiber.](http://www.scientificamerican.com/article.cfm?id=need-fiber-have-some-coff)\n\nOils just don't emulsify easily into water without some sort of emulsifier to keep them together, and overall, there isn't that much oil in coffee beans.  Not enough to impart any sort of creaminess to your cup, at least IMO.  Looking it up online, the only coffee emulsion I could find is crema.  But even that is an unstable emulsion formed by pushing high pressure steam through fine grounds.  Not by simply pressing the plunger down on a French press.  Moreover, you can see the oils floating on top of a cup of coffee, which tells me they're not emulsified into the water phase.  So if there ARE emulsifiers in coffee, they're not very powerful ones, and unlikely to be causing any 'creamy' mouthfeel.",
      "Aerolatte is nothing like a real machines steam wand. The closest you can get is the bellman steamer and its still not on the level of a machines steam wand even at Starbucks. Steam wands give you the right texture and microfoam that give that creamy mouthfeel. Espresso also helps with the mouth feel with its viscosity and oils/crema.\n\nAnd Aeropress isn't remotely close to espresso, with that and the Aerolatte your simply not going to make anything like from a shop, just being honest.",
      "Higher milkfat (whole milk, even some half and half) helps.  Also, i will often mix in some Bailey's creamer since they use real cream.  Makes for a little more creamyness.",
      "The calafia contains a little bit of gums. Specifically: \"Sea Salt, Sunflower Lecithin, Locust Bean Gum, Gellan Gum\"  That is why it's creamy.",
      "You haven't put enough gooey chemicals in it yet.\n\nThe creamy feeling is fake.",
      "My personal opinion is that a latte should be both creamy and smooth. Both of those are pretty subjective words though.",
      "I have an Ethiopian French Roast from some carbon negative roaster. Forget their name. It's super super creamy with no milk/cream/anything added!",
      "I suggest you look at Matt Perger's coffee compass. If you find \"buttery\" to be similar to creamy, then maybe it would help :)",
      "Not sure about the type of bean, but it could have been just the fact that it was a freshly roasted, freshly ground beans. That may be something that you are not used to. I wouldn't quite describe my home-roasted coffee creamy, but it is unlike anything I've ever had at Starbucks or Tim Horton's etc.\n\nEdit: I accidentally a letter",
      "I used to drink a vienna roast mexican chiapas from my old coffee roaster that had an extremely creamy feel and taste...I miss it a lot. But a lot of coffees can probably offer this and I think it has something to do with the freshness of the beans and the way it was made (pour over or french press, as opposed to machine drip).",
      "I personally like the Chobani extra creamy.",
      "i'm a barista and i've tried a bunch of oat milks. all the ones i've tried are the barista editions, which i think are the only ones worth using. non-barista editions don't have the necessary gums and stabilizers to foam or taste creamy. pure oat milk is just oat and water, you need additions to make it taste and behave like milk.\n\nhere are my impressions:\n\noatly: B-. decent oat milk. froths well. easy latte art. definitely an unpleasant oat aftertaste keeping it from being my favorite. i think you notice that as well. good choice in a pinch but not the best. very overrated just because they're the first oat milk and the most popular people have tried.\n\nhappy planet: A. really good, better than oatly. less strong of an oat taste than oatly. froths well. creamy and delicious. fully recommend.\n\nplanet oat: B+. tasty! i have the least experience with this one since I didn't try it in my shop but at home. can't comment on how it steams but i enjoyed the flavor well enough.\n\ncalifia farms: D. downright nasty. tastes by far the worst of what i've tried. watery, with a strong unpleasant oat taste. steams terribly. this oat milk was so bad it got me to switch to soy.\n\npacific foods: B-. fine. not the best tasting, but capable of wonderous latte art. fairly similar to oatly in that it has a bit of a nasty aftertaste.\n\nchobani: A+. the real MVP of oat milks. chobani is *very* creamy, you might even want to water it down slightly if that's not your thing. hot or iced, it tastes great, like a high quality whole milk. once a coworker made a drink for me with chobani and i had to verify that they actually used oat milk, because i thought it totally could have been whole. no bad aftertaste, no overbearing oat flavor. it froths well and is capable of good latte art but you won't get as much out of it as oatly or pacific foods. have not compared the barista edition to the extra creamy edition but i imagine they're similar. i like all the oat milks, but chobani is my love. please try it if you have a chance.",
      "I make my own - 1 cup water, 3/4 cup oats, blend a couple pulses, strain. It's very creamy in this ratio. I make this size once a week, because I only use it in coffee. The only caveat is you'll need to stir it a little as you drink it, because the oat milk kind of separates from the coffee. \n\nEasy way to save $$$. One of those big tubes of old fashioned oats costs \\~$5 and will last months.",
      "Nitro makes it foamy, rather than fizzy. It won't register as \"fizzy\" but should have a thicker, silky mouth feel.\n\nCO2 delivers fizz. Dissolved nitrogen produces much smaller bubbles. It's what makes draft Guinness creamy as well (although that is simultaneously slightly carbonated)."
    ],
    "size": 20
  },
  {
    "keyword": "espresso",
    "category": "type",
    "examples": [
      "First off, the people at /r/espresso will tell you that spending a ton of money isn't necessary to get great shots. A ~$1,200 setup will get you great results right out of the box but you can also get excellent shots with an ~$800 setup if you're willing to mod. It's definitely way more expensive than other brew methods and probably out of reach for a lot of people but, in the long run, is way cheaper than buying a latte at your local cafe every day. \n\nHome espresso is going to be way better than anything you can get at a coffee shop the vast majority of the time. The reason for that is pretty simple. The shop can't afford to spend five minutes pulling every shot to make it perfect like you can at home. They don't typically weigh the input or output and will just eyeball it based on a dial-in they made when the shop opened. Espresso, especially light roasts, are less forgiving and eyeballing just doesn't work for straight shots but adding a bunch of milk will usually mask any issues. It's not usually an issue since milk drinks are what the vast majority of people order at cafes.\n\nI'm in NYC and have been to *a lot* of third wave shops all serving amazing beans. There are two places, East One and Sey, that I'd be willing to order straight espresso from and that's because they're the only ones that weigh everything. Every other place that that will consistently give me an amazing milk drink will also give me battery acid if I ask for an espresso.\n\nEspresso is also not \"better\" than any other brew method when it comes to non-milk drinks and I doubt anyone at /r/espresso will tell you otherwise. It's a completely different flavor profile that, for me, typically puts emphasis on the brighter notes. An americano and immersion brew using the same bean will taste completely different.",
      "So to begin with, most shops make terrible espresso.  In all of my travels, there are only two shops I would ever return to.  Remember, most shops are focused on efficiency, consistency, pulling something that will cut through milk and sugar, and doing so at a low cost.  All of these factors contribute to poor quality straight shots, especially with light-medium roasts.  Water chemistry is very important, grinder quality and burr selection is very important, and there is an enormous range of shot styles.  If you're drinking a shot that they pulled in the style for a milk drink (because they're not gonna change grinders or grind sizes or baskets just for you, and then have to change back) - it's not gonna taste nice and sweet and balanced - it's gonna be aggressive.  Based on your love for fruity pourovers, what you are seeking is a long ratio turbo with a little bit of buffer (like 1:3 with 70/20 water) ground on a uniform flat burr - not a blended conical.  Once you have a good one, you'll love it!",
      "I started doing espresso at home like 2 or 3 years ago. I’ve followed every step on videos, books and guides to get a shot of espresso. After achieving what people on the internet call “perfect shot”, I started looking for cafés here and there to compare. It took me 2 years to find a place where they followed the same “rules” as I. The rest was just as harsh and sad as you described.\n\nEspresso is a challenging drink. For is that work with coffee, it is the most difficult yet the most pleasurable experience to find “the right way” of making a shot of espresso. \n\nFor me, that’s why there are so many people obsessed with the drink. It lies on top of a thin line between success and failure and it won’t lie to you about that. \n\nIn the end, espresso is an honest and merciless drink.",
      "Espresso is definitely its own thing. I think it can be an amazing drink, but it is *bad* when its bad, because there's nowhere to hide. Everything is just right in your face dialed up to high intensity. So you can definitely have a bad experience even in some more specialty focused spots.\n\nI do think you should expect it to take some time to develop your palate even with the experience you have tasting pour overs though. Yes, you'll be able to interpret notes sooner because you're already familiar with that way of thinking about taste, but disentangling the tastes in espresso from the flavour punch that it is will need some practice. So I don't think you should make a judgement about how interesting or complex espresso is until you've given it some more time.\n\nThat being said, you might just not like espresso. It is its own drink that offers something unique that is worth chasing for those who do like it, but that might just not be you.\n\nPersonally, I love espresso, and am planning to get a manual machine in the near future, because I love the hands on experience, and from what I can see it gives you a really good cost/quality ratio if you do enjoy the manual process.",
      "ITT: op has never had good light roast espresso before. \n\nI've had my share of bad light, med, and dark roast espresso. Imo it's absolutely necessary to go to a high quality roaster to increase your chances in finding a good light roast espresso. I'm not saying you can't find an independent shop making good light roast, but is say it's about a 25% instance that I get good espresso at a small shop. If I go to a roaster, I found it's around a 75% instance I get a good espresso.",
      "Look I love espresso but I only found 2 or 3 out of 10 espressos in Berlin decent, did not really get satisfactory results in Prague at all, whereas in Vienna every single shot was usable. (Always following whatever is listed in European Coffee Trip app).\n\nTwo reasons come to my mind why had that experience:\n\n1. Many shops don't bother dialing in properly as nobody orders the espresso anyway and everyone gets milk drinks.\n\n2. Or it's a problem that you - like my friend - don't like American coffees. All he can taste with those is sour, whereas African beans, Asian beans he doesn't have the problem. I found that curious because I couldn't really tell a difference between the sour coffee he hated and the coffee he found ok. Maybe it's genetic, like the cilantro soap thing.\n\nDo you have middle/south American beans in your V60 or French Press, does that have a similar sense of overwhelming sourness or did you just stick to like Ethiopian beans?\n\nIf your specialty shop ever has Ethiopian espresso maybe try that.",
      "I'll add another unpopular opinion: a lot of places are still pulling really long shots using modbars and EK43's and their interpretation of a nordic roast, throwing 'all the trendy things' at the method. The result is sour, watery, and Italians would say it's not espresso at all. Add in the difficulty of serving hundreds of god-shots a day in any shop, and it's just hard to do.",
      "Interesting read, honestly. As someone whose not in a place to buy, or even want, an expensive espresso machine I can somewhat relate. (Although I was learning to work with a huge one once and have to say, interesting machines nontheless)\n\njust a small defence for eyballung stuff. Because I enjoy the ritual and the fiddling just as much if not more than a tasty drink in the end. I managed to hit tophe notes in my cold brew set up. Accurately replicating those, or at least me trying to, is a fair bit of the reason why I drink so much cold brew over the summer.\n\nIn the end coffee has to be enjoyable. If espresso doesn't do it for you, don't worry about trying other stuff, I'd say",
      "coffee in general is an acquired taste, there are enough people who find coffee tastes bad.  What you said about espresso, my mom says the same\nthing about any coffee.\n\nAs for espresso, it has a high barriers to entry, both in terms of money and effort.  You can go to the r/espresso channel and see people with expensive machines struggling to pull a good shot.    \n\nI would suggest next time you add water to the an espresso shot, tasting it at different dilution ratio, and see if it starts to taste better for you.  Maybe you are just used to thin bodied drinks with less intense flavours (bitterness/acidity).",
      "Awesome work, I also use those anchor measuring cups for espresso, for 2 bucks they make a great glass!",
      "My man built his own espresso machine and said “hold up I gotta time this beast with a pocket watch” damn dude, vibe on",
      "Pour them into an ice tray and freeze them! Make a smoothie using the espresso cubes, milk, and bananas (and other fun stuff maybe).",
      "A [Moka Pot](https://www.youtube.com/watch?v=BfDLoIvb0w4) is probably what you're thinking of, it's technically not espresso since the pressure is only 1.5bar instead of the typical 9+bar of an espresso machine, but it's very common in Italian households to use a Moka pot in the way you're describing.",
      "Flair or a Cafelet Robot, if you’re looking for actual espresso.  Moka pots make a good, strong cup of coffee.",
      "Moka Pot… or… if you’re feeling a little extra…\n\n9barista - makes real espresso on the stove top https://9barista.com/\n\nBellman - stove top espresso and milk steamer https://bellmanespresso.com/products/bellman-cx25p-complete-bundle",
      "For legitimate espresso, on a budget, that doesn't take up too much space.\n\nThe picopresso is what I would go for.\n\nPrice range is in between mokapot, and flair.\n\nMakes legitimate espresso.\n\nHas no electronics.\n\nIs the most portable legitimate espresso maker.\n\nPair it with a decent grinder like the 1zpresso jx pro and you've got a capable set up for around $200-250.",
      "Old school stove top, you're definitely looking for a Moka Pot. You can evem find them at thrift stores cheap, some vinegar soap and water, and they clean up well. \n\nOtherwise, an Aeropress can make espresso like coffee too, and are ~30-40USD, or you can go for manual espresso with a Flair Neo Flex that are ~100 USD.\n\nThe Neo Flex has a pressurized basket to get closest to espresso without a capable grinder, but an espresso capable grinder is like $80 for the Kingrinder K4 or K6\nSo it's like 30-40USD to get probably pretty dang close to what you want, or like 200USD to get an espresso setup that can use your existing kettle as a hot water/preheat source and not take an outlet.",
      "somewhere a rock collector is wondering how an espresso bean ended up in his pile of stones",
      "Moka pot??  Inexpensive. Will work with your grinder. Not true espresso but it can make some wonderful, rich, dark coffee. We've enjoyed moka pot coffee for years until recently falling down the true espresso rabbit whole.",
      "At your budget, a semi-auto setup won't taste much better than what you can get at Starbucks. See [this post](https://old.reddit.com/r/espresso/comments/e5ctxq/do_i_really_need_to_spend_1000_on_an_espresso/) for more info.\n\nYou might want to consider a Flair Neo. It will work with your Svart, and you can upgrade it to non-pressurized later when you get a better grinder.\n\nBe careful - home espresso is a hobby that has a very deep rabbit hole, and can also lead to divorce 😀"
    ],
    "size": 20
  },
  {
    "keyword": "latte",
    "category": "type",
    "examples": [
      "Starbucks barista here.\n\nThe default Starbucks latte is comprised of espresso shots, steamed milk (2% by default), and a very thin foam head. Nothing else. If you order a regular latte and receive something with syrup in it, the barista fucked up. Starbucks lattes are lattes by definition. However, Starbucks adds a disproportionate amount of milk to espresso when compared to traditional lattes. The closest you'll get to a 1:2 espresso-to-milk ratio (the preferred ratio in this sub, it seems) is if you order a double tall latte (a small latte with two shots--it doesn't fulfill the 1:2 ratio by volume but instead by flavor as our shots are more bitter than one would expect). Anything else and your espresso is swimming in excess milk. Some like it, some don't. But if you, Dear Reader, are among the latter, by no means are you required to stick to the default proportions. Let your barista know your preference, and we'll adjust your drink accordingly.\n\nTo those who dislike the default Starbucks espresso shot and want a latte, I recommend trying a double tall latte ristretto. Our ristretto shots are sweeter with an almost creamy texture--much closer to what one would expect at an Italian coffee shop--and the flavor mixes well with the reduced quantity of milk (from having the extra shot of espresso). A latte even the most discerning Italian connoisseur can enjoy!\n\nSo why do people think lattes come with syrup by default? Because of Starbucks' wonky approach to macchiatos.\n\nCaramel macchiatos (and vanilla m. and hazelnut m.) come with syrup by default, but they receive a pump less syrup at each size compared to lattes (assuming the customer orders syrup in their latte). A grande (medium) vanilla latte has 4 pumps of vanilla syrup. A grande caramel macchiato has 3 pumps of vanilla syrup. The caramel and vanilla and hazelnut prefixes simply refer to the drizzle (yes, a concentrated drizzle) on top of the drink. You cannot get a macchiato at Starbucks without the syrup and drizzle (read: a traditional latte macchiato, not to be confused with a cafe macchiato which is just espresso with a splash of steamed milk and a \"stain\" of light foam on the top) unless you specifically ask for it to be made without those things.\n\nSo what's the difference between a traditional latte and a traditional latte macchiato anyway? They sound very similar. I'm glad you asked! The answer is: very little, actually. A latte is steamed milk poured on top of espresso. A latte macchiato is espresso poured into steamed milk, usually with a lower espresso-to-milk ratio than a latte (read: more milk). Starbucks lattes are lattes, and their latte macchiatos are latte macchiatos; however, Starbucks adds a few things to their latte macchiatos by default that aren't traditional and can be omitted by request.\n\nThe last drink we need to talk about is the cappuccino. Starbucks is again close to the traditional mark, where the cappuccinos are lattes with a much lower milk-to-foam ratio (read: much more foam). Baristas are taught to make a cappuccino with about half the milk of a latte give-or-take and foam the rest of the way up the cup. That tends to unsettle more discerning customers who wish for a stricter approach to cappuccinos, and the easiest remedy is to ask your barista to make the cappuccino dry (less milk, more foam). As with the double tall latte, your best bet for a traditional cappuccino is to get a double tall dry cappuccino.\n\nAll of that is easily dismissed by saying that none of it even matters because Starbucks uses inferior equipment and inferior beans, a qualm I'd like to put to rest before it inevitably crops up. Granted, everything I'm about to say is tangential to the conversation at hand. If you don't really care, it's safe to skip down to the tl;dr.\n\nWhile some stores still have the old La Marzocco or a different Superautomatic (the One Button to Rule Them All espresso machines), most stores now use a Superautomatic variant which is really semi-auto in many ways called the Mastrena. The Mastrena has multiple pull options for espresso shots and an on-the-fly grind change knob; among the options is the choice to queue shots differently. Let's say for example you want a doppio (two shots of espresso). Do you want the beans ground and pulled as a double (the amount of beans needed for two shots of espresso done at the same time)? Do you want the beans ground and pulled as two singles (meaning one shot is ground and pulled, then the second is ground and pulled on top of it)? Do you want one shot pulled default and the other pulled ristretto? Maybe you want a decaf ristretto shot on top of a regular shot or vice-versa? The amount of choice in the shot alone is staggering when you get into it. Sure, baristas are still \"just pushing buttons\" to pull the shots, but we get a higher degree of consistency/accuracy with the same amount of customization you get in your espresso press at home.\n\nBut what about steaming milk? Is that still automatic? It can be if you want it to be. However, the Mastrena sports an adjustable steam wand for better control over the amount and quality of foam, and the machine offers users the ability to manually control the temperature of the steamed milk (for those customers who prefer hotter lattes or want a less hot drink for their children). I can steam milk to the default temperature with the default foam by just turning the wand on and putting it in the pitcher and leaving it, or I can manually steam it to a customer's preferred 130 degrees Fahrenheit and aerate enough milk to spoon out 1.25 inches of quality foam into the drink. As with the espresso shots, the steam wand on the Mastrena offers baristas a higher degree of consistency/accuracy with the same amount of customization you'd find in your milk wand at home.\n\nWhile the beans might not be on par with what's in your top shelf tins at home, the beans are still moderate to moderate-high quality (there's a good reason you're paying almost $5 for a 16 oz. latte), and the machine itself is a dream to use and can produce desirable shots from the Starbucks espresso beans. The stereotype of Starbucks as a purveyor of low quality Superautomatic shots is outdated even if the machine is still predominantly button-controlled.\n\ntl;dr Starbucks does have real lattes (no syrup by default!), but the lattes tend to have more milk than connoisseurs expect. Our cappuccinos tend to have more milk than connoisseurs expect, as well, but that can be remedied by asking for it dry (or wet if you want even more milk and less foam). The real difference is found in the latte macchiatos, but you can get a traditional latte macchiato if you ask for it. Describing Starbucks as the Panda Express of the coffee world, then, is disingenuous at best and derogatory at worst. You can't walk into Panda Express and get a traditional Szechuan chicken dish, but you can walk into Starbucks and get a cappuccino almost identical to one from an old-school Italian shop even if the default cappuccino isn't made that way. I love me some Panda Express, and I'm not the biggest fan of Starbucks coffee, but Starbucks deserves more credit than it gets for the authenticity (despite the faux Italian names for some things) and breadth of its espresso drinks.\n\nEDIT word bandages, made some language clearer.\n\nEDIT TWO I forgot to mention something with regard to Starbucks bean quality in the tangential section of my post. If you have any questions about the beans we use or why we use certain roasting/brewing methods, find a Starbucks partner (we aren't employees, we're partners, which is irksome for various reasons that I won't get into here) with a black apron. Those partners are called Coffee Masters. That sounds silly, I know, but trust me when I say that it is an earned, respectable title. Or don't trust me and read [this excellent blog post](http://www.starbucksmelody.com/2014/02/04/the-starbucks-black-apron-what-is-a-coffee-master/) I found detailing how to become a Coffee Master. It's easy to dismiss Starbucks coffee as being burnt and charred, and to an extent I still agree with those criticisms. However, working alongside a Coffee Master has softened my criticism in that I at least understand why Starbucks does what it does even if it produces a less desirable cup of coffee for my personal tastes.\n\nEDIT THREE /u/21echoes kindly pointed out that my comment discusses *latte* macchiatos with no mention of *cafe* macchiatos. I've edited each mention of macchiatos to reflect that distinction. If you want to know more about cafe macchiatos, read the child comments of this post.",
      "Basically, from what I know, Starbucks just has terrible espresso and they drown their terrible espresso in milk and sugary syrups. A good latte should have a good espresso and good milk with good microfoam. That's it.",
      "At Starbucks, they add so much milk to their cappuccino that an Italian would call it a latte. But I think the article is referring to [how Starbucks adds syrups and flavors](http://www.starbucks.com/menu/catalog/product?drink=espresso#view_control=product) to make coffee more drinkable for the masses. Also, the ingredients Starbucks use are good but probably not the best.  \n\nStarbucks actually didn't pioneer the marketing of sweet, milky lattes to the masses. [The credit has to be given to UCC who packaged sweet lattes in a can and sold them out of automated dispensers at every street corner in Japan.](https://en.wikipedia.org/wiki/Canned_coffee) If you were a casual drinker in the 1970's, you put your 100 yen coin in a machine and got your fix. You even got to choose hot or cold. But if you wanted a fresh cup, you went into a fancy [kissaten](https://en.wikipedia.org/wiki/Kissaten) that would do a pour over for you for an exorbant $10-15 per cup. These were popular during the bubble economy of the 1980's.  \n\nMy mom is Japanese and used to serve our guests iced cafe au lait (made with coffee instead of espresso). Everybody would look confused and baffled at iced cold coffee. This was in the 1990's when coffee was still bought in styrofoam cups at the donut shop. And yes, my mom's iced au laits were sweet just like the canned stuff!",
      "A real latte has full release.",
      "Starbucks has charred espresso made with a superautomatic machine and scalded milk. A real latte is sweeter (without the sugar).",
      "Latte is one part espresso, two parts milk, heated up to the point where theres a bit of foam, but mostly still milk.\n\nCappuccino on the other hand, is 1 part espresso and 1 part milk, and the milk is steamed to a point where it is double the original volume. The espresso is then poured into the milk.",
      "A 'real latte' (caffelatte) is a homestyle breakfast drink, consisting of strong coffee poured into warm milk. It's not the kind of drink that has hard-and-fast rules. Most Italians probably make their caffelatte at home with stovetop moka pots. It's not a traditional coffee bar drink. It is not really an example of 'Italianate sophistication' (whatever that means); it's a casual, have-it-your-way drink.\n\nA cappuccino is something much more specific. It also consists of espresso and milk, but the milk must be steamed in a certain way, and combined with the coffee in a particular ratio. A Starbucks cappuccino is burnt espresso with dish foam. If you want to complain about Starbucks bastardizing a traditional Italian coffee+milk drink, this is the one to get up in arms about.",
      "I am NOT experienced with this kind of thing. In fact, this is my first submission to this sub. The only coffee making devices I've used (and probably also tasted the coffee from) are drip based or pod-and-barcode-programmed machines (generic way of describing Tassimo and K-Cup). The way I like lattes is \"not disgusting\". That is all. I would sometimes add one or two spoonfuls of sugar if the pods were of a bad batch, but that rarely happens. I wish I had a grinder, but that's out of my league. </digression> A real latte can be anything, as long as it has espresso (even pseudo-espresso as from pod-based machines will work in a pinch) and milk. Since I'm not the connoisseur kind, I'd sooner make a program for the Raspberry Pi to control a robotic arm to handle a pod based machine via HTCPCP than bother to get a job so I could get a grinder, a proper machine and a proper steamer... At this point, my caffeine addiction has gone the way of most amphetamine addiction stories, and rather than having that with the normal shots, I'll go with decaf. ;)\n\nI'm pretty damn depressed, so I'll cut this comment short. Hope to see you on the other side of quitting or earlier. I think top notch coffee is only for top notch people. Normal \"proles\" like me should just go with what suits them. Bye! =)",
      "If you're drinking latte with more even sugar added than the considerable quantity that's already present in the milk, then yeah, that's probably normal.",
      "Yes. Sugar causes a giant insulin spike and also causes a large release of hormones like dopamine and serotonin, leaving you feeling a euphoria like energy (almost like a mini \"high\"), and then causes you to crash once that wears off. \n\nCaffeine binds to your brain's adenosine receptors (the hormone that wakes you up the \"normal\" way) and simulates that \"wake up\" hormonal effect. For that reason, caffeine \"crash\" is much more gradual and less noticable than a super sugary latte",
      "Personally I think Lattes and flat whites go down easier than an Americano / straight up Espresso. Milk takes the edge off and you won't get an instant caffeine hit  either. Lighter on the stomach as well if you suffer from acidity and such.\n\nCan't say I've noticed anything about the crash, both are equally shitty.",
      "Espresso to milk ratio is higher in a flat white. Micro-foam techniques aside it's less milk, less froth, more coffee. I'm fairly certain the term flat white just came about from people wanting the strength and taste of a cappuccino without all the froth (and cocoa powder) and then it kinda evolved from there.\n\nI think the average Australian like me just thinks of the 4 standard options at a cafe:\n\n- Short/Long black = espresso no milk\n- Latte = espresso milky\n- Cappuccino =  espresso frothy\n- Flat White = Just fuckin right.",
      "There is a reason its hard to find a proper explanation of the differences between a flat white and a latte. Its because there is no universally agreed upon one. As mentioned here, depending on the area you go to you will be given slightly different flat whites. They almost always are smaller than lattes though and have a higher espresso to milk ratio so they have more of the espresso taste. As for the milk texture , that all depends what cafe you go to.",
      "Coffee definitions are fairly nebulous, they morph over time. But having said that:\n\nA latte is a shot of espresso, with steamed milk added. During the steaming, the wand is kept mostly below the surface of the milk so that very little air gets in. This produces ‘wet’ milk, i.e milk that looks like it did before you steamed it; liquid.\n\nA flat white is usually a double shot of espresso, in a fairly small cup, with partially aerated milk. This means the wand was occasionally pulled above the surface of the milk while steaming, allowing air to be added and (hopefully) folded in with the milk. The result should have the consistency of paint, thicker than latte milk. It contains what’s called ‘microfoam’ which has the property of resting on top of the espresso when you pour it, which if you know what you’re doing will result in a pretty pattern on the top called (confusingly) latte art.\n\nThe problem is, the big chains will happily serve you a latte with milk they already used for cappuccino (much more aerated than flat white milk) and just hold some foam back and call it a latte. They’ll also serve giant flat whites in a 12oz cup. Hence my first comment, the definitions of these drinks may have drifted as a result.",
      "Most 3rd wave shops around here (Central Florida) it runs like this:\n\nCortado - double shot with 2 oz of steamed milk\n\nFlat White  - double shot with 4 oz of steamed milk\n\nCappuccino - double shot with 4 oz of steamed milk with micro foam\n\nLatte - double shot  with 6 oz of steamed milk\n\nLatte to go - double shot with 8 to 10 oz of steamed milk depending on if they have 10 or 12 oz to go cups",
      "One of the things I think that isn't being said below, the flat white being smaller has a larger coffee to milk ratio. Generally, about 2oz espresso/ristretto to 4oz milk, where most lattes seem closer to 2oz espresso to 6-8oz milk. So I look for flat whites that are closer to 5-6oz total, you get a stronger coffee taste than a latte. Several coffee shops near me always give me a latte when I ask for a flat white. In one case, the barista said they were exactly the same, just called different things in different places. But I believe they were mistaken, as shops that offer actual Flat Whites on the board, have a tastier product.\n\n&#x200B;\n\nI may also be completely wrong, but this has been my general impression of the differences.",
      "Two things differentiate them for me. \n\n* Higher espresso-milk ratio\n* Microfoam or consistently textured milk (flat white) vs. Stratified milk (espresso/liquid-y steamed milk/thin layer of foam in a latte)\n\nI'd also say there's no guarantee if you order it out as lots of places make lattes that I would consider flat whites or vice versa and everything between. Flat whites and cortados are often confused as well IME. Ristretto is an optional thing but not key to the definition in my opinion.",
      "TL:DR\nA flat white is a stronger (more coffee) and less foam then a latte.\n \nThe explanation\nThe reality is that a flat white can only make sense since people ask for larger drinks. If you want to make a larger flat white, for any reason, you would have to increase the shots the larger you go, so you would maintain the ratio. This because the flat white was created as an Australian/New Zealander latte, which is normally stronger.  \n In the end I more and more believe that all of them are just the same drink done in different countries. With second wave of coffeeshops and third wave, people demand larger sizes (absolute stupidity) and thus an important aspect of a drink is being overlooked leading us to do mental and mathematical gymnastics so we can do the large flat white and the Latte and the Cappuccino.\n\n Another interesting way to go about it is to follow Harris +Hoole rules on drinks. The foam makes them different, a cappuccino is 1,5cm of foam, the latte is a 1cm and a flat white 0.5 with more coffee in a medium and larger sizes.",
      "Should always be less volume than a latte. Think of it as more of a “Wet Cappuccino”.",
      "It’s herecy but we have made lattes all year ar our office with a good drip coffee base that we punch up with a scoop of high quality instant coffee (as “high” quality as that can be) before adding the milk from electric selfheating frother. It’s decent: I’d say it’s among the 70% score off a really perfect made latte, and better than a starbucks or equivalent.\n\nDrip coffee made with an ancient philips we inherited from my inlaws, frother from philips senseo btw."
    ],
    "size": 20
  },
  {
    "keyword": "cold brew",
    "category": "type",
    "examples": [
      "Why didn't brewing concentrate work for you? (Geniunely curious) \n\nI tried cold brew once and concentrate tasted... fine. Granted, I just got into coffee so I wouldn't say I have a refined palate or anything.",
      "I sell cold brew, i do 48 hours in the ref 1:12 ratio. Recipe matches your coffee usually so dont be stuck with 1 recipe :)",
      "I started cold brewing when we went into the first round of lockdown in March. My wife was buying a lot of Stok. It was cumbersome to haul in and wasteful. So I got a few mesh kits and half gallon jars and went to work trying to replicate Stok. \n\nMy brew ratios worked out to be about what you have listed 1.5 cups of grounds per half gallon jar, on the counter for 18-24 hours but it seems to be forgiving for up to 3 days of brew time. 3 cubes of ice and a splash of oat milk is how I take it. \n\nAs for my coffee I kept coming back to Stone Streets Cold brew coffee. Its as close as I can find to the Stok brand. \n\nOne other detail I noted was the taste became better after a day post brewing. It made me wonder if I've developed a taste for stale cold brew or if there is something about it being oxygenated that alters the taste to my liking? I found that to be most odd.\n\n2 questions for you. \nWhy do you filter out the oils? \nDo you have a bean you found to be your favorite for daily cold brew? Something reliably sourced?",
      "3:16 sounds really condensed though. Usually I only use 30g of coffee per 500ml of water. Should I increase the dosage of coffee when doing cold brew?",
      "Do you dilute your cold brew after filtering it or do you drink it as is? I’m new to making this and I’ve just put them in the fridge, real excited to taste it tomorrow!",
      "I LOVE making cold brew and have tried, over a couple years, to perfect it. Simple is best.\n\nI brew with a 1:8 ratio (water:coffee by weight), coarse grind. Use fuck all for a container. Use a damn bucket if you have to. Some of my best brews were in a godforsaken salad spinner with the strainer taken out. Make sure all grounds are wet.\n\n24 hours in the fridge is cool, but a 96 hour steep is godly. Patience pays off. Some say room temperature, some say fridge; I’ve found the best notes come out in a longer, colder steep. Owner of the local roaster actually suggested this! As long as you’re steeping for 24-96 hours, you should be golden. Any more than that, you’re well into diminishing returns, and no one likes rancid coffee. Strain into another container with cheesecloth, steel mesh, or a paper filter. \n\nWith this method, I make enough concentrate to last me for 4-7 days, and while I’m whittling away at my concentrate, I have another bottle brewing.\n\nStory time: Like an absolute madman, I decided to try a four-day steep with fine ground shitty espresso beans. The resulting brew was so powerful that the bubbles were dark brown and it tasted boozy, like stout. Worth a try sometime.\n\nEdit: Good god, yeah, 1:8 ratio, coffee:water by weight. Just goes to show I shouldn’t be writing advice online after a long shift.",
      "If you buy a Takeya it comes with an instruction manual that’s worked perfectly for me. \n\nI grind my coffee, same settings as pour over. Fill the strainer with grounds. Fill cold, filtered water 3/4 up Takeya. Shake side to side. Let sit on its side in the fridge for 12 hrs. Shake gently after removing from the fridge. Pour cold brew over strainer to remove excess grounds. Enjoy.",
      "I have been making cold brew for almost 10 years, and my system has changed during that time as I have tried to scale up volume while limiting mess. Here is where I am now:\n\n1. ~180g coffee : 1 gallon water. Grind beans and place into disposable mesh cold brew bag (see ones by Plum Labs) and put in gallon sized plastic pitcher. Add water.\n2. Wait 12-24 hours.\n3. At this point the coffee is ready and you could simply remove the mesh bag with coffee grounds and discard it. However, I find that the cold brew coffee can be gritty if you do not filter it so I include a step 4.\n4. Strain through a v60 w/ paper filter into gallon sized vessel or 2x 64oz vessels. The v60 filter will clog with fine sediment. You can either discard the filter and start over with a fresh one, or simply rinse the v60 and filter out. It will clog up several times. \n\nThere is probably a better way to filter so if anyone has any advice please let me know. I like using the v60 filters because in the end it helps produce a very clean cup of cold brew, but rinsing the clogged filter out a few times can be tedious.",
      "I have a big Oxo cold brew maker, so I do 1.5 c course-ground beans (about the texture I use for French press), 6 c water (1:4 ratio), and steep for anywhere between 12-24 hours. If I steep for less time it makes a good brew without cutting, but if I go closer to 24 I’ll cut it. I keep it in the fridge and have coffee for a few days (I usually do this when I’m tired of a bag and want to get through it quickly, generally only on cheaper beans).",
      "Did someone just come through and down vote all the comments here? WTF?\n\nDoes someone hate cold brew that much? Lol",
      "In my experience, cold brew can produce different flavours than you get from making iced coffee or hot coffee. But because the long, slow extraction at room temperature doesn't over extract, it's a good way to get a flavourful product out of less impressive beans.\n\nFor example, I don't particularly like Starbucks blonde roast for hot coffee, but I find it makes great cold brew. It's not very expensive, and I can buy it pre-ground so it's easy and convenient to make cold brew when I want it.\n\nMy method is to use a 1:8 ratio and brew in a large sealable bowl for 18 hours, then filter it through a Chemex. I then decant the coffee into swing-cap bottles and store it in the fridge for up to a week.",
      "I’m going to say that much of the hate for cold brew comes from not being able to guarantee how it’s made at your random coffee shop.\n\nSometimes they really do use a specific cold brew setup with prescribed ratios, beans, etc.  Or sometimes they just put leftover batch brew in a big Tupperware and store it in the fridge till the next morning.  (seen descriptions in this sub of some, uh, nonstandard methods at shops)",
      "Coffee has many flavor compounds, some are extracted by cold water but others are only extractable with hot water, so if you only brew with cold water you are limiting the amount of flavor compounds you can extract. But there is no “best” way to make coffee other than the way you like to drink it, so if that’s cold brew for you there’s nothing wrong with that",
      "Cold brew can be perfectly enjoyable, though as others have pointed out will lose complexity. \n\nIt's probably not the wisest use of relatively expensive specialty light roasts, but ultimately that's still up to the user to determine.\n\nPersonally, I save up small amounts of leftover bags (<12g or so), save them in the freezer, and occasionally make a hodgepodge cold brew.",
      "The major issue I have with cold brew is that the volatile compounds in coffee are lost through the long extraction. So it isn’t really worth it to put wonderfully aromatic coffee into a cold brew. It’s not that cold brew is a bad drink, it just doesn’t do justice to great coffee beans.",
      "No, cold brew made with high quality beans can produce great things.",
      "Canned cold brew is almost certainly pasteurized, which will affect flavor by directly affecting the product with heat and also speeding up the reactions of any dissolved oxygen. \n\nAlso, I’ve worked in coffee for 15 years, as a general rule what gets cold brewed is whatever coffee is the oldest. I’m sure plenty of places do a good job and actually use good fresh coffee, but plenty of cafes that should be doing better, aren’t. \n\n(Also, I find that the standard grind-like-rock-salt and steep for 24 hours recipe that almost everybody uses makes not great cold brew and prefer a grind more appropriate for a pour over and to brew for 12 hours.)",
      "Honestly, I have given up on buying Cold Brew out in the world.  Too often, they are over extracted (ground too fine or left the grounds on the water too long) resulting in odd vegetal flavors.\n\nSome shops brew in plastic containers, leaving odd plastic notes in the taste.\n\nOthers are using lightly roasted beans that would be better served as a Japanese Ice Brew, so that you could really taste their character.",
      "It's entirely possible they don't know wtf they are doing and are just selling cold coffee as \"cold brew\" if it's bitter",
      "I agree homemade cold brew is superior, but out in the world my favorite is the Starbucks cold brew. Often 3rd wave shops use too light of beans and you get a very high acid cup, or shops use old/bad beans, or they've stored it for too long and its oxidized. With Starbucks you know what you're going to get, which is a decent cup."
    ],
    "size": 20
  },
  {
    "keyword": "americano",
    "category": "type",
    "examples": [
      "8oz americanos with not super hot water are pretty enjoyable.",
      "Yep, I just make Americanos with most of the shots I pull at home using water at about 70-75 C, lets me enjoy it for longer than a measly double shot of espresso",
      "I really enjoy my 'Moka Pot Americanos' at home.  You're right though, has to be cooled off a bit, even if i maintain minimum temp for the Moka Pot to function.",
      "Iced americanos are slammin",
      "I fuckin love iced americanos",
      "I hate the places that out damn near boiling water into their americano(Starbucks).\n\nPro tip, ask for the Blond Roast at Starbucks for a better Americano",
      "I have a lot of korean friends, and every time i go for coffee with one of them it’s always an iced americano and sometimes an iced latte if they’re feeling it. Might just be a thing in korea ?",
      "Iced is definitely the default in Korea, especially when it comes to Americanos.\n\nEven in the middle of winter, cafes usually sell roughly 50% hot drinks and 50% cold drinks (I'll try to dig up the article about it). Spring through fall the default is iced.",
      "I order americanos because most coffee shops leave their coffee sitting for too long imo",
      "A good espresso made into an americano is going to keep the good flavours of the espresso and lengthen the drink. It's also going to be fresh. A drip coffee might have been sitting (though in any good coffee shop that ought not to be the case). Both would take a back seat to a made to order pour over, but that takes a lot longer to make.",
      "Black coffee, because an Americano just tastes like what it is - diluted espresso. And if you enjoy that, I celebrate your choice, but it's not my preference.",
      "Filter coffee has much more flavor for me, and that's only if the shop made it recently.\n\nAn Americano just tastes like a diluted espresso shot, and the water they use usually comes from the espresso machine, at 250 F/ 121 C, which is too freaking hot to enjoy.",
      "Theoretically an Americano would have less caffeine in it compared to a filter coffee",
      "I like a lightly diluted americano, more like a long black. I feel like I get stronger flavors and it’s still fresh.",
      "I like and prefer a pour over or a press. But I will go with an americano out of these two strictly for freshness. I can’t trust how long you’ve had that coffee sitting there my friends. Unless your like my favorite bakery and literally put the time it was poured on the front in chalk. Thank you community, i dislike your coldness to the homeless population but i enjoy your local roasts and sourdough",
      "I only get espresso drinks at coffee shops.  At home, it's always black coffee.\n\nIf I'm going to bother to drink coffee at a coffee shop, I often want something special (that is, something I can't make at home just as well), so that means espresso for me. I don't like milky drinks so my options are: espresso,  espresso macchiatto (which I'll only do at good coffee shops) or Americanos.  When I go with friends to places like Starbucks, I find Americanos are literally the only option in the shop that's remotely drinkable -- their drip is disgusting, their espresso is terrible, the Americano I can choke down.",
      "Prefer americano.",
      "Just to clarify most Americans do not drink Americanos, the most common normal coffee is drip or pour over depending on how nice of a shop you're at. Like they will use a drip machine and fill big  metal pots with that and pour it throughout the day, I think that's why there is so much difference in quality and taste in the US, all depends on how nice of a drip machine and how often they dump the old and make a new pot.  \n\n\nFrom my trips abroad it seems most places they make every coffee individually using espresso .",
      "If you are at a place that can do a proper americano (shot of espresso with water) vs drip they will have milk.",
      "Melbourne had great americanos, but melbourne just has amazing coffee everything, everywhere, all the time."
    ],
    "size": 20
  },
  {
    "keyword": "french press",
    "category": "brew",
    "examples": [
      "Oh man when you start fresh grinding it for the french press be prepared for a whole new coffee. Enjoy!",
      "The french press was my gateway drug into the world of good coffee, enjoy the journey!  I have a ton of brewing devices (technivorm, chemex, aeropress, v60) but I still reach for my French press sometimes.",
      "If you like French Press and already have a gooseneck kettle and scale, try this idea:\n\nCoffee in a Teapot \n\nSo I tried the coffee grounds in a tea pot and it’s actually good and better clean up than a French Press.\n\nIt’s an old cast iron tea pot that we do not use. 20 g of coffee ground coarse in the middle of French Press range (20 clicks on the ROK grinder). Loaded the grounds into the infuser and then 500 ml of 95C (203F). Pouring is a bit slow because the grounds tend to bloom and absorb water. Once 500ml in, allow to steep for 5 minutes, then remove the infuser with grounds. Coffee tastes like French Press.",
      "I like the French press but I hate cleaning them so I stopped using mine",
      "I'll carry the flag for the Chemex on this one. There's a reason nearly no top tier coffee roaster/shop offers a French press brew method in their stores. I understand that people all about body in their coffee might enjoy the French press, but you're really sacrificing all the beautiful clarity in your cup for it.\n\nThe Chemex is my preferred go-to because coffee is so delicate and complex. I love tasting all the little subtle and beautiful hints that comes from the beans. It does have the best clarity and I think that's what puts it over the",
      "The AeroPress would like to have a conversation with you and your French Press.",
      "Didn't read all the comments so forgive me if someone has already said this. Here in India (Southern India to be specific) we have a method of making coffee using a low-key version of a French Press. We locally call the coffee simply as \"Filter Kaapi\" which is a mix of thick Decoction and milk.\nThere is a particular pressure based utensil by a company called Atlasware that I use to make my filter coffee (different from the low-key French Press). The Decoction that is obtained from this is more concentrated and extracts the whole essence of the coffee grounds. Links for both are attached below. \n\n[Atlasware Coffee Maker](https://atlasware.in/products/atlasware-stainless-steel-coffee-make)\n\n[South Indian Filter Kaapi Maker](https://www.amazon.in/CooPanyTM-Stainless-Filter-Coffee-Indian/dp/B08F4BCPLG/ref=asc_df_B08F4BCPLG/?tag=googleshopmob-21&linkCode=df0&hvadid=397357526559&hvpos=&hvnetw=g&hvrand=4265602845524132577&hvpone=&hvptwo=&hvqmt=&hvdev=m&hvdvcmdl=&hvlocint=&hvlocphy=20460&hvtargid=pla-940798208383&psc=1&ext_vrnc=hi)",
      "I used to french press a lot, but the clean up was often a pain. I bought a metal pour over that has a fine mesh. Came pretty close to french press. And clean up is easy. No plunger to clean.",
      "I’ve got some questions about James’ method. I‘be been making yummy coffee with my french press for ages, no trouble, Decided to use His method to elevate my game. The only things that changed for me was not stirring regularly, scraping the top of the water and not fully plunging and I ended up with a really bitter, not very nice brew, that still had silt in it! \n\nI don’t measure my coffee by gram ( I have a spoon for it) and I use pre ground coffee so it’s not ideal I know that, but the coffee I was making with my old method were fine! Very confusing indeed. How could not stirring or plunging turn a nice cup into a bitter mess? Any ideas?",
      "WOW, I've been doing it wrong all this time! I do use boiling water and fill it all at once, but I've been stirring for the entire 5 minutes and then pressing. \n\nSounds like I need to stir just to incorporate, and then let it set for that 5 minutes and then press? \n\nI haven't had a problem with flavor: my coffee is consistently good. But it does have a lot of sludge in the bottom once I get to the last cup.\n\nEdit after watching the YouTube video: You don't press it all the way?!? I'll be making another french press this afternoon to test this.",
      "I like hot coffee.  If I let the grounds sit in the water, it’s no longer hot. So, I land up microwaving it, which I know is not a good idea. How to get a nice hot cup of coffee with the French press?",
      "Trying this French Press recipe after failing that pour over and switches and everything else even though I bought all the kit Digital Scales special teapot and also now trying the French press and I just realized after going through this a couple of times my bad habit is as soon as I pour the water and I automatically stir the coffee and watching the video couple times I realize that you're not supposed to stir,  I'll get it right next time",
      "Be careful who you draw caricatures of.\n\nOh, wrong French press.",
      "One important thing with the french press is that you need good quality water. If you live in a area where the water is hard, you might need to filter your water first.",
      "honestly, some people just don’t really like french press. i’m definitely one of those people. id say just to try out other methods and just see what you’re into",
      "Hi! Maybe the problem is not your method but perhaps your beans? Before buying, be sure to pay attention to the label and also to your palate. Some beans won't give you the flavor that you might be looking for (or as advetised in the coffee bag). Keep experimenting. Some beans, no matter how you brew them tend to err on the \"tea-like\" taste profile. I would recommed you to try it with the same coffee bag you tried first, read the label and learn what works in a french press and what doesn't. \n\nIf you are having problems with muddiness in your cup, what I do to mitigate this is a little and quick bloom with swirling, then add the rest of the water. This will push the fines to the bottom quickly and your crust will consist mostly of big pieces of coffee. \n\nHope this helps!",
      "Most people are mentioning differences in filters, which is definitely a great point. But I haven’t seen anyone mention insulation. I have a metal/insulated French press, which keeps the temps very high during brewing. Not sure how big the impact is, but how hot the coffee stays while brewing will differ depending on the quality/materials used",
      "I use a Planetary Design stainless steel French press because unless I've had my coffee I might drop things. The last thing I want to do early morning with sleep in my eyes is clean up broken glass. Plus it keeps my coffee warm",
      "I buy French presses at thrift stores quite frequently to give to friends, and I've noticed that presses from cheaper brands have significantly flimsier plunger assemblies. The springs on the outside of the plunger plate are thinner and weaker, and the mesh disks are flimsier and more prone to damage. That's the main difference though. A $20 Bodum press is going to be pretty much the highest build quality you're gonna get.\n\nIf you want a big one or an insulated one, those will of course also add to the cost.",
      "James Hoffmann does a video on French press brewing, and if you follow his guide you’ll only push down the filter the smallest amount because hypothetically all the sediment will have sunk to the bottom. Works for me and I use a cheap as shit one."
    ],
    "size": 20
  },
  {
    "keyword": "pour-over",
    "category": "brew",
    "examples": [
      "Since you have been using a glass pour-over, put the Hario Switch on your list. Also glass, well made, and will give you lots of variables to play around with if that is your thing..",
      "The absolute first step is to contact your local Health Department to see what kind of licenses and permits you’ll need. Even a “pop-up” will need to meet the same health and safety requirements as a coffee cart, which is classed by most cities and counties as a mobile food vendor.   \n\nAn appointment with the Health Department will cover the street vending regulations in your city; the types of products you’ll be selling and how they’re handled, stored, and prepared; any commissary requirements (the requirement to operate from a licensed commercial kitchen; the equipment you’re using and the size of your set-up; your fresh water supply and waste water holding capacity; your ability to heat water; food handling and/or food manager course requirements; hygiene policies; inspection of the equipment and/or working area. They’ll also cover where you are legally allowed to operate (or not operate). \n\nYou’ll also need a business license and general liability insurance that covers the business.  \n\nTo be frank, I don’t think that your idea at this stage is likely to be profitable. Unless you are an absolute pour-over whiz who can work on several pours at once AND do it in an entertaining way, you’ll need something like a [PourSteady](https://www.espressoparts.com/products/poursteady-ps1-5-cup-pour-over-coffee-brewer-black) with 5 cups to accommodate anything more than the absolute lowest volume. And most folks are going to want a variety of milks and sugars, plus napkins and stir sticks, so you’ll need a place (and possibly refrigeration for the milks) for all of that.  \n\nIf you want to get your name out there and be known for your pour-overs, attend barista competitions in your region and any local coffee events.",
      "As others have alluded to, pour-over-only or even primarily is not a good model for high-volume (profitable). Espresso-based drinks are still the main players...ppl into pour overs are tinkering at home generally. \n\nAlso, it's tough to produce consistency as an individual making a pourover, let alone an entire staff.",
      "I used to get exclusively pour-over coffee from a handful of third wave places in my neighborhood. These were outpost type places in a hip neighborhood, with lots of folks wanting the pour-overs. \n\nWhat I noticed over time was not just that people ordered espresso-based drinks, but that baristas got really into making those thoughtfully too, customers got more educated about them (e.g. knowing the difference between a cortado and a macchiato). In addition, the batch brew situation got better, don’t ask me why. It just became clear I could get a perfectly good cup of coffee without waiting for six minutes, or a perfect cortado if I wanted it, and it became obvious why pour-overs represent (I am going to guess) maybe 10% of unit sales, at best, at the most highly appreciated coffee spot in my nabe. \n\nI love a good pour-over coffee so I don’t mean to discourage, but you should do what’s best for the business, or what you believe differentiates you. \n\nCan you do the whole thing as a cart? I have seen this done well.",
      "A point that I've not seen here is that some of the second wave cafés that I've been to here in the UK (that admittedly don't do pour-overs anyway) don't actually buy decaf in beans. Instead they use pre-prepped ESE pods - round teabag-like things that contain pre-ground coffee which fits into a standard sized pressurised portafilter.",
      "Why not go to the Clever Dripper from pour-overs? It's like that, but easier, and awesome.\n\nBest aspects of pour-over and French press combined, IMHO.",
      "Hello from somewhere down the rabbit hole. Started with drip coffee (store bought canned coffee), pour-over with beans from a local roaster, flat-blade grinder, hand held JX grinder, Aeropress, Moka pot, used Gaggia espresso, Baratza Encore grinder, home roaster, 5 lbs of beans per month (roughly), mods to the Gaggia, yeah I have a problem. It’s a delicious problem, though.",
      "I have really enjoyed the fellow pour-over. It requires you to purchase their filters, but it's been nice. I love the double wall insulated blown glass...keeps the coffee hot.\n\n[Pour Over](https://fellowproducts.com/products/stagg-xf-pour-over-set?variant=39629302595684&utm_source=google&utm_medium=cpc&utm_campaign=14890879427&utm_content=129066415438&utm_term=&nbt=nb%3Aadwords%3Ag%3A14890879427%3A129066415438%3A550738995079&nb_adtype=pla&nb_kwd=&nb_ti=pla-294682000766&nb_mi=143217782&nb_pc=online&nb_pi=39629302595684&nb_ppi=294682000766&nb_placement=&nb_si={sourceid}&nb_li_ms=&nb_lp_ms=&nb_fii=&nb_ap=&nb_mt=&gclid=Cj0KCQiAsdKbBhDHARIsANJ6-jfIhTUkfm4viBKZKTP4EZIPUsFr68s2Dz-tVTlxt5HXAVPuS-6n8pAaAhrHEALw_wcB)",
      "This is all personal preference and what I've experienced but:\n\nPour-over is great for lighter roasts and for 'thinner' cups where the coffee has more floral/fruity notes. I've noticed that putting milk in V60 coffee sort of removes any of the interesting notes so this is mainly a black-coffee thing. \n\nMoka pot is the other way - I love the heavy syrupy quality of the resulting coffee and it stands up to having milk added to it really nicely. I'll do this now and then, especially if it's a darker roast. \n\nAeropress is in the middle for me - you get nice notes but the resulting cups have a bit more 'body' and mouthfeel, so I feel you can add milk without it drowning the taste of the coffee. \n\nAll three are great methods - it's really up to you to experiment!",
      "I brew Ethiopian beans all the time on various pour-over methods using the 4:6 method, and my finish times are usually still 3 - 3:30. What is your brew ratio, and pouring method?",
      "Melitta is a completely different coffee dripper (mostly due to unique filter paper) and you should not use V60 recipe.\n\nMake sure to use Melitta filter paper and not use Kalita filter paper. Melitta filter papers have tiny perforations.\n\nGrind pretty fine, at least finer than most pour-over grind. Bloom + one pour recipe should work. If the coffee tastes sour, it is under-extracted and you should divide into 2 pours or grind finer. If the coffee tastes bitter, grind coarser.",
      "I've tried ordering a pour-over at several Starbucks and it's always the same grimaced face that says something along the lines of -  \"Yeah, if you really want that then you'll need to wait off the side, it could be up to 10 minutes or more.\"",
      "My boyfriend built me this pour-over stand along with getting me the needed equipment to actually make them (Glass V60, gooseneck kettle, fancy little decanter, Intelligentsia Guatemala coffee beans). He made it so you can adjust the height of where the stand is which is definitely a nice touch as I change between regular/travel mug pretty often. \n\nIt's also been incredibly fun to learn how to make pour-overs which I'm steadily improving at. Still trying to find the right grind size and bean-to-water ratio but starting to tune in on each cup. I did realize I need a new scale - my current one turns off after about a minute and then decides to auto-tare what's still on it. Anyone have any recommendations for scales?",
      "That's nice! I got my first pour-over set this time last year during pandemic lockdown and even till now, I can't say i nailed down my technique but eh learning process every day!\n\nMind sharing your technique, recipe, grinder settings, the type of beans ur using and whatnot? Thanks!",
      "Try this as a starting place. https://bluebottlecoffee.com/us/eng/brew-guides/pour-over",
      "Just some random advice, I personally use a paper filter in addition to the metal filter for my pour-over. I found the coffee coming through the metal filter was too oily, and I think using the paper filter really makes for a much smoother cup. Also removes 100% of the sediment which used to sometimes leak though the metal filter. Of course all very subjective and personal, but maybe give it a try!",
      "Something I've observed that I cannot support in any way but anecdotally is that when brewing with water as hot as I can get it, I have to be super careful to nail my technique or I'll end up with a lot of channeling-type flavors (weak, bitter, sour, harsh). I notice that when brewing within the SCA recommended range, it is far easier to dial coffees in and small technique variances don't change things much. However, I still brew with boiling water for most coffee as I've found my best cups to be better that way. All of this is observed with V60 btw.\n\nAnyways, I am wondering if the increased flow rate when brewing hotter could explain this. In the world of pour-over brewers, there is a range between restricted flow brewers like the wave and free-flowing brewers like the V60. Though I don't own a Kalita, the general consensus seems to be that they are easier to brew because of their immersion-like characteristics due to restricted flow. On the other hand, V60s are especially hard to master because they are so free-flowing.\n\nMy theory is that as we brew hotter, the increased flow rate makes the V60 act even further from an immersion brewer. It becomes even more reliant on grind size for flow restrictions, more susceptible to channeling, and therefore, more reliant on technique to extract evenly. With a lower water temp, water passes slower through the bed of coffee. In theory, this might act more similar to a Kalita and have more immersion-like characteristics. This would imply that at lower temperatures, a brew is less technique sensitive, less susceptible to channeling, and will more easily reach an even extraction.\n\nI'm really interested to hear your thoughts as this is an idea that I've never heard discussed before. It could explain why some people swear hotter water dramatically changes the flavor of the brew.",
      "French Press convert to Pour-over?   \n\n&#x200B;\n\nWelcome to the Clean Cup Club =D",
      "I vastly prefer Aeropress to French Press if you're OK with a single serving. If I wanted more capacity I might look at Hario Switch or Clever Dripper (I've never used these so I'm not entirely sure if they actually have more capacity). All four of these options are immersion brewers which are much more forgiving than pour-over. \n\nPeople either seem to love or hate pour-overs brewers. They are more sensitive to a lot of factors such as pouring methods, technique, grind size, filters, etc. This gives you more freedom to experiment but also gives you more ways to screw up.",
      "Wasn't there a guy who just punched a hole in the bottom of a paper cup, and used that effectively as a funnel for pour-over? That concept, at least, might get you started.\n\nBut anyways, I'd have to concur with the others and look at an AeroPress for coffee with less equipment required. There is now a travel version that combines together and takes up less space."
    ],
    "size": 20
  },
  {
    "keyword": "moka pot",
    "category": "brew",
    "examples": [
      "Pros:\n\n* Makes richly flavored, strong coffee, different from drip\n* Easy to use once you get the hang of it\n* Not necessarily expensive\n\nCons:\n\n* Requires a consistent grind-- blade grinders are not an option.  Even pre-packaged coffees can be the wrong grind size.\n* Has to be monitored during brewing\n* Doesn't keep the brew warm naturally\n* Something of a learning curve to use\n* Requires occasional replacement of rubber gasket\n* More effort to clean\n* Stainless steel versions are more desirable but also more expensive\n* Pots are usually small, meaning you don't get large cups.  The stronger brew is supposed to compensate for that, but I find I want more.  Larger sizes are available but manufacturers seem to be phasing these out (looking at you, Bialetti).\n\nDespite the larger number of cons, I like the flavor of a moka pot and brew it occasionally, especially when it's just for me.",
      "Moka Pot or French Press are my go to methods.  However this sub has way more discussion of v60/aeropress/pour over methods.\n\nPros:\n\n1. Strong, rich coffee.  This is the closest thing you will find to an espresso without owning an espresso machine.  This is one of the most traditional ways of making coffee.  It's a method dating back to 1930s Italy and it's still found in most Italian homes today.  Some of my friends in Italy use their moka pot three or four times a day (minimum).  It's relatively easy to use once you get the hang of it.\n2. Perfect for milk drinks.  Especially if you have a french press for the milk\n3. Inexpensive, think my 3-cup cost $20?\n4. Unlike what another poster here said, consistency in your grind doesn't matter much.  Just don't make it fine or coarse.  Aim for somewhere in the middle of the two and you will be absolutely fine.\n5. You can use a cheap burr grinder and still make good coffee with the Moka Pot.  Mine is a Hario Skerton Pro and I have had no issues with the grind in my Moka Pot.  It also doesn't make sense to buy an expensive grinder to use with a $20 Moka Pot.  Even traditionally, it doesn't make sense.  No one in Italy even grinds their beans, they use prepackaged grounds albeit I am sure it's fresher than what we get here.  Grinding our own beans started in America.  I make coffee using my Moka Pot once a day.  I really enjoy the manual process involved in grinding and using my Moka Pot.\n\nCons\n\n1. If you prefer watery coffee, this might not be your go to method.\n2. It takes a while to get it right.  It might taste bitter/sour the first few times but you have to calibrate.  There are a few factors such as preheating water, adjusting the temperature, coffee grinds, and monitoring the coffee.  If you don't do one of these things correctly, you might mess up the whole coffee.  However, once you get into your routine, it will be hard to mess it up.\n3. Low output.  I have a 3 cup, it's good only for me.  Not ideal if you are going to be entertaining people.  However, this is where my french press comes in handy :)\n4. The different parts of the Moka Pot can be a bit confusing at first.  You have to disassemble it each time to load the coffee in and the water.\n5. Cleaning.  You need to make sure you thoroughly clean the different parts including the rubber washer.  However, all you are really doing is rinsing it with water.  It's not so difficult.\n\nThe cons are what I ran into the first few days I started using it.  If I try to do something differently to experiment, I sometimes end up making bitter coffee.  I stick to a routine here and it doesn't fail me.  Good luck if you decide to get one.  It's a fantastic method and will get you a great cup of coffee.  Very underrated on this sub.",
      "Pros: no filter needed. Really good flavor. In contrary of what people had mentioned of the small size, I have 1 moka pot that serves 4 or maybe 5 people. Its like 7 inches tall. \n\nCons: keep an eye on the handle since its made of plastic and can melt if it is exposed longer periods to heat. I've lost 2 moka pots handles due to that. Gaskets might need replacement every few years.\n\nI love moka pots. I have about 5 of them.",
      "I got a Moka Pot the beginning on the year and have used it daily. I love it. I think experimenting with your prep and taste and once you find what works for you, stick to that method. \n\nI do find it funny how some people pre heat water, I do not and my Italian friend was shocked when I told her that people pre heat the water, so I am not sure there, lol.",
      "I haven't used my Moka pot in a long time. This is inspiring me to break it out.",
      "We just need to sticky the moka pot post, as someone asks a couple times a week about Moka pot tips.  We reinvent the wheel every time.  There are 4 physics of Moka pot papers you can read that inform the Moka practice and you get to this:\n\nThe best advice is use an AeroPress filter and remove the pot and apply cold water as soon as it starts bubbling (as you state). Also, using preheated water in the tank helps with extraction temperatures.  You can get decent cup of coffee, but let's not fool ourselves: it's not espresso.  In addition, there is an inevitable wide range of temperatures that the pot brews at, which is not desirable. \n\nSome academic papers back this up:\n\n1. [A 2002 paper (in Italian!) by Varlamov and Balestrino](https://www.comunicaffe.it/wp-content/uploads/2013/06/la-Fisica-del-buon-caff%C3%A81.pdf), which Navarini paper calls wrong\n\n2. [A 2006 paper by Gianino](https://www.researchgate.net/publication/243492775_Experimental_analysis_of_the_Italian_coffee_pot_moka%27%27), which oversimplifies a bit, but lays the groundwork\n\n3. [A 2008 paper by King](http://www.msc.univ-paris-diderot.fr/~phyexp/uploads/Moka/article1.pdf), which provides honestly the best theoretical model and exploration of initial water temp.  Tl;DR: preheat to 70C or else you'll brew at too cold a temperature.  Also happens to be backed by experiment.\n\n4. [2009 paper by Navarini et. al](https://www.sciencedirect.com/science/article/abs/pii/S1359431108002299), which is the most experimental measurements and does us the courtesy of explaining why you need to remove that pot from the stove once you get bubbling.",
      "Hi, thanks for the write-up. Of course, much of what you write is sort of, \"I like it this way\" from practice, but there are a few places where I'm going to disagree about the more \"provable\" things:\n\n>The SS moka have the advantage of being easier to maintain and clean, but their thermal mass makes the brewing time a bit longer and less forgiving in the preparation since the longer time of brewing can make the coffee taste slightly bitter. They are usually more expensive.\n\nHow do you figure? Aluminum has roughly twice the specific heat capacity of stainless steel.\n\n>If you're using a dark roast coffee\n\nI recommend against ever using dark roast in a moka pot.  They [already extract at 28-32%](http://www.msc.univ-paris-diderot.fr/~phyexp/uploads/Moka/article2.pdf), which is far above the recommended 18-22%.  Dark roast is likely to extract that much more.  \n\n>this prevents that the last part of the extraction (which have more caffeine and so it's more bitter)\n\nActually, [the bitterness of overextraction has more to do with decadienal, nonadienal, and ethylgujcol than the caffeine](https://keet.files.wordpress.com/2010/08/espressochem.png).",
      "I miss my Moka pot. Every brew was a little bit different and the process was therapeutic. \n\nUnfortunately my new place only has fancy induction coils not a gas cooker. The moka pot dont work.\n\nWhat I could never get right was the grind. Is a ‘french press’ grind okay?",
      "Fantastic write-up with good tips. I put my Bialetti Moka pot away for a long time after switching to a V60 pourover. I recently tried my Moka pot again after watching James Hoffman's Moka pot tips, which are identical to yours, and I made an incredible cup.\n\nI recommend trying everything OP wrote. Keeping the lid open, watching for the bubbles, and cooling the base over the sink significantly improved the cup quality for me.\n\nAnyone with a Moka pot sitting around should try another cup with these brewing tips. I really enjoy Moka pot cups in the afternoon and make them more frequently now.",
      "Preheating the water before putting it in the Moka Pot was huge for me! The moka pot doesn’t really protect the beans from the heat of the stove and they burn before the water starts to percolate the coffee.",
      "I’m definitely bookmarking this!! For the past year I have wanted to do more with my coffee that popping a cup into my Keurig. The first thing I bought was a Moka pot and I’ve heard so many people say how delicious it is but I cant tell if I’m doing something wrong or maybe my tastebuds are garbage. My most recent attempt involved cafe bustelo because so many people in this sub said it was delicious. Now I have a giant tub of the stuff and no idea what to do with it. Anyway, my point is I’m really looking forward to trying this. I think the moka pot is so cool and I would love if I can get to a point where I love what’s coming out of it, instead of trying to poker face through the taste.",
      "With OP's post and all of the comments from others this is probably the best moka pot post this sub has.",
      "This is great! I love reading guides like this. My only exposure to coffee has been Folgers office drip coffee...then we went to local roasted grounds (which was much better) but now I like to make it myself (since I'm working from home). Recently bought a Moka Pot and I love it! This guide gave me some ideas to play around with. I also bought an Aeropress recently. love the new world of coffee making that I've discovered",
      "I’m looking at getting a Moka pot soon so this is great, thanks\n\nOne question: If you are filling the basket fully, is the purpose of weighing just to know how much to grind to limit waste, rather than looking for a specific water to weight ratio?",
      "I would test with the following changes:\n\n1. Try to grind a little coarser. A moka pot does not brew an espresso, so at a first glance you don't need to grind that fine. Personally, for the moka pot I grind the same size as I would use for a v60 or a Chemex (tending to fine, but not the finest).\n2. Do not apply pressure to the coffee. Level the coffee in the little rack with your finger or something like that, but do not apply pressure (again, you're not brewing an espresso).\n3. Use boiled water, not tap water. That way, when you put the moka pot on the stove coffee won't burn.\n4. I haven't measured the temperature, but I use the small setting on a gas stove.\n5. ALWAYS WASH YOUR MOKA POT AFTER USING. ALWAYS.",
      "That's a very very long brew time. My (3 cup) moka pot takes around 1:30-2 to start brewing and another 30-45 seconds to finish. Turn up the heat a bit. Maybe it's taking longer as the electric stove needs to heat up first? Do that before placing the moka on it.\n\nAs for the brews: there's a lot of material on this sub to help you fine tune it. Maybe see the grind setting with people the same grinder as yours use and start from there. Look up the Hoffman video on the moka pot. Worked best for me. You'll have to brew a couple times to find what works best for you. \n\nYou don't need to weigh the water, just fill it till under the valve. For coffee I'd say weigh it after filling the funnel and not before to improve consistency; fill it, level it and then weigh it.",
      "Make sure your moka pot is screwed on tight. If it's loose, pressure won't build up and your brew time will go on way longer than it should.",
      "I use a little bit more coffee than you (16 grams) and heat it on medium on my stove.  I grind it fine, but not nearly as fine as I would for something like espresso or turkish/arabic coffee.  Depending on your grinder, the finest setting might be ground to small imho.  \n\nThe best thing I ever started doing with my Moka pot was preheating the water and heating it on medium (as opposed to hot, which I used to do).  It's really easy to burn the coffee in a moka pot if you're not careful.  \n\nIf I were you I'd just switch to medium heat and preheating the water (if you don't already do that) and play with the grinder settings until you find something you like.",
      "1. pour room temp filtered (brita) water to the line\n2. grind to kosher salt consistency\n3. pile coffee into small pyramid-like shape, tapping gently 1-2 times to let grinds settle. DO NOT press down on this pile with your spoon. let it be.\n4. tightly close, and put on electric stove at 90% heat\n\nThis is my method, and I get really good coffee for a latte or cortado.\n\nAlso, dont put your hot moka pot under cold water. Let it cool naturally as sudden temp change can harm the metal. Wash using water only, but good enough to get rid of all coffee stain. I also do a citric acid boil every year to clean it. You must throw away the next coffee brew if you do this though. Aluminum leeching is bad!",
      "About that brew time and whether you should use already hot water: I have a stainless steel moka pot (Bialetti Venus) to use on my induction hob. At the beginning I unleash hellfire onto the moka pot until I hear the first faint signals of a rolling boil. Then I reduce the temperature to 6/10ish. That way I have my coffee in no time.\n\nI'm aware this tip might not be useful to everyone, but I still like to share. I started getting into coffee at home with it and it was a blast because of how comfortable it felt."
    ],
    "size": 20
  },
  {
    "keyword": "aeropress",
    "category": "brew",
    "examples": [
      "You're right, it's kind of weird. I used my aeropress for a long time, then got a new french press and suddenly haven't looked back. People should use whatever brewing method they want.",
      "I want to make a list of standard replies in different subs and switch them around between them. \n\n\"Hey, I'm looking for a good PSVR game to start with\" -\"Get Aeropress\"\n\n\"I'm looking for a cheap way to brew better coffee\" -\"Read Ender's Game\"",
      "Have you tried an Aeropress? /s",
      "The reason I recommend aeropress when people are asking for a choice between v60 or chemex or something like that is usually the poster also points out that\n\n* They don't have a grinder\n* If they do have a grinder, it's a blade grinder\n* They don't want or care about the freshness of the beans they buy. They want to buy grocery store beans.\n* They don't have a gooseneck or variable temp kettle and have no desire to acquire one\n* They drank gas station/dunkin/tim hortons/instant coffee up until now and \"want to get into coffee\" \n* They have no desire to weigh their beans or concern themselves with dosage.\n\n&#x200B;\n\nI started with the v60 without a gooseneck, scale, or var temp kettle or grinder and it was miserable. I was consistently making shit brews and wasting expensive beans. It wasn't until I went to a proper coffee shop and saw what they did that I started doing more research and now I use the v60 almost every day. After I got the hang of the v60 I got an aeropress and was blown away by how much less precise you can be and still land a great cup. Aeropress is the perfect gateway coffee product, and I wish I started with it instead of a v60.",
      "The Aeropress is simple and easy to use.\n\nExcept fuck you if you use it as intended, you have to do it *upside down*.",
      "The Aeropress is to /r/coffee what the Miata is to /r/cars",
      "What kind of grinder are you using and what kind of grind size do you work with? \n\nI've been there that all my aeropress tasted pretty similar and re-learning to play with grind size and getting a more consistent grinder (1zpresso k-max up from a porlex) made a big difference!",
      "Here's my advice: don't just believe what any expert says, especially when there's other experts doing other things.  \n\nBefore I get drawn and quartered, let me say JH is awesome and my fave overall\n\nBack when I was doing aeropress most of the time, I often dipped into those Aeropress championship recipes, including the high-dose ones.  People here on r/coffee would lecture me that \"those recipes only work for that exact coffee they used, and are only good for a couple of sips\".   Dude, have you even TRIED them?  No, they never had, they were just quoting JH.  I will tell you: I've made some of the best cups of coffee I've ever tasted in my life, with those recipes... and yes, the second and third and last sips were delicious too.   I don't use them often because the coffee dose makes me hyperactive and incoherent, but man, they make great coffee.\n\nI also used to challenge people to try Chad Wang's v60 recipe here.  It's opposite of everything JH says.... and still a WBC championship recipe, and often makes delicious coffee.\n\nTRY THIS SHIT OUT.  Don't just believe it when people blindly quote JH (or anyone else), especially if they themselves have never tried out alternatives.\n\nHell yes you should be trying other recipes types on the AP.  Just to see.  Maybe you go back to something more Wendelboe'ish, and if so great.  Or maybe you won't.",
      "Part of it I think is that using an aeropress is a ritual.  It is simple but involves a litlte manual work.  I get up in the morning, grind some beans while the water heats, and then put it all in an aeropress, stir it, and press.  just a little morning ritual.  simple enough to understand, its manual so its kind of an artform.",
      "I have to agree. I get the best tasting coffee from my Aeropress. It’s so god damn good hahah.",
      "What I don't understand is why I get so much better flavor out of an aeropress than a Clever or Hario Switch.  Why?  They're all basically just immersion, although with the aeropress there's pressure from the press (though it's nominal, so how could it make such a huge difference?) and it's common to agitate.  I don't get it.  Although I've been experimenting with the Switch (e.g. using Sprometheus's pourover/immersion hybrid) and getting impressive results.\n\nI do get different -- and for me, more enjoyable -- results from my v60, when I dial things in adequately.  But props to the aeropress for being so delicious, so consistently, so easily.\n\nOff topic from this thread, Switch vs Clever, I don't see why anyone would ever recommend the Clever.  The switch does everything the clever does, plus it's more convenient to experiment with multiple pours turning the switch on and off, plus it's a legit v60 if you ever want to learn pourover.  1000 out of 1000 times I'd recommend the Switch over the Clever.",
      "My dude.  Aeropress is what got me obsessed with coffee. I stopped using sugar the day I started the aeropress. No other coffee method tops it.",
      "That's a highly concentrated immersion brew coffee, still not an espresso though. An Aeropress cannot generate enough bars of pressure to produce an espresso shot.",
      "Not sure, which aeropress you have, but 90 grams of water is closer to the one mark volume, which is ~80 for me",
      "> low-strength coffee starts passing through the filter immediately\n\nthis is why you put the plunger in ASAP and leave it at the top of the column. that will form a vacuum which doesnt allow anything to drain out of the aeropress.",
      "It is not espresso in the slightest but I do agree Aeropress can make a tasty cup if done right.",
      "That's a short strong coffee but 90g of water from 20g of coffee is not espresso strength. And there's no way you'd be able to generate the 6-9 bars of pressure needed to make an espresso from an aeropress.\n\nEspresso is more like 20g of coffee in and 40g of liquid out.",
      "Wait til you move beyond the instructions!  Want to blow your mind, check out the recipes from some of the aeropress championships, 2018 champion and 2018 third place are among my faves ever",
      "My whole process is complete and coffee is the the cup within 2:30. It's good. Aeropress is my hotel brew method, so it is what it is.",
      "10 seconds is a scam. Let that shit sit for like 1-2 minutes and add water if need be. Aeropress is still my favorite cup of coffee between Chemex and French press."
    ],
    "size": 20
  },
  {
    "keyword": "arabica",
    "category": "origin",
    "examples": [
      "I grew up in Vietnam, and while I love Arabica for espresso, I cannot tolerate brewing Vietnamese coffee (both black and with condensed milk) with Arabica. The taste is just not “rich” enough compared to Robusta. Maybe that’s because I grew up with it, but that’s my preference.",
      "You know what you like, and that's a good thing.\n\nHonestly, I think Robusta is a little over maligned right now. I have a lot of fondness for robusta blends, they're what I grew up with. I love exploring all sorts of weird fruity arabica naturals, but nothing screams COFFEE in all caps to me like a robusta blend.\n\nAlso, I'm currently trying to learn to make a good Cafecito, so I'm on that Bustelo bandwagon now.",
      "I like the flavor of the good stuff, but I also love the dark, rich, spiciness of Robusta out of the Moka pot.  Bustelo is one of my favorites.  I've also brewed 100% Robusta beans in the Moccamaster and it came out delicious.  To me, Arabica and Robusta are just two different flavor profiles to enjoy.  So no, I don't think you're crazy at all, and I actually kind of resent coffee experts like James Hoffmann who dismiss Robusta out of hand as tasting bad.",
      "quality of the Robusta in the Philippines are getting better to be honest, compare to our local Arabicas",
      "There are multiple benefits for farms who put the work in to grow “shade grown” coffee. Avoiding mono-crop is always good. Farms often grow banana and avocado as an upper canopy to shade their arabica which they can then sell the produce of as well. It’s more work, sure, but you also have ecological benefits to expect for that. The Smithsonian Institution has a certification for bird friendly farms that help sustain and grow diverse bird populations which can help manage harmful pests. It’s important for birds to have varying heights to increase biodiversity though so keep that in mind. A farm that has banana and avocado trees as canopies can help increase bird species populations to the tune of dozens, nearing 100 depending on the area. \n\nFinally, yes, it is generally expected that shade grown coffee has the potential for more acidic complexity which can result in “better” coffee. That’s going to be completely dependent on a whole lot of other factors, but all other things being equal, the industry has for years now generally agreed that shade grown is relatively desired and preferred over clear cut sun grown. Of course nothing is without exceptions.",
      "We tested shade grown coffee some years ago with 3 varieties of Arabica and it was a disaster. The coffee was grown under avocado and banana. When independently cupped, the scores were almost identical to those grown under full sun. Yields were much lower and there were more pests. It was harder to pick because the limbs grew vertically trying to reach sunlight and not horizontally. Pulling the tall limbs down during picking would often snap them. Avocado will suck water out of the ground; great if you live in a boggy area, not so good if precipitation is limited. The banana trees started to dominate the plot where the coffee was grown. And banana trees are nearly impossible to eradicate even with chemicals. I have 2 neighbors that continue to grow shade grown coffee, but it doesn’t support them economically and it becomes a hobby or having Instagram rights that say they grow shade grown coffee; even if it’s a hundred pounds an acre. Did notice that root growth was good and strong with less fungus issues.",
      "I read the article as well as the paper it referenced.\n\nI think this is a poorly written article.\n\nThe issue here is that the article asks the sweeping question, \"why do genetically similar coffee beans taste so different?\". It then hinges the entire article on a paper that doesn't make any conclusive statement about coffee FLAVOR. The paper cited is exclusively looking into the explanation for the diversity of Arabica phenotypes despite minimal chromosomal differences. It seems to be well explained, IDK, I'm not a plant scientist. But most of the traits they reference are disease resistances. I don't think flavor is mentioned a single time.\n\nThis is a logical fallacy because anyone that works in plant science, viticulture, etc know that terroir and processing methods are hugely important in flavor. I can sell you some grafts for a Cabernet Franc grape that are all genetic clones. If you take those vines and graft them onto rootstock in Sonoma, California and rootstock in Bordeaux, you will have a very different final product. Soil composition, drainage, acidity, microbes, days of sun, days above certain temperatures, drought, frost, insect pressure and more will all make impactful changes to flavor at a chemical level. Then you can take that crop and process it in completely different manners and further differentiate products from the same crop.",
      "What you're looking for is probably not Robusta vs Arabica, but specifically a non-acidic coffee. Coffee's acidity based on **a ton of factors** and really you may be easier to find a good arabica/blend or even a pure arabica to fit your preference - it's not always like \"eh, robusta is robust! arabica is sour\".\n\nI'd recommend looking for a **specialty** coffee shop in your area - there staff should be able to help you find the right product that would taste good for you, where your ask should sound like \"I can't bear acidic coffees, and want something balanced, full-bodied, or even bitter\". \n\nI'd give that a shot.   \n\n\n*NB. Since you're based in the US, my favourite coffee roasters are Onyx. These guys are based in Arkansas with some huge variety of great coffee available - might also be worth a shot browsing through their website.*",
      "Costa coffee is a blend of arabica and robusta….not sure if it’s made it to the states yet - it’s the Nations Favourite in the UK",
      "I do this too here across the pond, we have newly arrived Lidl here in the Carolina's past 1.5 years,  prices are crazy low, .39 cent for a dozen eggs,  \n\nNot in Lidl but other grocery stores We have an old, old, old grocery coffee brand called Eight O'Clock,  They have a 100% Arabica Bean which is not that low in price but is competitive against the local Starbucks and such.  So, I'm a grocery store bean scavenger too.",
      "Liberica production is VERY scarce in the Philippines. The recent Taal eruption also made it worse. Barako, the common name for supposed liberica, have actually more robustas than libericas in it.  You can hardly find a single origin in widescale production, only small farmers. Anything that is sold commercially as batangas barako/ lipa barako is just dark roasted robusta, sometimes excelsa.\n\nYou will never find a pure liberica beans that easily sadly.\n\nThat said, I was able to try single origin liberica, roasted medium and one roasted light. It's really tasty, way different taste than arabicas and more nuanced than the usual medium roast excelsas that I buy. It's a shame liberica production is very scarce and only a few roasters support the farmers, and most suppliers from batangas have moved on from liberica trees into much more lucrative robustas but still market it as barako.",
      "I have been drinking Liberica beans from Johor, Malaysia for 5 months as daily morning cup. It has a unique and strong flavor, and I find it more palatable when brewed with lower dose compared to Arabica.\n\nI was able to make decent cup with pour over and immersion method, but somehow never a good cup via cold brew method. I would love to try it in espresso but sadly, I couldn't find any cafe offering it in Malaysia.",
      "I've tried a specialty roaster for Liberica here in Malaysia. It's a bit of a wild ride when it's roasted medium or light, almost having tropical fruit undertones. I enjoyed it while I had it, but it's not something I'd do for a daily drive, and I think it might be pungent for some.\n\nAs for the darker roasts, being that it dulls the natural flavours, it can pass as a cup comparable to Arabica beans.",
      "Liberica is all that's grown locally where in live (Zanzibar Archipelago).\n\nIt's not bad, but it's not enjoyable on its own I'd say. It gives an interesting spicy/rich flavor when mixed 10%-20% with a good quality Arabica as the primary bean. Higher than that it just gets awkward, pure Liberica to me tastes kind of thick and dusty with the strong bitterness of a bad robusta.\n\nHave friends' shops that source Liberica locally and blend it with Arabica from mainland Tanzania, and I enjoy the outcome.",
      "Firstly, there are many, many cultivars of Coffea Arabica. These can vary substantially in appearance. Second, coffee cultivation in Colombia takes place largely between approximately 3000 and 7000 feet above sea level. Beans grown at higher altitude will be smaller and denser than the same bean grown at lower altitude.",
      "This is the best tl;dr I could make, [original](http://www.theguardian.com/global-development/2015/may/01/coffee-catastrophe-beckons-as-climate-change-threatens-arabica-plant) reduced by 89%. (I'm a bot)\n*****\n> Dr Peter L&auml;derach, a CCAFS climate change specialist and co-author of the report, said that although some countries would be able to mitigate the &quot;Massive impact&quot; of climate change by simply moving their coffee to higher, cooler areas, it was not an option for everyone.\n\n> Dr Tim Schilling, executive director of World Coffee Research, which is funded by the global coffee industry, has his doubts.\n\n> &quot;For me, it all says brace yourselves for higher prices. The only glimmer on the horizon is the ability to change the coffee plant so that it produces decent coffee and yields under a climate-constrained environment.\"\n\n\n*****\n[**Extended Summary**](http://np.reddit.com/r/autotldr/comments/34krfu/coffee_catastrophe_beckons_as_climate_change/) | [FAQ](http://np.reddit.com/r/autotldr/comments/31b9fm/faq_autotldr_bot/ \"Version 1.5, ~14192 tl;drs so far.\") | [Theory](http://np.reddit.com/r/autotldr/comments/31bfht/theory_autotldr_concept/) | [Feedback](http://np.reddit.com/message/compose?to=%23autotldr \"PMs and comment replies are read by the bot admin, constructive feedback is welcome.\") | *Top* *five* *keywords*: **coffee**^#1 **countries**^#2 **change**^#3 **arabica**^#4 **climate**^#5\n\nPost found in [/r/worldnews](/r/worldnews/comments/34iak4/coffee_catastrophe_beckons_as_climate_change/), [/r/Coffee](/r/Coffee/comments/34i8v1/coffee_catastrophe_beckons_as_climate_change/), [/r/fringe](/r/fringe/comments/34khd1/are_we_actually_the_red_universe/), [/r/theworldnews](/r/theworldnews/comments/34jpss/coffee_catastrophe_beckons_as_climate_change/), [/r/news](/r/news/comments/34itol/coffee_catastrophe_beckons_as_climate_change/), [/r/jaszNewsCuration](/r/jaszNewsCuration/comments/34ie1b/coffee_catastrophe_beckons_as_climatechange/) and [/r/betternews](/r/betternews/comments/34iakz/coffee_catastrophe_beckons_as_climate_change/).",
      "This is a small collection of coffee plants that I keep. The coffee plant is a very robust plant and is quite easy to take care of. It is a house plant and needs indirect sunlight. Keep the soil moist at all times as this is a tropical plant. At 3 years old if you are lucky it will bare flowers followed by fruit as coffea arabica is self-pollinating. \n\nOnce per month feed with an organic fertiliser. At 3 years old switch the fertiliser to fruit and flower",
      "Hey man - congrats. They look great. \nI bought a plant from Kew Gardens in London, UK\nIt was a novelty plant- came in a mug. It said it was arabica. \nI've since repotted it into two pots. I think what I purchased was several plants in a single pot. \nQuestion - am I better to split each plant into its own pot? Currently I have 4 in one pot and 3 in another. \nThey are around 6 inches tall.",
      "Liberica is a coffee species that is not C. arabica. Liberica used to be called other things than Liberica but apparently those names have been reduced to Liberica. \n\nHere's a link to a non-Arabica blend.\n\nEDIT: That blend apparently is a blend of three of the four coffee species and excludes the species Arabica.  I've had Liberica and I feel it needs to be used in a blend. It has a very distinct taste. I may have to try some of that blend.\n\nhttps://lenscoffee.com/barako-blend-philippine-liberica-with-robusta-and-excelsa/",
      "I think you’re looking for different varietals(typica, bourbon, caturra, Ethiopian heirloom, etc.), not species, since nobody really drinks any species besides arabica and robusta. Depending on region and varietal, arabica coffees can taste wildly different from one another. \n\nHowever if you want to try robusta, death wish uses some apparently, but robusta tastes like burnt tires."
    ],
    "size": 20
  },
  {
    "keyword": "robusta",
    "category": "origin",
    "examples": [
      "I grew up in Vietnam, and while I love Arabica for espresso, I cannot tolerate brewing Vietnamese coffee (both black and with condensed milk) with Arabica. The taste is just not “rich” enough compared to Robusta. Maybe that’s because I grew up with it, but that’s my preference.",
      "You know what you like, and that's a good thing.\n\nHonestly, I think Robusta is a little over maligned right now. I have a lot of fondness for robusta blends, they're what I grew up with. I love exploring all sorts of weird fruity arabica naturals, but nothing screams COFFEE in all caps to me like a robusta blend.\n\nAlso, I'm currently trying to learn to make a good Cafecito, so I'm on that Bustelo bandwagon now.",
      "I like the flavor of the good stuff, but I also love the dark, rich, spiciness of Robusta out of the Moka pot.  Bustelo is one of my favorites.  I've also brewed 100% Robusta beans in the Moccamaster and it came out delicious.  To me, Arabica and Robusta are just two different flavor profiles to enjoy.  So no, I don't think you're crazy at all, and I actually kind of resent coffee experts like James Hoffmann who dismiss Robusta out of hand as tasting bad.",
      "quality of the Robusta in the Philippines are getting better to be honest, compare to our local Arabicas",
      "Love your post and feel the same. I like dark roasts specifically. Tried some 30-45€/kg beans and realized that every time there are robusta beans involved I liked them most. \n\n\nRight now (holidays in France) I enjoy pre ground 100% robusta from the bottom most shelf in the super market, in my bialetti coffee maker and I'm having a blast!",
      "Whenever I hear or see someone putting someone else down for having a preference for a certain type of coffee or method of roasting, it pisses me off.\n\nEnjoy your robusta! And especially, enjoy your Bustelo!! Imo, there's no other way to enjoy a TRUE Cuban cafecito. Bustelo and cafecitos are a match made in heaven. Anyone who disagrees, never had a cafecito made by a Cuban in Miami/NYC before. Don't feel insecure about liking your robusta. Feel bad for all the people trying to make you feel bad for enjoying something YOU BOUGHT WITH YOUR MONEY. They're just miserable.\n\nImo, Bustelo is the best robusta coffee you're gonna get. You can't go wrong! You can have it black, with sugar, with sugar and a lil milk, OR made into a latte/cappuccino with or without sugar. You honestly can't go wrong. But I grew up on Bustelo. My mom grew up having it when she migrated to NYC from El Salvador, because it's what New York Latinos drink. My Cuban stepfather would make the real deal Cuban cafecito for everyone, at parties. He grew up in Miami and Brooklyn his whole life. Once you go Bustelo, you cannot go back. Dark roast all day, everyday baybeeeeeee!!!! ❤️",
      "You need to go to an affluent Vietnamese neighborhood that has a coffee shop serving quality robusta. The Little Saigon area in Orange County comes to mind. Even then, you really have to look hard to find anything beyond the generic condensed milk kind.\n\nOutside of extremely niche Vietnamese coffee shops, 100% robusta is unfortunately non-existent in the American coffee scene. I'm hoping the misconception that all robusta is bitter and inferior will change. We should always welcome more variety!",
      "It’s way more common now. Vietnamese brands like Nguyen coffee and sitlo all importing robusta . It’s ok. Not great",
      "This is how Black Sheep Coffee started in the UK IIRC. I think that's where the name also came from.\n\nI remember talking to one of their baristas in their first shop (?) down in Old St. tube station circa 2012, and 100% robusta was their jam. \n\nAll that caffeine builds a pretty solid business case for the City. They're everywhere now, they have like 70 shops.",
      "I think robusta is marketed by the likes of Starbucks in the U.S. as low-quality coffee because it makes their \"100% arabica\" coffee sound more exclusive than it really is. So overall I think there's a stigma associated with it in the U.S. When people do get it, it's usually loaded up with sugary sweetness and flavors. \n\nWhen I went to Malaysia and Indonesia, I visited some coffee farms and roasteries, and robusta coffee definitely has its place on the coffee landscape without the negative connotations. The Kopi shops in Malaysia serve almost exclusively robusta, and you have to seek out a 3rd wave specialty shop to find arabica coffee. Many traditionalists in this part of the world prefer it over the arabica beans, which are more fruity and complex. I've had a lot of robusta, and, as a self-proclaimed coffee snob myself, I have developed a taste for it when it is brewed the traditional way or Thai/Vietnamese style.",
      "I’m pretty sure death wish coffee is 100% robusta and can be found at every Sprouts.",
      "Very rare, but robusta is being recognized as an option now. \n\nNyugen Coffee Supply, Fat Miilk and even Blue Bottle have either offered a full robusta or a blend. The first two are Vietnamese coffee roasters.",
      "I have a Vietnamese Coffee shop in Water, NY. We use 80% Robusta and it’s really popular. My customers also have positive responses to 90% Robusta.",
      "I've tried Robusta from a number of small roasters and I just... can't. At its best, it tastes like cereal grain – no sweetness, no floral or fruity notes, no acidity. At its worst, it tastes like burning tires.\n\nBut I've never liked super dark or low-acidity coffees, so you and I obviously have very different preferences.",
      "I drank some incredible iced fine robusta in Vietnam. It had delicious lemongrassy notes, it really surprised me.\n\nTbh even the regular phin brewed robusta I was served in homestays had a sweet, caramel taste, rather than the bitterness that everyone warns you about.",
      "I got a hold of some specialty robusta from India recently. It was a fairly light roast and it was shockingly good. Tasted very nutty, and had a popcorn-like sweetness with low acidity.",
      "Robustas can be great if properly processed and roasted like an arabica. But yeah a lot of robustas are treated poorly even in the farm level. Since its market price is low and demand in specialty coffee is low as well, a lot of farmers doesnt process it like an arabica because in some farmers mindset, why would they take effort in this species if they will only get a few cash out of it?",
      "make robusta great again",
      "i loooove robusta! like you, i am not a fan of acidity in coffee.   \n  \nalso, the flavors in robusta are often strong enough that i can add milk and still taste them. in fact, i think i often taste them better when i add milk, it opens up the flavor profile and rounds off the sharp edges.",
      "I tried [some ](https://www.rabbitholeroasters.com/collections/all-coffee/products/oatmeal-breakfast-robusta) from Rabbit Hole, and it was great. I really wish good quality robusta was more common (or really, any non-arabica). Like, specialty robusta blends would be killer. Hopefully, more roasters take initiative. \"How can robusta become tastier if we don't support the efforts of those dedicating their land to it?\""
    ],
    "size": 20
  },
  {
    "keyword": "ethiopia",
    "category": "origin",
    "examples": [
      "The war is in the northern-most province of Ethiopia, Tigray, and most coffee in Ethiopia is grown in the south/south-west, not in the region of conflict. \n\nEthicality in coffee is a slippery conversation because if we are honest, regardless of where in the world you buy it from, there’s always bad actors and exploitation somewhere. That’s why it’s best to purchase traceable coffee. The more transparent the process, the less opportunity available for exploitation",
      "This. Wanting to learn more about the coffee supply chain and its impacts on conflict zones too. Not just about Ethiopia but other regions too considering so much of speciality coffee are produced in so-called developing nations.",
      "\" I also don't understand much about which groups are fighting and why\"\n\nTigray region is lead by TPLF (Tigray People Libration Front) which dominated Ethiopian politics for 27 years (1991 - 2018). In 2018, TPLF was sidelined after a popular protest. The governing ethnic coalition TPLF formed wanted to move away from ethnic politics and formed the current governing party (Prosperity Parity). TPLF leaders strongly opposed this and withdrew from parliament, and then started war by attacking Ethiopian military command posts in Tigray region. On the same day the war started, a social media campaign to frame the war as genocide was launched. Tigray genocide is like “white genocide”  on steroids because TPLF can point to civilian victims of the war as evidence.\n\nThe real genocide in Ethiopia going on right now is against Amhara people. It is being committed by Oromo Libration Army which is an ally of TPLF. TPLF declared “Amhara people” their enemy in their founding document in 1976 and have been spreading hate speech since then. Now, other militant groups have taken up on this. Just a week ago , hundreds of civilians were killed, simply for being Amhara, by OLA (TPLF’s ally). \n\n[https://borkena.com/2022/09/30/the-new-auschwitz-wollega-oromia-region-ethiopia/](https://borkena.com/2022/09/30/the-new-auschwitz-wollega-oromia-region-ethiopia/)\n\nTPLF is like Donbas separatist group which wanted independence to join Russia. Tigray separatist want to  dominate Ethiopia if possible, else separate and join another country - Eritrea. Except the Eritreans don’t like TPLF hence TPLF wants to invade Eritrea and forcefully unite with Eritrea. This is why Eritrea is part of this conflict. Mainstream media is sold on Tigray victim narrative hence the talk about sanctions and all.  \nIn the end, it is a civil war, with many disputed narratives hard to grasp for outsiders. Best the international community can do is help the leaders negotiate and stop trying to sanction and worsen the economic blow due to this unnecessary war being fought between former partners who governed Ethiopia brutally for three decades.",
      "Well, considering it's a criminal offense to sell export quality coffee within Ethiopia, one could wonder if their coffee trade is ethical at all.\n\nedit: clarity",
      "Buying coffee from Ethiopia is very ethical. The war is in the North. Coffee is made in the South by people that have nothing to do with the war. I travel to southern Ethiopia a lot. The people there have nothing to do with the war. Most people in Ethiopia love people from Tigray and hope the war will end. There is no clear good guy in this war but the people selling coffee have nothing to do with this war. If you ever go to Ethiopia you will find they are the most welcoming and kind people. I'm from USA but consider Ethiopia my second home because of how hospitable the people are to me. Don't believe anything you hear about the war because most of it is propaganda. TPLF are masters of deception.",
      "Amazing article that all coffee drinkers should read, along with his previous post on Kenyan coffee. \n\nFor the people who dont wanna spend 40 minutes to find out: Feran says \"blueberry bombs\" were a quirk of how naturals were more crudely processed in previous years, and that while blueberry flavors are more uncommon now, quality has overall improved and flavors have diversified. I much prefer where Ethiopian coffee has gone in recent years, I've bought many coffees that have this delightful Gatorade-like grape juiciness that make it hard to put down the cup, unlike boozy berry natural process flavor that's only good for the first couple sips.",
      "Edit: I mis-threaded this. It’s not a response to the blog but to sentiment in the thread. Just for clarification. But I won’t delete.\n\nIf you don’t do green-buying you generally don’t have an idea of what is possible with each year of Ethiopian coffee. People often think that because their favorite roaster didn’t get any, it didn’t exist. Vibrant naturals can be divisive. Not everyone likes them. Shops tend to only buy a dozen or so coffees per year (a pallet of this, a pallet of that) unless they’re small enough that they only buy from specialized small-lot green sellers.\n\nLast year there were problems getting Ethiopian coffee into the US. There were containers on the water for months baking in the hot summer sun. Huge amounts of ruined G1 natural Ethiopia. The prior year there was plenty of berry forward natural Ethiopia.\n\nHowever, the whole industry has learned how to work on African style drying, and then beyond… you can find berries from almost any origin, at some point in the year.\n\nEthiopia, like most African coffee origins, has a host of challenges lately.",
      "It's amazing to see such a great deep dive into the mechanisms used to buy and sell coffee, the changing policy landscape, the effect of Ethiopia's coffee culture (and farming culture) on this, the technical factors that lead to the flavors we like, and the chemistry behind it, all in one.",
      "I still get really good strawberry bomb coffee from Ethiopia and also Rwanda",
      "Also if you like Ethiopia like that, try some of new Vietnam.",
      "This is happening worldwide and across all coffee-producing zones, as well as the rest of the world.  This effect will only really accelerate, and for all that some new growing zones will open up - not nearly enough to compensate, especially considering that those areas will not have established crops or growing industries, and many new areas will be in already-developed regions.  \n\nMore, the far deeper tragedy of what will be unfolding in Ethiopia is the loss of \"natural\" genestock: the natural home of coffee means there's a deep and rich biodiversity of wild Coffea species and varieties that we've only begun to fully explore, some of which may represent untapped potential for our enjoyment and cultivation.  If Ethiopia becomes unsuitable for commercial coffee cultivation, it'll be unsuitable for wild coffee too.",
      "Ethiopia is also embroiled in a bloodly civil war right now. Maybe not the best time to try and get their coffee.",
      "Kenyan and Ethiopian coffees are apples and oranges (maybe currants and blueberries is a better way of putting it). Kenyan coffees are prized for their acidity, and their fruit tones can land as tannic—think cranberry or grapefruit peel. They present flavors like tomato and tea spice. They're also commonly washed, whereas Ethiopian coffees can be washed, natural, or (increasingly) anaerobic. The Kenyan flavor composition owes to a host of factors, but worthy of mention are the origin's varietals, e.g., SL-28, which you very rarely see outside Kenya. For some, the bracing character of a Kenyan coffee can't be beat; for others, it's just not as appealing. It could be that you fall into the latter category, or it could be that you just haven't had one that resonated yet. In any case, loving Ethiopian cups does not suggest that you'll love Kenyan cups. Notwithstanding their proximity, they produce very different coffees.",
      "Region, process, roast, and a multitude of other factors culminate to create a flavor profile, but generally speaking I have found Ethiopian coffees to be fruit forward in presentation whilst Kenyan coffees tend toward an earthier and fruit reserved flavor profile.\n\nThe type of fruit that they tend towards is also a major difference. Ethiopian coffees present more berry and citrus fruits whilst Kenyan coffees tend towards more stone or pit fruit flavors in a jammier presentation.",
      "Maybe try out a Guatemalan coffee.  I love Ethiopian coffees and also am a big fan of Guatemalan coffee, I wouldn't necessarily say they are the same, but you may find a lot to like between them.  I have enjoyed some Kenyan coffees but have never really had strong fruity notes from them personally.",
      "It sounds like the Ethiopian you had was a natural processed coffee which would account for the acid and fruit. \n\nKenyan coffees USED to be the gold standard -- high amounts of phosphoric acid, huge amounts of lemony acidity with a solid chocolate foundation.   About 15 years ago you could get really stellar Kenyans -- when I first got my Q cert during that time there was a 95 point Kenyan on the table that tasted like lemon candy.  Simply mind blowing. You just don't see Kenyans of that quality available anymore these days. \n\nNow, with climate change and global warming, farmers have to plant higher and higher up the mountain to get those cold nights that is crucial to the acidity and floral lemon notes.  However, you can only grow so high until it is no longer profitable and you are stuck with coffee that is OK/not defective but certainly not stellar.  \n\nSince Kenyans are typically washed coffees, you don't get a lot of fruity notes if the coffee is somewhat lackluster.   With the natural processed Ethiopians, you get more fruit and flavor interest due to partly the coffee, but mostly due to the processing method so there is more wiggle room if your crop is not entirely up to par.  \n\nThis is one of the reasons why you are seeing a lot of wacky processing methods using special yeasts and fermentation -- it's basically to put lipstick on a pig.",
      "An important thing worth considering here is biology of coffee trees.  You'd think that having very similar climates and soil compositions (what with being directly next to each other and all) that Ethiopian and Kenyan coffees would be similar, much in the way that Guatemalan and Honduran ones are pretty similar, but this ignores the weird circuitous route that coffee took getting to Kenya. \n\n&#x200B;\n\nCoffee is botanically native to Southwestern Ethiopia.  Studies of coffee biology have shown that there are hundreds of different varieties of coffee in southwestern Ethiopia, and it still grows wild in certain forests there.  Genetic evidence then shows that it was gradually propagated across Ethiopia and into Yemen, because rather than the hundreds of different coffee varieties, Eastern Ethiopia and Yemen have dozens of coffee varietals.  \n\nThen in 1616 a pair of dutch spies stole a pair of coffee seedlings from Yemen and smuggled them into the new Dutch colony of Java in Indonesia.  These two seedlings are the ultimate descendents of every Arabica coffee plant in Indonesia today. \n\nMany years later a Dutch Javanese seedling was given to King Louis XIV of France as a diplomatic gift, which he kept in a greenhouse.  Years after this, a Martinique-born French botanist had the idea that coffee could potentially grow in the Caribbean, and so he went to Versailles, took a cutting of Louis XIV's tree and successfully propagated it back in his home island. \n\nEvery Arabica coffee plant in the new world for the next 250 or so years was a descendent of this tree. \n\nIt wasn't until the early 1900s directly after the British conquest of Kenya that there was an attempt made to create an export economy there. Coffee was introduced from New World plants in an attempt to create a British coffee industry headquartered in British East Africa. A company called Scott Labs was able to breed a number of cultivars from New World plants that were well suited to the temperate subtropical mountains outside of Nairobi, where cultivars with names beginning with \"SL\" for \"Scott Labs\" are still grown to this day. \n\nSo while climate is pretty similar, Biology could not be more different.",
      "Another difference I found is that Ethiopian's tend to be lighter in body(tea-like) and Kenyan beans have a richer earthy quality to them. I quite prefer Kenyan varietals over Ethiopian's.",
      "Someone may well correct me, but my experience is that Kenyan coffees are much more likely to be washed and Ethiopians are more likely to be naturals so there is immediately going to be a big difference in flavour profiles. \n\nTo me the typical Kenyan flavour is something like Ribena, while Ethiopians are often more floral. I recently enjoyed Rungeto roasted by Origin. \n\nWhich UK roasters have you been trying?",
      "People that like good washed ethiopian coffees often like good washed kenyan coffees. \n\nThey're not all that similar in taste. \n\nThey are alike in what they are *not* (not nutty, chocolatey, earthy, typically not best roasted dark). But that only means they are alike in very general ways.\n\nGenerally well done Kenyan coffees are light roast, very prominent acidity, heavy with hibiscus/tart berry flavors (not strawberry, but more like the tart aspect of a raspberry or currant)\n\nWell done Ethiopian coffees are also usually lighter roast, have a very wide range of variety, heavily dependent on location (landrace varieties), processing, roasting. Yirgacheffes are famous for having the potential to be very floral, delicate, fruity."
    ],
    "size": 20
  },
  {
    "keyword": "colombia",
    "category": "origin",
    "examples": [
      "I went to Glitch’s second store in Tokyo in November last year. I’ve been drinking and working in speciality  coffee for 12+ years now, and I think glitch is only worth experiencing at the store.\n\n\nI had a pour over (a Colombian, delicious but I’ve had better) \n\nAn espresso martini - this was phenomenal. Brewed on an Ethiopian with a cacao liqueur and gin.\n\nAnd finally, a whiskey barrel aged Brazilian flat white I believe. For a light roast coffee, this was transformational - and I think about it daily.\n\nMy wife pushed me to buy some beans, but at the price point I knew I couldn’t justify it as my home setup isn’t comparable to the true scientists that work at glitch.",
      "I also got a chance to go to glitch and it was amazing. I was on a work trip so I was able to use my company card as my lunch that day. \n\nDid a sampling of three and they were life changingly (coffee life) good. My favorite had this really subtle sweetness and tasted like melon. I’ve been chasing that ever since! I think it was a Colombia Monteblanco. \n\nI asked for their recipe and they brew at 86 degrees C and a 17.3 ratio.",
      "Loved Glitch when I visited Japan. I went to the one in Ginza, which didn't have too long of a line on a weekday morning, and brought back a jar of their honey-processed Colombian geisha. Their pour over brewing method, which requires 2 scales to measure input and output volumes, is the only V60 brewing method I've used that can consistently produce the intended flavor notes from of any beans.",
      "If this takes effect. Yes. Coffee prices will absolutely go up. Doesn’t matter whether you personally buy Colombian coffee.",
      "The entire market is linked to the C market price for the most part. \n\nA tariff on Colombia increases demand in other origins which will also raise their prices.\n\nThis can be really, really bad.",
      "Well, since Colombia caved in, this all seems kinda moot.",
      "What a great experience! You are bringing back so many memories for me. Six years ago I had a 2 month sabbatical in Colombia, mostly in Envidago/Medellin and a few weeks in Bogota. Of your list, I went to Pergamino a few times, and also had an amazing visit to Amor Perfecto. Brought some of their coffee home and savored it for as long as possible.\n\nMy favorite cafe experience in the country was in Envidago near where we lived for 6 weeks. It sadly didn't survive the pandemic, but the owners were so nice and so passionate about bringing the 3rd wave coffee experience to the Colombian people (and occasional tourists like me)! I went there multiple times a week and they humored me with my questions in rudimentary Spanish.\n\nWe also went to [Hacienda Venecia](https://haciendavenecia.com/en/home/) near Manizales on a side trip for a few days, and I can recommend both the accomodations and the coffee tour for those interested.\n\nThanks for your trip report and letting me walk down memory lane a bit!",
      "I think it would be nice to bring some quality coffee from Colombia, since basically all of the best stuff gets exported. [Here is a more classic example](https://www.blackwhiteroasters.com/collections/frontpage/products/the-sisters-rivera-2), and [here](https://www.ptscoffee.com/collections/single-origin-coffee/products/sidra-natural-lot-444) is a little more luxe/unique offering.",
      "Colombian here...\n\nAre you nuts? What kind of coffee do YOU want to buy here? Colombian coffee is best coffee, and a tinto is basically an americano",
      "As someone living in Colombia, bring a different origin. The government has archaic rules about importing coffee from other countries to control the market and the narrative of \"Colombia coffee is the best\". \n\nTinto is a sad excuse for coffee. Here on our farm the pickers drink tinto all day. It's just what's cheap and available. But it's mostly panela water with a splash of instant coffee in it.\n\nAnd trying something from a different country would be a great eye opener to how wide a variety of coffee types and flavors there are. Ethiopian blew the minds of our Mill workers recently. It's just so foreign to try coffee so fruit forward.",
      "[this instant coffee](https://sightglasscoffee.com/products/sightglass-instant-colombia-finca-alcatraz-wilfredo-ule-vargas) from a great roaster and colombian producer! would be fun for you all to try",
      "Colombia's got some good coffee.  They just produce so much and a lot of it is quantity over quality.  But there are a lot of good ones out there.",
      "I don't have any suggestions, but can confirm that I had some excellent coffee without even looking for it when I went to Colombia. My Colombian friend says that it was only pretty recently the Colombians realised how to make good coffee despite producing excellent beans, but that the cultural shift has been rapid.",
      "Take a bus from Medellin bus station to Jardin, around 3 hrs. Plenty of good coffee farms in the region. \n\nApart from that the region of Armenia in Colombia is supposed to be good, from what I know, though I haven't tried",
      "I can't help you with your question, but have a question of my own...Is it safe to do this kind of tour in Colombia? Because I would love to do the same.",
      "We went to Finca El Ocaso right by Salento. This was years ago, before I was even into coffee, which is most unfortunate! We stayed a couple nights on the farm and it was awesome. There were multiple tiers of tours and we did one that came with an extensive tasting and sensory session. There’s a nice little cafe on the farm with the most amazing views of the valley. Just walking around the farm and the surrounding area (there are trails) is great.\n\nWe went in the off season and were the only ones staying there overnight. Weather was cool then and most tourists come when it’s warmer. We had to pay some of the workers to make us dinner since there were no evening staff :P\n\nFrom what I recall the coffee was great, lots of different processes to try. Great tour and gorgeous spot. However I have no idea how it stacks up to other spots in Colombia, especially in terms of the coffee.",
      "I went to a coffee estate just outside of Medellin a couple of years ago and our guide said it’s quite difficult to find really good coffee because all of the best Colombian beans get exported",
      "Hey everyone! \n\nI think the review format of r/Scotch and r/Bourbon has a lot to offer to the community. Reviews help educate newbies about what’s out there, and how different whiskeys compare. It allows people to become familiar with distilleries, and provides an avenue for quality whisky to rewarded.\n\nThere are thousands of roasters out there. I think reviews would help distinguish quality roasters, and allow local roasters to get their name out there! If you have a local favorite, post a review and tell us about them!\n\nAnyways, on to the review!\n_______________\n     \n\n\n     \n**Colombia La Morelia - Heart Roasters - Portland, OR**     \n________\n**Region**: [Huila, Colombia](http://imgur.com/n1Ew34Q)     \n**Varietal**: Caturra, Colombia      \n**Process**: Fully Washed     \n**Elevation**: 1750m\n_________\n**Method**: Chemex     \n**Ratio**: 60g/L\n___________\n**Aroma**: Lots of milk chocolate, vanilla, toffee, and cinnamon     \n**Palate**: More milk chocolate, cranberry. As the cup cools, peach, mango, and floral tastes come through.     \n**Finish/Mouthfeel**: Toffee, pipe tobacco\n__________\n**Rating**: 90/100     \n     \nAs this is my first review, I will rate this as a 90 for a baseline. I am really enjoying this coffee so far! The milk chocolate flavor is very pleasant, and the fruity acidity adds a nice complexity to the cup. I would definitely recommend this! This was my first experience with Heart, and I'm pretty happy with it. You should check them out!",
      "Well, colombian here\n\nMy personal recommendation is to look for someone that can give you a specialized tour around the \"Eje Cafetero\" (roughly translated to \"Coffee Axxis\" or something like that). \nMy experience is that if you don't have any sort of expert by your side, you won't get much of an experience. \nAre you a coffee 'grower', a 'taster', an 'aficionado'?",
      "From Pereira you can take a bus to Salento in less than an hour. Salento is tourist-y, with lots of backpackers and hikers and gringos thanks to the nearby national park, but it is also beautiful and very coffee-focused. There are some great third wave (well, at least the modern Colombian equivalent) roasters and cafes in town. Also, remember that video of Don Elias and his plantation that was posted here recently? His estate is a half hour to an hour walk down a beautiful road from the center of Salento. He is definitely worth visiting, and is FULL of information and history and passion. Spanish helps with Don Elias himself, but his son speaks pretty good English.\n\nSadly I really only have been to Salento, so I can't speak to how it compares to other coffee experiences in the Eje, but I found what I did to be worthwhile."
    ],
    "size": 20
  }
]